contiki-os/contiki/cpu/arm/stm32l152/regs.h
/*
* Copyright (c) 2012, STMicroelectronics.
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions
* are met:
* 1. Redistributions of source code must retain the above copyright
*    notice, this list of conditions and the following disclaimer.
* 2. Redistributions in binary form must reproduce the above copyright
*    notice, this list of conditions and the following disclaimer in the
*    documentation and/or other materials provided with the distribution.
* 3. Neither the name of the Institute nor the names of its contributors
*    may be used to endorse or promote products derived from this software
*    without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE INSTITUTE AND CONTRIBUTORS ``AS IS'' AND
* ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED.  IN NO EVENT SHALL THE INSTITUTE OR CONTRIBUTORS BE LIABLE
* FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
* DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
* OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
* HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
* OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
* SUCH DAMAGE.
*
*
*/
/*---------------------------------------------------------------------------*/
#ifndef REGS_H_
#define REGS_H_                                           1
/*---------------------------------------------------------------------------*/
#define ReadRegister(a) a
#define WriteRegister(a, b) a = b

/* FLASH_BASE block */
#define DATA_FLASH_BASE_BASE                                 (0x00000000u)
#define DATA_FLASH_BASE_END                                  (0x0001FFFFu)
#define DATA_FLASH_BASE_SIZE                                 (DATA_FLASH_BASE_END - DATA_FLASH_BASE_BASE + 1)

/* FLASH block */
#define DATA_FLASH_BASE                                      (0x08000000u)
#define DATA_FLASH_END                                       (0x0801FFFFu)
#define DATA_FLASH_SIZE                                      (DATA_FLASH_END - DATA_FLASH_BASE + 1)

/* BIG_INFO_BASE block */
#define DATA_BIG_INFO_BASE_BASE                              (0x00000000u)
#define DATA_BIG_INFO_BASE_END                               (0x000007FFu)
#define DATA_BIG_INFO_BASE_SIZE                              (DATA_BIG_INFO_BASE_END - DATA_BIG_INFO_BASE_BASE + 1)

/* BIG_INFO block */
#define DATA_BIG_INFO_BASE                                   (0x08040000u)
#define DATA_BIG_INFO_END                                    (0x080407FFu)
#define DATA_BIG_INFO_SIZE                                   (DATA_BIG_INFO_END - DATA_BIG_INFO_BASE + 1)

/* SMALL_INFO block */
#define DATA_SMALL_INFO_BASE                                 (0x08040800u)
#define DATA_SMALL_INFO_END                                  (0x080409FFu)
#define DATA_SMALL_INFO_SIZE                                 (DATA_SMALL_INFO_END - DATA_SMALL_INFO_BASE + 1)

/* SRAM block */
#define DATA_SRAM_BASE                                       (0x20000000u)
#define DATA_SRAM_END                                        (0x20001FFFu)
#define DATA_SRAM_SIZE                                       (DATA_SRAM_END - DATA_SRAM_BASE + 1)

/* CM_HV block */
#define DATA_CM_HV_BASE                                      (0x40000000u)
#define DATA_CM_HV_END                                       (0x40000044u)
#define DATA_CM_HV_SIZE                                      (DATA_CM_HV_END - DATA_CM_HV_BASE + 1)

#define HV_SPARE                                             *((volatile uint32_t *)0x40000000u)
#define HV_SPARE_REG                                         *((volatile uint32_t *)0x40000000u)
#define HV_SPARE_ADDR                                        (0x40000000u)
#define HV_SPARE_RESET                                       (0x00000000u)
        /* HV_SPARE field */
        #define HV_SPARE_HV_SPARE                            (0x000000FFu)
        #define HV_SPARE_HV_SPARE_MASK                       (0x000000FFu)
        #define HV_SPARE_HV_SPARE_BIT                        (0)
        #define HV_SPARE_HV_SPARE_BITS                       (8)

#define EVENT_CTRL                                           *((volatile uint32_t *)0x40000004u)
#define EVENT_CTRL_REG                                       *((volatile uint32_t *)0x40000004u)
#define EVENT_CTRL_ADDR                                      (0x40000004u)
#define EVENT_CTRL_RESET                                     (0x00000000u)
        /* LV_FREEZE field */
        #define LV_FREEZE                                    (0x00000002u)
        #define LV_FREEZE_MASK                               (0x00000002u)
        #define LV_FREEZE_BIT                                (1)
        #define LV_FREEZE_BITS                               (1)

#define SLEEPTMR_CLKEN                                       *((volatile uint32_t *)0x40000008u)
#define SLEEPTMR_CLKEN_REG                                   *((volatile uint32_t *)0x40000008u)
#define SLEEPTMR_CLKEN_ADDR                                  (0x40000008u)
#define SLEEPTMR_CLKEN_RESET                                 (0x00000002u)
        /* SLEEPTMR_CLK10KEN field */
        #define SLEEPTMR_CLK10KEN                            (0x00000002u)
        #define SLEEPTMR_CLK10KEN_MASK                       (0x00000002u)
        #define SLEEPTMR_CLK10KEN_BIT                        (1)
        #define SLEEPTMR_CLK10KEN_BITS                       (1)
        /* SLEEPTMR_CLK32KEN field */
        #define SLEEPTMR_CLK32KEN                            (0x00000001u)
        #define SLEEPTMR_CLK32KEN_MASK                       (0x00000001u)
        #define SLEEPTMR_CLK32KEN_BIT                        (0)
        #define SLEEPTMR_CLK32KEN_BITS                       (1)

#define CLKRC_TUNE                                           *((volatile uint32_t *)0x4000000Cu)
#define CLKRC_TUNE_REG                                       *((volatile uint32_t *)0x4000000Cu)
#define CLKRC_TUNE_ADDR                                      (0x4000000Cu)
#define CLKRC_TUNE_RESET                                     (0x00000000u)
        /* CLKRC_TUNE_FIELD field */
        #define CLKRC_TUNE_FIELD                             (0x0000000Fu)
        #define CLKRC_TUNE_FIELD_MASK                        (0x0000000Fu)
        #define CLKRC_TUNE_FIELD_BIT                         (0)
        #define CLKRC_TUNE_FIELD_BITS                        (4)

#define CLK1K_CAL                                            *((volatile uint32_t *)0x40000010u)
#define CLK1K_CAL_REG                                        *((volatile uint32_t *)0x40000010u)
#define CLK1K_CAL_ADDR                                       (0x40000010u)
#define CLK1K_CAL_RESET                                      (0x00005000u)
        /* CLK1K_INTEGER field */
        #define CLK1K_INTEGER                                (0x0000F800u)
        #define CLK1K_INTEGER_MASK                           (0x0000F800u)
        #define CLK1K_INTEGER_BIT                            (11)
        #define CLK1K_INTEGER_BITS                           (5)
        /* CLK1K_FRACTIONAL field */
        #define CLK1K_FRACTIONAL                             (0x000007FFu)
        #define CLK1K_FRACTIONAL_MASK                        (0x000007FFu)
        #define CLK1K_FRACTIONAL_BIT                         (0)
        #define CLK1K_FRACTIONAL_BITS                        (11)

