contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define REGEN_DSLEEP                                         *((volatile uint32_t *)0x40000014u)
#define REGEN_DSLEEP_REG                                     *((volatile uint32_t *)0x40000014u)
#define REGEN_DSLEEP_ADDR                                    (0x40000014u)
#define REGEN_DSLEEP_RESET                                   (0x00000001u)
        /* REGEN_DSLEEP_FIELD field */
        #define REGEN_DSLEEP_FIELD                           (0x00000001u)
        #define REGEN_DSLEEP_FIELD_MASK                      (0x00000001u)
        #define REGEN_DSLEEP_FIELD_BIT                       (0)
        #define REGEN_DSLEEP_FIELD_BITS                      (1)

#define VREG                                                 *((volatile uint32_t *)0x40000018u)
#define VREG_REG                                             *((volatile uint32_t *)0x40000018u)
#define VREG_ADDR                                            (0x40000018u)
#define VREG_RESET                                           (0x00000207u)
        /* VREF_EN field */
        #define VREG_VREF_EN                                 (0x00008000u)
        #define VREG_VREF_EN_MASK                            (0x00008000u)
        #define VREG_VREF_EN_BIT                             (15)
        #define VREG_VREF_EN_BITS                            (1)
        /* VREF_TEST field */
        #define VREG_VREF_TEST                               (0x00004000u)
        #define VREG_VREF_TEST_MASK                          (0x00004000u)
        #define VREG_VREF_TEST_BIT                           (14)
        #define VREG_VREF_TEST_BITS                          (1)
        /* VREG_1V8_EN field */
        #define VREG_VREG_1V8_EN                             (0x00000800u)
        #define VREG_VREG_1V8_EN_MASK                        (0x00000800u)
        #define VREG_VREG_1V8_EN_BIT                         (11)
        #define VREG_VREG_1V8_EN_BITS                        (1)
        /* VREG_1V8_TEST field */
        #define VREG_VREG_1V8_TEST                           (0x00000400u)
        #define VREG_VREG_1V8_TEST_MASK                      (0x00000400u)
        #define VREG_VREG_1V8_TEST_BIT                       (10)
        #define VREG_VREG_1V8_TEST_BITS                      (1)
        /* VREG_1V8_TRIM field */
        #define VREG_VREG_1V8_TRIM                           (0x00000380u)
        #define VREG_VREG_1V8_TRIM_MASK                      (0x00000380u)
        #define VREG_VREG_1V8_TRIM_BIT                       (7)
        #define VREG_VREG_1V8_TRIM_BITS                      (3)
        /* VREG_1V2_EN field */
        #define VREG_VREG_1V2_EN                             (0x00000010u)
        #define VREG_VREG_1V2_EN_MASK                        (0x00000010u)
        #define VREG_VREG_1V2_EN_BIT                         (4)
        #define VREG_VREG_1V2_EN_BITS                        (1)
        /* VREG_1V2_TEST field */
        #define VREG_VREG_1V2_TEST                           (0x00000008u)
        #define VREG_VREG_1V2_TEST_MASK                      (0x00000008u)
        #define VREG_VREG_1V2_TEST_BIT                       (3)
        #define VREG_VREG_1V2_TEST_BITS                      (1)
        /* VREG_1V2_TRIM field */
        #define VREG_VREG_1V2_TRIM                           (0x00000007u)
        #define VREG_VREG_1V2_TRIM_MASK                      (0x00000007u)
        #define VREG_VREG_1V2_TRIM_BIT                       (0)
        #define VREG_VREG_1V2_TRIM_BITS                      (3)

#define WAKE_SEL                                             *((volatile uint32_t *)0x40000020u)
#define WAKE_SEL_REG                                         *((volatile uint32_t *)0x40000020u)
#define WAKE_SEL_ADDR                                        (0x40000020u)
#define WAKE_SEL_RESET                                       (0x00000200u)
        /* WAKE_CSYSPWRUPREQ field */
        #define WAKE_CSYSPWRUPREQ                            (0x00000200u)
        #define WAKE_CSYSPWRUPREQ_MASK                       (0x00000200u)
        #define WAKE_CSYSPWRUPREQ_BIT                        (9)
        #define WAKE_CSYSPWRUPREQ_BITS                       (1)
        /* WAKE_CDBGPWRUPREQ field */
        #define WAKE_CDBGPWRUPREQ                            (0x00000100u)
        #define WAKE_CDBGPWRUPREQ_MASK                       (0x00000100u)
        #define WAKE_CDBGPWRUPREQ_BIT                        (8)
        #define WAKE_CDBGPWRUPREQ_BITS                       (1)
        /* WAKE_WAKE_CORE field */
        #define WAKE_WAKE_CORE                               (0x00000080u)
        #define WAKE_WAKE_CORE_MASK                          (0x00000080u)
        #define WAKE_WAKE_CORE_BIT                           (7)
        #define WAKE_WAKE_CORE_BITS                          (1)
        /* WAKE_SLEEPTMRWRAP field */
        #define WAKE_SLEEPTMRWRAP                            (0x00000040u)
        #define WAKE_SLEEPTMRWRAP_MASK                       (0x00000040u)
        #define WAKE_SLEEPTMRWRAP_BIT                        (6)
        #define WAKE_SLEEPTMRWRAP_BITS                       (1)
        /* WAKE_SLEEPTMRCMPB field */
        #define WAKE_SLEEPTMRCMPB                            (0x00000020u)
        #define WAKE_SLEEPTMRCMPB_MASK                       (0x00000020u)
        #define WAKE_SLEEPTMRCMPB_BIT                        (5)
        #define WAKE_SLEEPTMRCMPB_BITS                       (1)
        /* WAKE_SLEEPTMRCMPA field */
        #define WAKE_SLEEPTMRCMPA                            (0x00000010u)
        #define WAKE_SLEEPTMRCMPA_MASK                       (0x00000010u)
        #define WAKE_SLEEPTMRCMPA_BIT                        (4)
        #define WAKE_SLEEPTMRCMPA_BITS                       (1)
        /* WAKE_IRQD field */
        #define WAKE_IRQD                                    (0x00000008u)
        #define WAKE_IRQD_MASK                               (0x00000008u)
        #define WAKE_IRQD_BIT                                (3)
        #define WAKE_IRQD_BITS                               (1)
        /* WAKE_SC2 field */
        #define WAKE_SC2                                     (0x00000004u)
        #define WAKE_SC2_MASK                                (0x00000004u)
        #define WAKE_SC2_BIT                                 (2)
        #define WAKE_SC2_BITS                                (1)
        /* WAKE_SC1 field */
        #define WAKE_SC1                                     (0x00000002u)
        #define WAKE_SC1_MASK                                (0x00000002u)
        #define WAKE_SC1_BIT                                 (1)
        #define WAKE_SC1_BITS                                (1)
        /* GPIO_WAKE field */
        #define GPIO_WAKE                                    (0x00000001u)
        #define GPIO_WAKE_MASK                               (0x00000001u)
        #define GPIO_WAKE_BIT                                (0)
        #define GPIO_WAKE_BITS                               (1)

#define WAKE_CORE                                            *((volatile uint32_t *)0x40000024u)
#define WAKE_CORE_REG                                        *((volatile uint32_t *)0x40000024u)
#define WAKE_CORE_ADDR                                       (0x40000024u)
#define WAKE_CORE_RESET                                      (0x00000000u)
        /* WAKE_CORE_FIELD field */
        #define WAKE_CORE_FIELD                              (0x00000020u)
        #define WAKE_CORE_FIELD_MASK                         (0x00000020u)
        #define WAKE_CORE_FIELD_BIT                          (5)
        #define WAKE_CORE_FIELD_BITS                         (1)

