contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define PWRUP_EVENT                                          *((volatile uint32_t *)0x40000028u)
#define PWRUP_EVENT_REG                                      *((volatile uint32_t *)0x40000028u)
#define PWRUP_EVENT_ADDR                                     (0x40000028u)
#define PWRUP_EVENT_RESET                                    (0x00000000u)
        /* PWRUP_CSYSPWRUPREQ field */
        #define PWRUP_CSYSPWRUPREQ                           (0x00000200u)
        #define PWRUP_CSYSPWRUPREQ_MASK                      (0x00000200u)
        #define PWRUP_CSYSPWRUPREQ_BIT                       (9)
        #define PWRUP_CSYSPWRUPREQ_BITS                      (1)
        /* PWRUP_CDBGPWRUPREQ field */
        #define PWRUP_CDBGPWRUPREQ                           (0x00000100u)
        #define PWRUP_CDBGPWRUPREQ_MASK                      (0x00000100u)
        #define PWRUP_CDBGPWRUPREQ_BIT                       (8)
        #define PWRUP_CDBGPWRUPREQ_BITS                      (1)
        /* PWRUP_WAKECORE field */
        #define PWRUP_WAKECORE                               (0x00000080u)
        #define PWRUP_WAKECORE_MASK                          (0x00000080u)
        #define PWRUP_WAKECORE_BIT                           (7)
        #define PWRUP_WAKECORE_BITS                          (1)
        /* PWRUP_SLEEPTMRWRAP field */
        #define PWRUP_SLEEPTMRWRAP                           (0x00000040u)
        #define PWRUP_SLEEPTMRWRAP_MASK                      (0x00000040u)
        #define PWRUP_SLEEPTMRWRAP_BIT                       (6)
        #define PWRUP_SLEEPTMRWRAP_BITS                      (1)
        /* PWRUP_SLEEPTMRCOMPB field */
        #define PWRUP_SLEEPTMRCOMPB                          (0x00000020u)
        #define PWRUP_SLEEPTMRCOMPB_MASK                     (0x00000020u)
        #define PWRUP_SLEEPTMRCOMPB_BIT                      (5)
        #define PWRUP_SLEEPTMRCOMPB_BITS                     (1)
        /* PWRUP_SLEEPTMRCOMPA field */
        #define PWRUP_SLEEPTMRCOMPA                          (0x00000010u)
        #define PWRUP_SLEEPTMRCOMPA_MASK                     (0x00000010u)
        #define PWRUP_SLEEPTMRCOMPA_BIT                      (4)
        #define PWRUP_SLEEPTMRCOMPA_BITS                     (1)
        /* PWRUP_IRQD field */
        #define PWRUP_IRQD                                   (0x00000008u)
        #define PWRUP_IRQD_MASK                              (0x00000008u)
        #define PWRUP_IRQD_BIT                               (3)
        #define PWRUP_IRQD_BITS                              (1)
        /* PWRUP_SC2 field */
        #define PWRUP_SC2                                    (0x00000004u)
        #define PWRUP_SC2_MASK                               (0x00000004u)
        #define PWRUP_SC2_BIT                                (2)
        #define PWRUP_SC2_BITS                               (1)
        /* PWRUP_SC1 field */
        #define PWRUP_SC1                                    (0x00000002u)
        #define PWRUP_SC1_MASK                               (0x00000002u)
        #define PWRUP_SC1_BIT                                (1)
        #define PWRUP_SC1_BITS                               (1)
        /* PWRUP_GPIO field */
        #define PWRUP_GPIO                                   (0x00000001u)
        #define PWRUP_GPIO_MASK                              (0x00000001u)
        #define PWRUP_GPIO_BIT                               (0)
        #define PWRUP_GPIO_BITS                              (1)

#define RESET_EVENT                                          *((volatile uint32_t *)0x4000002Cu)
#define RESET_EVENT_REG                                      *((volatile uint32_t *)0x4000002Cu)
#define RESET_EVENT_ADDR                                     (0x4000002Cu)
#define RESET_EVENT_RESET                                    (0x00000001u)
        /* RESET_CPULOCKUP field */
        #define RESET_CPULOCKUP                              (0x00000080u)
        #define RESET_CPULOCKUP_MASK                         (0x00000080u)
        #define RESET_CPULOCKUP_BIT                          (7)
        #define RESET_CPULOCKUP_BITS                         (1)
        /* RESET_OPTBYTEFAIL field */
        #define RESET_OPTBYTEFAIL                            (0x00000040u)
        #define RESET_OPTBYTEFAIL_MASK                       (0x00000040u)
        #define RESET_OPTBYTEFAIL_BIT                        (6)
        #define RESET_OPTBYTEFAIL_BITS                       (1)
        /* RESET_DSLEEP field */
        #define RESET_DSLEEP                                 (0x00000020u)
        #define RESET_DSLEEP_MASK                            (0x00000020u)
        #define RESET_DSLEEP_BIT                             (5)
        #define RESET_DSLEEP_BITS                            (1)
        /* RESET_SW field */
        #define RESET_SW                                     (0x00000010u)
        #define RESET_SW_MASK                                (0x00000010u)
        #define RESET_SW_BIT                                 (4)
        #define RESET_SW_BITS                                (1)
        /* RESET_WDOG field */
        #define RESET_WDOG                                   (0x00000008u)
        #define RESET_WDOG_MASK                              (0x00000008u)
        #define RESET_WDOG_BIT                               (3)
        #define RESET_WDOG_BITS                              (1)
        /* RESET_NRESET field */
        #define RESET_NRESET                                 (0x00000004u)
        #define RESET_NRESET_MASK                            (0x00000004u)
        #define RESET_NRESET_BIT                             (2)
        #define RESET_NRESET_BITS                            (1)
        /* RESET_PWRLV field */
        #define RESET_PWRLV                                  (0x00000002u)
        #define RESET_PWRLV_MASK                             (0x00000002u)
        #define RESET_PWRLV_BIT                              (1)
        #define RESET_PWRLV_BITS                             (1)
        /* RESET_PWRHV field */
        #define RESET_PWRHV                                  (0x00000001u)
        #define RESET_PWRHV_MASK                             (0x00000001u)
        #define RESET_PWRHV_BIT                              (0)
        #define RESET_PWRHV_BITS                             (1)

#define DBG_MBOX                                             *((volatile uint32_t *)0x40000030u)
#define DBG_MBOX_REG                                         *((volatile uint32_t *)0x40000030u)
#define DBG_MBOX_ADDR                                        (0x40000030u)
#define DBG_MBOX_RESET                                       (0x00000000u)
        /* DBG_MBOX field */
        #define DBG_MBOX_DBG_MBOX                            (0x0000FFFFu)
        #define DBG_MBOX_DBG_MBOX_MASK                       (0x0000FFFFu)
        #define DBG_MBOX_DBG_MBOX_BIT                        (0)
        #define DBG_MBOX_DBG_MBOX_BITS                       (16)

#define CPWRUPREQ_STATUS                                     *((volatile uint32_t *)0x40000034u)
#define CPWRUPREQ_STATUS_REG                                 *((volatile uint32_t *)0x40000034u)
#define CPWRUPREQ_STATUS_ADDR                                (0x40000034u)
#define CPWRUPREQ_STATUS_RESET                               (0x00000000u)
        /* CPWRUPREQ field */
        #define CPWRUPREQ_STATUS_CPWRUPREQ                   (0x00000001u)
        #define CPWRUPREQ_STATUS_CPWRUPREQ_MASK              (0x00000001u)
        #define CPWRUPREQ_STATUS_CPWRUPREQ_BIT               (0)
        #define CPWRUPREQ_STATUS_CPWRUPREQ_BITS              (1)

#define CSYSPWRUPREQ_STATUS                                  *((volatile uint32_t *)0x40000038u)
#define CSYSPWRUPREQ_STATUS_REG                              *((volatile uint32_t *)0x40000038u)
#define CSYSPWRUPREQ_STATUS_ADDR                             (0x40000038u)
#define CSYSPWRUPREQ_STATUS_RESET                            (0x00000000u)
        /* CSYSPWRUPREQ field */
        #define CSYSPWRUPREQ_STATUS_CSYSPWRUPREQ             (0x00000001u)
        #define CSYSPWRUPREQ_STATUS_CSYSPWRUPREQ_MASK        (0x00000001u)
        #define CSYSPWRUPREQ_STATUS_CSYSPWRUPREQ_BIT         (0)
        #define CSYSPWRUPREQ_STATUS_CSYSPWRUPREQ_BITS        (1)

#define CSYSPWRUPACK_STATUS                                  *((volatile uint32_t *)0x4000003Cu)
#define CSYSPWRUPACK_STATUS_REG                              *((volatile uint32_t *)0x4000003Cu)
#define CSYSPWRUPACK_STATUS_ADDR                             (0x4000003Cu)
#define CSYSPWRUPACK_STATUS_RESET                            (0x00000000u)
        /* CSYSPWRUPACK field */
        #define CSYSPWRUPACK_STATUS_CSYSPWRUPACK             (0x00000001u)
        #define CSYSPWRUPACK_STATUS_CSYSPWRUPACK_MASK        (0x00000001u)
        #define CSYSPWRUPACK_STATUS_CSYSPWRUPACK_BIT         (0)
        #define CSYSPWRUPACK_STATUS_CSYSPWRUPACK_BITS        (1)

#define CSYSPWRUPACK_INHIBIT                                 *((volatile uint32_t *)0x40000040u)
#define CSYSPWRUPACK_INHIBIT_REG                             *((volatile uint32_t *)0x40000040u)
#define CSYSPWRUPACK_INHIBIT_ADDR                            (0x40000040u)
#define CSYSPWRUPACK_INHIBIT_RESET                           (0x00000000u)
        /* CSYSPWRUPACK_INHIBIT field */
        #define CSYSPWRUPACK_INHIBIT_CSYSPWRUPACK_INHIBIT    (0x00000001u)
        #define CSYSPWRUPACK_INHIBIT_CSYSPWRUPACK_INHIBIT_MASK (0x00000001u)
        #define CSYSPWRUPACK_INHIBIT_CSYSPWRUPACK_INHIBIT_BIT (0)
        #define CSYSPWRUPACK_INHIBIT_CSYSPWRUPACK_INHIBIT_BITS (1)

