contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define OPT_ERR_MAINTAIN_WAKE                                *((volatile uint32_t *)0x40000044u)
#define OPT_ERR_MAINTAIN_WAKE_REG                            *((volatile uint32_t *)0x40000044u)
#define OPT_ERR_MAINTAIN_WAKE_ADDR                           (0x40000044u)
#define OPT_ERR_MAINTAIN_WAKE_RESET                          (0x00000000u)
        /* OPT_ERR_MAINTAIN_WAKE field */
        #define OPT_ERR_MAINTAIN_WAKE_OPT_ERR_MAINTAIN_WAKE  (0x00000001u)
        #define OPT_ERR_MAINTAIN_WAKE_OPT_ERR_MAINTAIN_WAKE_MASK (0x00000001u)
        #define OPT_ERR_MAINTAIN_WAKE_OPT_ERR_MAINTAIN_WAKE_BIT (0)
        #define OPT_ERR_MAINTAIN_WAKE_OPT_ERR_MAINTAIN_WAKE_BITS (1)

/* BASEBAND block */
#define DATA_BASEBAND_BASE                                   (0x40001000u)
#define DATA_BASEBAND_END                                    (0x40001114u)
#define DATA_BASEBAND_SIZE                                   (DATA_BASEBAND_END - DATA_BASEBAND_BASE + 1)

#define MOD_CAL_CTRL                                         *((volatile uint32_t *)0x40001000u)
#define MOD_CAL_CTRL_REG                                     *((volatile uint32_t *)0x40001000u)
#define MOD_CAL_CTRL_ADDR                                    (0x40001000u)
#define MOD_CAL_CTRL_RESET                                   (0x00000000u)
        /* MOD_CAL_GO field */
        #define MOD_CAL_CTRL_MOD_CAL_GO                      (0x00008000u)
        #define MOD_CAL_CTRL_MOD_CAL_GO_MASK                 (0x00008000u)
        #define MOD_CAL_CTRL_MOD_CAL_GO_BIT                  (15)
        #define MOD_CAL_CTRL_MOD_CAL_GO_BITS                 (1)
        /* MOD_CAL_DONE field */
        #define MOD_CAL_CTRL_MOD_CAL_DONE                    (0x00000010u)
        #define MOD_CAL_CTRL_MOD_CAL_DONE_MASK               (0x00000010u)
        #define MOD_CAL_CTRL_MOD_CAL_DONE_BIT                (4)
        #define MOD_CAL_CTRL_MOD_CAL_DONE_BITS               (1)
        /* MOD_CAL_CYCLES field */
        #define MOD_CAL_CTRL_MOD_CAL_CYCLES                  (0x00000003u)
        #define MOD_CAL_CTRL_MOD_CAL_CYCLES_MASK             (0x00000003u)
        #define MOD_CAL_CTRL_MOD_CAL_CYCLES_BIT              (0)
        #define MOD_CAL_CTRL_MOD_CAL_CYCLES_BITS             (2)

#define MOD_CAL_COUNT_H                                      *((volatile uint32_t *)0x40001004u)
#define MOD_CAL_COUNT_H_REG                                  *((volatile uint32_t *)0x40001004u)
#define MOD_CAL_COUNT_H_ADDR                                 (0x40001004u)
#define MOD_CAL_COUNT_H_RESET                                (0x00000000u)
        /* MOD_CAL_COUNT_H field */
        #define MOD_CAL_COUNT_H_MOD_CAL_COUNT_H              (0x000000FFu)
        #define MOD_CAL_COUNT_H_MOD_CAL_COUNT_H_MASK         (0x000000FFu)
        #define MOD_CAL_COUNT_H_MOD_CAL_COUNT_H_BIT          (0)
        #define MOD_CAL_COUNT_H_MOD_CAL_COUNT_H_BITS         (8)

#define MOD_CAL_COUNT_L                                      *((volatile uint32_t *)0x40001008u)
#define MOD_CAL_COUNT_L_REG                                  *((volatile uint32_t *)0x40001008u)
#define MOD_CAL_COUNT_L_ADDR                                 (0x40001008u)
#define MOD_CAL_COUNT_L_RESET                                (0x00000000u)
        /* MOD_CAL_COUNT_L field */
        #define MOD_CAL_COUNT_L_MOD_CAL_COUNT_L              (0x0000FFFFu)
        #define MOD_CAL_COUNT_L_MOD_CAL_COUNT_L_MASK         (0x0000FFFFu)
        #define MOD_CAL_COUNT_L_MOD_CAL_COUNT_L_BIT          (0)
        #define MOD_CAL_COUNT_L_MOD_CAL_COUNT_L_BITS         (16)

#define RSSI_ROLLING                                         *((volatile uint32_t *)0x4000100Cu)
#define RSSI_ROLLING_REG                                     *((volatile uint32_t *)0x4000100Cu)
#define RSSI_ROLLING_ADDR                                    (0x4000100Cu)
#define RSSI_ROLLING_RESET                                   (0x00000000u)
        /* RSSI_ROLLING field */
        #define RSSI_ROLLING_RSSI_ROLLING                    (0x00003FFFu)
        #define RSSI_ROLLING_RSSI_ROLLING_MASK               (0x00003FFFu)
        #define RSSI_ROLLING_RSSI_ROLLING_BIT                (0)
        #define RSSI_ROLLING_RSSI_ROLLING_BITS               (14)

#define RSSI_PKT                                             *((volatile uint32_t *)0x40001010u)
#define RSSI_PKT_REG                                         *((volatile uint32_t *)0x40001010u)
#define RSSI_PKT_ADDR                                        (0x40001010u)
#define RSSI_PKT_RESET                                       (0x00000000u)
        /* RSSI_PKT field */
        #define RSSI_PKT_RSSI_PKT                            (0x000000FFu)
        #define RSSI_PKT_RSSI_PKT_MASK                       (0x000000FFu)
        #define RSSI_PKT_RSSI_PKT_BIT                        (0)
        #define RSSI_PKT_RSSI_PKT_BITS                       (8)

#define RX_ADC                                               *((volatile uint32_t *)0x40001014u)
#define RX_ADC_REG                                           *((volatile uint32_t *)0x40001014u)
#define RX_ADC_ADDR                                          (0x40001014u)
#define RX_ADC_RESET                                         (0x00000024u)
        /* RX_ADC field */
        #define RX_ADC_RX_ADC                                (0x0000007Fu)
        #define RX_ADC_RX_ADC_MASK                           (0x0000007Fu)
        #define RX_ADC_RX_ADC_BIT                            (0)
        #define RX_ADC_RX_ADC_BITS                           (7)

#define DEBUG_BB_MODE                                        *((volatile uint32_t *)0x40001018u)
#define DEBUG_BB_MODE_REG                                    *((volatile uint32_t *)0x40001018u)
#define DEBUG_BB_MODE_ADDR                                   (0x40001018u)
#define DEBUG_BB_MODE_RESET                                  (0x00000000u)
        /* DEBUG_BB_MODE_EN field */
        #define DEBUG_BB_MODE_DEBUG_BB_MODE_EN               (0x00008000u)
        #define DEBUG_BB_MODE_DEBUG_BB_MODE_EN_MASK          (0x00008000u)
        #define DEBUG_BB_MODE_DEBUG_BB_MODE_EN_BIT           (15)
        #define DEBUG_BB_MODE_DEBUG_BB_MODE_EN_BITS          (1)
        /* DEBUG_BB_MODE field */
        #define DEBUG_BB_MODE_DEBUG_BB_MODE                  (0x00000003u)
        #define DEBUG_BB_MODE_DEBUG_BB_MODE_MASK             (0x00000003u)
        #define DEBUG_BB_MODE_DEBUG_BB_MODE_BIT              (0)
        #define DEBUG_BB_MODE_DEBUG_BB_MODE_BITS             (2)

#define BB_DEBUG                                             *((volatile uint32_t *)0x4000101Cu)
#define BB_DEBUG_REG                                         *((volatile uint32_t *)0x4000101Cu)
#define BB_DEBUG_ADDR                                        (0x4000101Cu)
#define BB_DEBUG_RESET                                       (0x00000002u)
        /* SYNC_REG_EN field */
        #define BB_DEBUG_SYNC_REG_EN                         (0x00008000u)
        #define BB_DEBUG_SYNC_REG_EN_MASK                    (0x00008000u)
        #define BB_DEBUG_SYNC_REG_EN_BIT                     (15)
        #define BB_DEBUG_SYNC_REG_EN_BITS                    (1)
        /* DEBUG_MUX_ADDR field */
        #define BB_DEBUG_DEBUG_MUX_ADDR                      (0x000000F0u)
        #define BB_DEBUG_DEBUG_MUX_ADDR_MASK                 (0x000000F0u)
        #define BB_DEBUG_DEBUG_MUX_ADDR_BIT                  (4)
        #define BB_DEBUG_DEBUG_MUX_ADDR_BITS                 (4)
        /* BB_DEBUG_SEL field */
        #define BB_DEBUG_BB_DEBUG_SEL                        (0x00000003u)
        #define BB_DEBUG_BB_DEBUG_SEL_MASK                   (0x00000003u)
        #define BB_DEBUG_BB_DEBUG_SEL_BIT                    (0)
        #define BB_DEBUG_BB_DEBUG_SEL_BITS                   (2)

