contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define BB_DEBUG_VIEW                                        *((volatile uint32_t *)0x40001020u)
#define BB_DEBUG_VIEW_REG                                    *((volatile uint32_t *)0x40001020u)
#define BB_DEBUG_VIEW_ADDR                                   (0x40001020u)
#define BB_DEBUG_VIEW_RESET                                  (0x00000000u)
        /* BB_DEBUG_VIEW field */
        #define BB_DEBUG_VIEW_BB_DEBUG_VIEW                  (0x0000FFFFu)
        #define BB_DEBUG_VIEW_BB_DEBUG_VIEW_MASK             (0x0000FFFFu)
        #define BB_DEBUG_VIEW_BB_DEBUG_VIEW_BIT              (0)
        #define BB_DEBUG_VIEW_BB_DEBUG_VIEW_BITS             (16)

#define IF_FREQ                                              *((volatile uint32_t *)0x40001024u)
#define IF_FREQ_REG                                          *((volatile uint32_t *)0x40001024u)
#define IF_FREQ_ADDR                                         (0x40001024u)
#define IF_FREQ_RESET                                        (0x00000155u)
        /* TIMING_CORR_EN field */
        #define IF_FREQ_TIMING_CORR_EN                       (0x00008000u)
        #define IF_FREQ_TIMING_CORR_EN_MASK                  (0x00008000u)
        #define IF_FREQ_TIMING_CORR_EN_BIT                   (15)
        #define IF_FREQ_TIMING_CORR_EN_BITS                  (1)
        /* IF_FREQ field */
        #define IF_FREQ_IF_FREQ                              (0x000001FFu)
        #define IF_FREQ_IF_FREQ_MASK                         (0x000001FFu)
        #define IF_FREQ_IF_FREQ_BIT                          (0)
        #define IF_FREQ_IF_FREQ_BITS                         (9)

#define MOD_EN                                               *((volatile uint32_t *)0x40001028u)
#define MOD_EN_REG                                           *((volatile uint32_t *)0x40001028u)
#define MOD_EN_ADDR                                          (0x40001028u)
#define MOD_EN_RESET                                         (0x00000001u)
        /* MOD_EN field */
        #define MOD_EN_MOD_EN                                (0x00000001u)
        #define MOD_EN_MOD_EN_MASK                           (0x00000001u)
        #define MOD_EN_MOD_EN_BIT                            (0)
        #define MOD_EN_MOD_EN_BITS                           (1)

#define PRESCALE_CTRL                                        *((volatile uint32_t *)0x4000102Cu)
#define PRESCALE_CTRL_REG                                    *((volatile uint32_t *)0x4000102Cu)
#define PRESCALE_CTRL_ADDR                                   (0x4000102Cu)
#define PRESCALE_CTRL_RESET                                  (0x00000000u)
        /* PRESCALE_SET field */
        #define PRESCALE_CTRL_PRESCALE_SET                   (0x00008000u)
        #define PRESCALE_CTRL_PRESCALE_SET_MASK              (0x00008000u)
        #define PRESCALE_CTRL_PRESCALE_SET_BIT               (15)
        #define PRESCALE_CTRL_PRESCALE_SET_BITS              (1)
        /* PRESCALE_VAL field */
        #define PRESCALE_CTRL_PRESCALE_VAL                   (0x00000007u)
        #define PRESCALE_CTRL_PRESCALE_VAL_MASK              (0x00000007u)
        #define PRESCALE_CTRL_PRESCALE_VAL_BIT               (0)
        #define PRESCALE_CTRL_PRESCALE_VAL_BITS              (3)

#define ADC_BYPASS_EN                                        *((volatile uint32_t *)0x40001030u)
#define ADC_BYPASS_EN_REG                                    *((volatile uint32_t *)0x40001030u)
#define ADC_BYPASS_EN_ADDR                                   (0x40001030u)
#define ADC_BYPASS_EN_RESET                                  (0x00000000u)
        /* ADC_BYPASS_EN field */
        #define ADC_BYPASS_EN_ADC_BYPASS_EN                  (0x00000001u)
        #define ADC_BYPASS_EN_ADC_BYPASS_EN_MASK             (0x00000001u)
        #define ADC_BYPASS_EN_ADC_BYPASS_EN_BIT              (0)
        #define ADC_BYPASS_EN_ADC_BYPASS_EN_BITS             (1)

#define FIXED_CODE_EN                                        *((volatile uint32_t *)0x40001034u)
#define FIXED_CODE_EN_REG                                    *((volatile uint32_t *)0x40001034u)
#define FIXED_CODE_EN_ADDR                                   (0x40001034u)
#define FIXED_CODE_EN_RESET                                  (0x00000000u)
        /* FIXED_CODE_EN field */
        #define FIXED_CODE_EN_FIXED_CODE_EN                  (0x00000001u)
        #define FIXED_CODE_EN_FIXED_CODE_EN_MASK             (0x00000001u)
        #define FIXED_CODE_EN_FIXED_CODE_EN_BIT              (0)
        #define FIXED_CODE_EN_FIXED_CODE_EN_BITS             (1)

#define FIXED_CODE_H                                         *((volatile uint32_t *)0x40001038u)
#define FIXED_CODE_H_REG                                     *((volatile uint32_t *)0x40001038u)
#define FIXED_CODE_H_ADDR                                    (0x40001038u)
#define FIXED_CODE_H_RESET                                   (0x00000000u)
        /* FIXED_CODE_H field */
        #define FIXED_CODE_H_FIXED_CODE_H                    (0x0000FFFFu)
        #define FIXED_CODE_H_FIXED_CODE_H_MASK               (0x0000FFFFu)
        #define FIXED_CODE_H_FIXED_CODE_H_BIT                (0)
        #define FIXED_CODE_H_FIXED_CODE_H_BITS               (16)

#define FIXED_CODE_L                                         *((volatile uint32_t *)0x4000103Cu)
#define FIXED_CODE_L_REG                                     *((volatile uint32_t *)0x4000103Cu)
#define FIXED_CODE_L_ADDR                                    (0x4000103Cu)
#define FIXED_CODE_L_RESET                                   (0x00000000u)
        /* FIXED_CODE_L field */
        #define FIXED_CODE_L_FIXED_CODE_L                    (0x0000FFFFu)
        #define FIXED_CODE_L_FIXED_CODE_L_MASK               (0x0000FFFFu)
        #define FIXED_CODE_L_FIXED_CODE_L_BIT                (0)
        #define FIXED_CODE_L_FIXED_CODE_L_BITS               (16)

#define FIXED_CODE_L_SHADOW                                  *((volatile uint32_t *)0x40001040u)
#define FIXED_CODE_L_SHADOW_REG                              *((volatile uint32_t *)0x40001040u)
#define FIXED_CODE_L_SHADOW_ADDR                             (0x40001040u)
#define FIXED_CODE_L_SHADOW_RESET                            (0x00000000u)
        /* FIXED_CODE_L_SHADOW field */
        #define FIXED_CODE_L_SHADOW_FIXED_CODE_L_SHADOW      (0x0000FFFFu)
        #define FIXED_CODE_L_SHADOW_FIXED_CODE_L_SHADOW_MASK (0x0000FFFFu)
        #define FIXED_CODE_L_SHADOW_FIXED_CODE_L_SHADOW_BIT  (0)
        #define FIXED_CODE_L_SHADOW_FIXED_CODE_L_SHADOW_BITS (16)

#define RX_GAIN_CTRL                                         *((volatile uint32_t *)0x40001044u)
#define RX_GAIN_CTRL_REG                                     *((volatile uint32_t *)0x40001044u)
#define RX_GAIN_CTRL_ADDR                                    (0x40001044u)
#define RX_GAIN_CTRL_RESET                                   (0x00000000u)
        /* RX_GAIN_MUX field */
        #define RX_GAIN_CTRL_RX_GAIN_MUX                     (0x00008000u)
        #define RX_GAIN_CTRL_RX_GAIN_MUX_MASK                (0x00008000u)
        #define RX_GAIN_CTRL_RX_GAIN_MUX_BIT                 (15)
        #define RX_GAIN_CTRL_RX_GAIN_MUX_BITS                (1)
        /* RX_RF_GAIN_TEST field */
        #define RX_GAIN_CTRL_RX_RF_GAIN_TEST                 (0x00000080u)
        #define RX_GAIN_CTRL_RX_RF_GAIN_TEST_MASK            (0x00000080u)
        #define RX_GAIN_CTRL_RX_RF_GAIN_TEST_BIT             (7)
        #define RX_GAIN_CTRL_RX_RF_GAIN_TEST_BITS            (1)
        /* RX_MIXER_GAIN_TEST field */
        #define RX_GAIN_CTRL_RX_MIXER_GAIN_TEST              (0x00000040u)
        #define RX_GAIN_CTRL_RX_MIXER_GAIN_TEST_MASK         (0x00000040u)
        #define RX_GAIN_CTRL_RX_MIXER_GAIN_TEST_BIT          (6)
        #define RX_GAIN_CTRL_RX_MIXER_GAIN_TEST_BITS         (1)
        /* RX_FILTER_GAIN_TEST field */
        #define RX_GAIN_CTRL_RX_FILTER_GAIN_TEST             (0x00000030u)
        #define RX_GAIN_CTRL_RX_FILTER_GAIN_TEST_MASK        (0x00000030u)
        #define RX_GAIN_CTRL_RX_FILTER_GAIN_TEST_BIT         (4)
        #define RX_GAIN_CTRL_RX_FILTER_GAIN_TEST_BITS        (2)
        /* RX_IF_GAIN_TEST field */
        #define RX_GAIN_CTRL_RX_IF_GAIN_TEST                 (0x0000000Fu)
        #define RX_GAIN_CTRL_RX_IF_GAIN_TEST_MASK            (0x0000000Fu)
        #define RX_GAIN_CTRL_RX_IF_GAIN_TEST_BIT             (0)
        #define RX_GAIN_CTRL_RX_IF_GAIN_TEST_BITS            (4)

