contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define PD_DITHER_EN                                         *((volatile uint32_t *)0x40001048u)
#define PD_DITHER_EN_REG                                     *((volatile uint32_t *)0x40001048u)
#define PD_DITHER_EN_ADDR                                    (0x40001048u)
#define PD_DITHER_EN_RESET                                   (0x00000001u)
        /* PD_DITHER_EN field */
        #define PD_DITHER_EN_PD_DITHER_EN                    (0x00000001u)
        #define PD_DITHER_EN_PD_DITHER_EN_MASK               (0x00000001u)
        #define PD_DITHER_EN_PD_DITHER_EN_BIT                (0)
        #define PD_DITHER_EN_PD_DITHER_EN_BITS               (1)

#define RX_ERR_THRESH                                        *((volatile uint32_t *)0x4000104Cu)
#define RX_ERR_THRESH_REG                                    *((volatile uint32_t *)0x4000104Cu)
#define RX_ERR_THRESH_ADDR                                   (0x4000104Cu)
#define RX_ERR_THRESH_RESET                                  (0x00004608u)
        /* LPF_RX_ERR_COEFF field */
        #define RX_ERR_THRESH_LPF_RX_ERR_COEFF               (0x0000E000u)
        #define RX_ERR_THRESH_LPF_RX_ERR_COEFF_MASK          (0x0000E000u)
        #define RX_ERR_THRESH_LPF_RX_ERR_COEFF_BIT           (13)
        #define RX_ERR_THRESH_LPF_RX_ERR_COEFF_BITS          (3)
        /* LPF_RX_ERR_THRESH field */
        #define RX_ERR_THRESH_LPF_RX_ERR_THRESH              (0x00001F00u)
        #define RX_ERR_THRESH_LPF_RX_ERR_THRESH_MASK         (0x00001F00u)
        #define RX_ERR_THRESH_LPF_RX_ERR_THRESH_BIT          (8)
        #define RX_ERR_THRESH_LPF_RX_ERR_THRESH_BITS         (5)
        /* RX_ERR_THRESH field */
        #define RX_ERR_THRESH_RX_ERR_THRESH                  (0x0000001Fu)
        #define RX_ERR_THRESH_RX_ERR_THRESH_MASK             (0x0000001Fu)
        #define RX_ERR_THRESH_RX_ERR_THRESH_BIT              (0)
        #define RX_ERR_THRESH_RX_ERR_THRESH_BITS             (5)

#define CARRIER_THRESH                                       *((volatile uint32_t *)0x40001050u)
#define CARRIER_THRESH_REG                                   *((volatile uint32_t *)0x40001050u)
#define CARRIER_THRESH_ADDR                                  (0x40001050u)
#define CARRIER_THRESH_RESET                                 (0x00002332u)
        /* CARRIER_SPIKE_THRESH field */
        #define CARRIER_THRESH_CARRIER_SPIKE_THRESH          (0x0000FF00u)
        #define CARRIER_THRESH_CARRIER_SPIKE_THRESH_MASK     (0x0000FF00u)
        #define CARRIER_THRESH_CARRIER_SPIKE_THRESH_BIT      (8)
        #define CARRIER_THRESH_CARRIER_SPIKE_THRESH_BITS     (8)
        /* CARRIER_THRESH field */
        #define CARRIER_THRESH_CARRIER_THRESH                (0x000000FFu)
        #define CARRIER_THRESH_CARRIER_THRESH_MASK           (0x000000FFu)
        #define CARRIER_THRESH_CARRIER_THRESH_BIT            (0)
        #define CARRIER_THRESH_CARRIER_THRESH_BITS           (8)

#define RSSI_THRESH                                          *((volatile uint32_t *)0x40001054u)
#define RSSI_THRESH_REG                                      *((volatile uint32_t *)0x40001054u)
#define RSSI_THRESH_ADDR                                     (0x40001054u)
#define RSSI_THRESH_RESET                                    (0x00000100u)
        /* RSSI_THRESH field */
        #define RSSI_THRESH_RSSI_THRESH                      (0x0000FFFFu)
        #define RSSI_THRESH_RSSI_THRESH_MASK                 (0x0000FFFFu)
        #define RSSI_THRESH_RSSI_THRESH_BIT                  (0)
        #define RSSI_THRESH_RSSI_THRESH_BITS                 (16)

#define SYNTH_START                                          *((volatile uint32_t *)0x40001058u)
#define SYNTH_START_REG                                      *((volatile uint32_t *)0x40001058u)
#define SYNTH_START_ADDR                                     (0x40001058u)
#define SYNTH_START_RESET                                    (0x00006464u)
        /* SYNTH_WARM_START field */
        #define SYNTH_START_SYNTH_WARM_START                 (0x0000FF00u)
        #define SYNTH_START_SYNTH_WARM_START_MASK            (0x0000FF00u)
        #define SYNTH_START_SYNTH_WARM_START_BIT             (8)
        #define SYNTH_START_SYNTH_WARM_START_BITS            (8)
        /* SYNTH_COLD_START field */
        #define SYNTH_START_SYNTH_COLD_START                 (0x000000FFu)
        #define SYNTH_START_SYNTH_COLD_START_MASK            (0x000000FFu)
        #define SYNTH_START_SYNTH_COLD_START_BIT             (0)
        #define SYNTH_START_SYNTH_COLD_START_BITS            (8)

#define IN_LOCK_EN                                           *((volatile uint32_t *)0x4000105Cu)
#define IN_LOCK_EN_REG                                       *((volatile uint32_t *)0x4000105Cu)
#define IN_LOCK_EN_ADDR                                      (0x4000105Cu)
#define IN_LOCK_EN_RESET                                     (0x00000001u)
        /* IN_LOCK_EN field */
        #define IN_LOCK_EN_IN_LOCK_EN                        (0x00000001u)
        #define IN_LOCK_EN_IN_LOCK_EN_MASK                   (0x00000001u)
        #define IN_LOCK_EN_IN_LOCK_EN_BIT                    (0)
        #define IN_LOCK_EN_IN_LOCK_EN_BITS                   (1)

#define DITHER_AMPLITUDE                                     *((volatile uint32_t *)0x40001060u)
#define DITHER_AMPLITUDE_REG                                 *((volatile uint32_t *)0x40001060u)
#define DITHER_AMPLITUDE_ADDR                                (0x40001060u)
#define DITHER_AMPLITUDE_RESET                               (0x0000003Fu)
        /* DITHER_AMP field */
        #define DITHER_AMPLITUDE_DITHER_AMP                  (0x0000003Fu)
        #define DITHER_AMPLITUDE_DITHER_AMP_MASK             (0x0000003Fu)
        #define DITHER_AMPLITUDE_DITHER_AMP_BIT              (0)
        #define DITHER_AMPLITUDE_DITHER_AMP_BITS             (6)

#define TX_STEP_TIME                                         *((volatile uint32_t *)0x40001064u)
#define TX_STEP_TIME_REG                                     *((volatile uint32_t *)0x40001064u)
#define TX_STEP_TIME_ADDR                                    (0x40001064u)
#define TX_STEP_TIME_RESET                                   (0x00000000u)
        /* TX_STEP_TIME field */
        #define TX_STEP_TIME_TX_STEP_TIME                    (0x000000FFu)
        #define TX_STEP_TIME_TX_STEP_TIME_MASK               (0x000000FFu)
        #define TX_STEP_TIME_TX_STEP_TIME_BIT                (0)
        #define TX_STEP_TIME_TX_STEP_TIME_BITS               (8)

#define GAIN_THRESH_MAX                                      *((volatile uint32_t *)0x40001068u)
#define GAIN_THRESH_MAX_REG                                  *((volatile uint32_t *)0x40001068u)
#define GAIN_THRESH_MAX_ADDR                                 (0x40001068u)
#define GAIN_THRESH_MAX_RESET                                (0x00000060u)
        /* GAIN_THRESH_MAX field */
        #define GAIN_THRESH_MAX_GAIN_THRESH_MAX              (0x000000FFu)
        #define GAIN_THRESH_MAX_GAIN_THRESH_MAX_MASK         (0x000000FFu)
        #define GAIN_THRESH_MAX_GAIN_THRESH_MAX_BIT          (0)
        #define GAIN_THRESH_MAX_GAIN_THRESH_MAX_BITS         (8)

