contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define GAIN_SETTING_11                                      *((volatile uint32_t *)0x400010A0u)
#define GAIN_SETTING_11_REG                                  *((volatile uint32_t *)0x400010A0u)
#define GAIN_SETTING_11_ADDR                                 (0x400010A0u)
#define GAIN_SETTING_11_RESET                                (0x00000078u)
        /* RX_MIXER_GAIN_11 field */
        #define GAIN_SETTING_11_RX_MIXER_GAIN_11             (0x00000040u)
        #define GAIN_SETTING_11_RX_MIXER_GAIN_11_MASK        (0x00000040u)
        #define GAIN_SETTING_11_RX_MIXER_GAIN_11_BIT         (6)
        #define GAIN_SETTING_11_RX_MIXER_GAIN_11_BITS        (1)
        /* RX_FILTER_GAIN_11 field */
        #define GAIN_SETTING_11_RX_FILTER_GAIN_11            (0x00000030u)
        #define GAIN_SETTING_11_RX_FILTER_GAIN_11_MASK       (0x00000030u)
        #define GAIN_SETTING_11_RX_FILTER_GAIN_11_BIT        (4)
        #define GAIN_SETTING_11_RX_FILTER_GAIN_11_BITS       (2)
        /* RX_IF_GAIN_11 field */
        #define GAIN_SETTING_11_RX_IF_GAIN_11                (0x0000000Fu)
        #define GAIN_SETTING_11_RX_IF_GAIN_11_MASK           (0x0000000Fu)
        #define GAIN_SETTING_11_RX_IF_GAIN_11_BIT            (0)
        #define GAIN_SETTING_11_RX_IF_GAIN_11_BITS           (4)

#define GAIN_CTRL_MIN_RF                                     *((volatile uint32_t *)0x400010A4u)
#define GAIN_CTRL_MIN_RF_REG                                 *((volatile uint32_t *)0x400010A4u)
#define GAIN_CTRL_MIN_RF_ADDR                                (0x400010A4u)
#define GAIN_CTRL_MIN_RF_RESET                               (0x000000F0u)
        /* GAIN_CTRL_MIN_RF field */
        #define GAIN_CTRL_MIN_RF_GAIN_CTRL_MIN_RF            (0x000001FFu)
        #define GAIN_CTRL_MIN_RF_GAIN_CTRL_MIN_RF_MASK       (0x000001FFu)
        #define GAIN_CTRL_MIN_RF_GAIN_CTRL_MIN_RF_BIT        (0)
        #define GAIN_CTRL_MIN_RF_GAIN_CTRL_MIN_RF_BITS       (9)

#define GAIN_CTRL_MAX_RF                                     *((volatile uint32_t *)0x400010A8u)
#define GAIN_CTRL_MAX_RF_REG                                 *((volatile uint32_t *)0x400010A8u)
#define GAIN_CTRL_MAX_RF_ADDR                                (0x400010A8u)
#define GAIN_CTRL_MAX_RF_RESET                               (0x000000FCu)
        /* GAIN_CTRL_MAX_RF field */
        #define GAIN_CTRL_MAX_RF_GAIN_CTRL_MAX_RF            (0x000001FFu)
        #define GAIN_CTRL_MAX_RF_GAIN_CTRL_MAX_RF_MASK       (0x000001FFu)
        #define GAIN_CTRL_MAX_RF_GAIN_CTRL_MAX_RF_BIT        (0)
        #define GAIN_CTRL_MAX_RF_GAIN_CTRL_MAX_RF_BITS       (9)

#define MIXER_GAIN_STEP                                      *((volatile uint32_t *)0x400010ACu)
#define MIXER_GAIN_STEP_REG                                  *((volatile uint32_t *)0x400010ACu)
#define MIXER_GAIN_STEP_ADDR                                 (0x400010ACu)
#define MIXER_GAIN_STEP_RESET                                (0x0000000Cu)
        /* MIXER_GAIN_STEP field */
        #define MIXER_GAIN_STEP_MIXER_GAIN_STEP              (0x0000000Fu)
        #define MIXER_GAIN_STEP_MIXER_GAIN_STEP_MASK         (0x0000000Fu)
        #define MIXER_GAIN_STEP_MIXER_GAIN_STEP_BIT          (0)
        #define MIXER_GAIN_STEP_MIXER_GAIN_STEP_BITS         (4)

#define PREAMBLE_EVENT                                       *((volatile uint32_t *)0x400010B0u)
#define PREAMBLE_EVENT_REG                                   *((volatile uint32_t *)0x400010B0u)
#define PREAMBLE_EVENT_ADDR                                  (0x400010B0u)
#define PREAMBLE_EVENT_RESET                                 (0x00005877u)
        /* PREAMBLE_CONFIRM_THRESH field */
        #define PREAMBLE_EVENT_PREAMBLE_CONFIRM_THRESH       (0x0000FF00u)
        #define PREAMBLE_EVENT_PREAMBLE_CONFIRM_THRESH_MASK  (0x0000FF00u)
        #define PREAMBLE_EVENT_PREAMBLE_CONFIRM_THRESH_BIT   (8)
        #define PREAMBLE_EVENT_PREAMBLE_CONFIRM_THRESH_BITS  (8)
        /* PREAMBLE_EVENT_THRESH field */
        #define PREAMBLE_EVENT_PREAMBLE_EVENT_THRESH         (0x000000FFu)
        #define PREAMBLE_EVENT_PREAMBLE_EVENT_THRESH_MASK    (0x000000FFu)
        #define PREAMBLE_EVENT_PREAMBLE_EVENT_THRESH_BIT     (0)
        #define PREAMBLE_EVENT_PREAMBLE_EVENT_THRESH_BITS    (8)

#define PREAMBLE_ABORT_THRESH                                *((volatile uint32_t *)0x400010B4u)
#define PREAMBLE_ABORT_THRESH_REG                            *((volatile uint32_t *)0x400010B4u)
#define PREAMBLE_ABORT_THRESH_ADDR                           (0x400010B4u)
#define PREAMBLE_ABORT_THRESH_RESET                          (0x00000071u)
        /* PREAMBLE_ABORT_THRESH field */
        #define PREAMBLE_ABORT_THRESH_PREAMBLE_ABORT_THRESH  (0x000000FFu)
        #define PREAMBLE_ABORT_THRESH_PREAMBLE_ABORT_THRESH_MASK (0x000000FFu)
        #define PREAMBLE_ABORT_THRESH_PREAMBLE_ABORT_THRESH_BIT (0)
        #define PREAMBLE_ABORT_THRESH_PREAMBLE_ABORT_THRESH_BITS (8)

#define PREAMBLE_ACCEPT_WINDOW                               *((volatile uint32_t *)0x400010B8u)
#define PREAMBLE_ACCEPT_WINDOW_REG                           *((volatile uint32_t *)0x400010B8u)
#define PREAMBLE_ACCEPT_WINDOW_ADDR                          (0x400010B8u)
#define PREAMBLE_ACCEPT_WINDOW_RESET                         (0x00000003u)
        /* PREAMBLE_ACCEPT_WINDOW field */
        #define PREAMBLE_ACCEPT_WINDOW_PREAMBLE_ACCEPT_WINDOW (0x0000007Fu)
        #define PREAMBLE_ACCEPT_WINDOW_PREAMBLE_ACCEPT_WINDOW_MASK (0x0000007Fu)
        #define PREAMBLE_ACCEPT_WINDOW_PREAMBLE_ACCEPT_WINDOW_BIT (0)
        #define PREAMBLE_ACCEPT_WINDOW_PREAMBLE_ACCEPT_WINDOW_BITS (7)

#define CCA_MODE                                             *((volatile uint32_t *)0x400010BCu)
#define CCA_MODE_REG                                         *((volatile uint32_t *)0x400010BCu)
#define CCA_MODE_ADDR                                        (0x400010BCu)
#define CCA_MODE_RESET                                       (0x00000000u)
        /* CCA_MODE field */
        #define CCA_MODE_CCA_MODE                            (0x00000003u)
        #define CCA_MODE_CCA_MODE_MASK                       (0x00000003u)
        #define CCA_MODE_CCA_MODE_BIT                        (0)
        #define CCA_MODE_CCA_MODE_BITS                       (2)

#define TX_POWER_MAX                                         *((volatile uint32_t *)0x400010C0u)
#define TX_POWER_MAX_REG                                     *((volatile uint32_t *)0x400010C0u)
#define TX_POWER_MAX_ADDR                                    (0x400010C0u)
#define TX_POWER_MAX_RESET                                   (0x00000000u)
        /* MANUAL_POWER field */
        #define TX_POWER_MAX_MANUAL_POWER                    (0x00008000u)
        #define TX_POWER_MAX_MANUAL_POWER_MASK               (0x00008000u)
        #define TX_POWER_MAX_MANUAL_POWER_BIT                (15)
        #define TX_POWER_MAX_MANUAL_POWER_BITS               (1)
        /* TX_POWER_MAX field */
        #define TX_POWER_MAX_TX_POWER_MAX                    (0x0000001Fu)
        #define TX_POWER_MAX_TX_POWER_MAX_MASK               (0x0000001Fu)
        #define TX_POWER_MAX_TX_POWER_MAX_BIT                (0)
        #define TX_POWER_MAX_TX_POWER_MAX_BITS               (5)

#define SYNTH_FREQ_H                                         *((volatile uint32_t *)0x400010C4u)
#define SYNTH_FREQ_H_REG                                     *((volatile uint32_t *)0x400010C4u)
#define SYNTH_FREQ_H_ADDR                                    (0x400010C4u)
#define SYNTH_FREQ_H_RESET                                   (0x00000003u)
        /* SYNTH_FREQ_H field */
        #define SYNTH_FREQ_H_SYNTH_FREQ_H                    (0x00000003u)
        #define SYNTH_FREQ_H_SYNTH_FREQ_H_MASK               (0x00000003u)
        #define SYNTH_FREQ_H_SYNTH_FREQ_H_BIT                (0)
        #define SYNTH_FREQ_H_SYNTH_FREQ_H_BITS               (2)

#define SYNTH_FREQ_L                                         *((volatile uint32_t *)0x400010C8u)
#define SYNTH_FREQ_L_REG                                     *((volatile uint32_t *)0x400010C8u)
#define SYNTH_FREQ_L_ADDR                                    (0x400010C8u)
#define SYNTH_FREQ_L_RESET                                   (0x00003800u)
        /* SYNTH_FREQ_L field */
        #define SYNTH_FREQ_L_SYNTH_FREQ_L                    (0x0000FFFFu)
        #define SYNTH_FREQ_L_SYNTH_FREQ_L_MASK               (0x0000FFFFu)
        #define SYNTH_FREQ_L_SYNTH_FREQ_L_BIT                (0)
        #define SYNTH_FREQ_L_SYNTH_FREQ_L_BITS               (16)

#define RSSI_INST                                            *((volatile uint32_t *)0x400010CCu)
#define RSSI_INST_REG                                        *((volatile uint32_t *)0x400010CCu)
#define RSSI_INST_ADDR                                       (0x400010CCu)
#define RSSI_INST_RESET                                      (0x00000000u)
        /* NEW_RSSI_INST field */
        #define RSSI_INST_NEW_RSSI_INST                      (0x00000200u)
        #define RSSI_INST_NEW_RSSI_INST_MASK                 (0x00000200u)
        #define RSSI_INST_NEW_RSSI_INST_BIT                  (9)
        #define RSSI_INST_NEW_RSSI_INST_BITS                 (1)
        /* RSSI_INST field */
        #define RSSI_INST_RSSI_INST                          (0x000001FFu)
        #define RSSI_INST_RSSI_INST_MASK                     (0x000001FFu)
        #define RSSI_INST_RSSI_INST_BIT                      (0)
        #define RSSI_INST_RSSI_INST_BITS                     (9)

