contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define FREQ_MEAS_CTRL1                                      *((volatile uint32_t *)0x400010D0u)
#define FREQ_MEAS_CTRL1_REG                                  *((volatile uint32_t *)0x400010D0u)
#define FREQ_MEAS_CTRL1_ADDR                                 (0x400010D0u)
#define FREQ_MEAS_CTRL1_RESET                                (0x00000160u)
        /* AUTO_TUNE_EN field */
        #define FREQ_MEAS_CTRL1_AUTO_TUNE_EN                 (0x00008000u)
        #define FREQ_MEAS_CTRL1_AUTO_TUNE_EN_MASK            (0x00008000u)
        #define FREQ_MEAS_CTRL1_AUTO_TUNE_EN_BIT             (15)
        #define FREQ_MEAS_CTRL1_AUTO_TUNE_EN_BITS            (1)
        /* FREQ_MEAS_EN field */
        #define FREQ_MEAS_CTRL1_FREQ_MEAS_EN                 (0x00004000u)
        #define FREQ_MEAS_CTRL1_FREQ_MEAS_EN_MASK            (0x00004000u)
        #define FREQ_MEAS_CTRL1_FREQ_MEAS_EN_BIT             (14)
        #define FREQ_MEAS_CTRL1_FREQ_MEAS_EN_BITS            (1)
        /* OPEN_LOOP_MANUAL field */
        #define FREQ_MEAS_CTRL1_OPEN_LOOP_MANUAL             (0x00002000u)
        #define FREQ_MEAS_CTRL1_OPEN_LOOP_MANUAL_MASK        (0x00002000u)
        #define FREQ_MEAS_CTRL1_OPEN_LOOP_MANUAL_BIT         (13)
        #define FREQ_MEAS_CTRL1_OPEN_LOOP_MANUAL_BITS        (1)
        /* OPEN_LOOP field */
        #define FREQ_MEAS_CTRL1_OPEN_LOOP                    (0x00001000u)
        #define FREQ_MEAS_CTRL1_OPEN_LOOP_MASK               (0x00001000u)
        #define FREQ_MEAS_CTRL1_OPEN_LOOP_BIT                (12)
        #define FREQ_MEAS_CTRL1_OPEN_LOOP_BITS               (1)
        /* DELAY_FIRST_MEAS field */
        #define FREQ_MEAS_CTRL1_DELAY_FIRST_MEAS             (0x00000400u)
        #define FREQ_MEAS_CTRL1_DELAY_FIRST_MEAS_MASK        (0x00000400u)
        #define FREQ_MEAS_CTRL1_DELAY_FIRST_MEAS_BIT         (10)
        #define FREQ_MEAS_CTRL1_DELAY_FIRST_MEAS_BITS        (1)
        /* DELAY_ALL_MEAS field */
        #define FREQ_MEAS_CTRL1_DELAY_ALL_MEAS               (0x00000200u)
        #define FREQ_MEAS_CTRL1_DELAY_ALL_MEAS_MASK          (0x00000200u)
        #define FREQ_MEAS_CTRL1_DELAY_ALL_MEAS_BIT           (9)
        #define FREQ_MEAS_CTRL1_DELAY_ALL_MEAS_BITS          (1)
        /* BIN_SEARCH_MSB field */
        #define FREQ_MEAS_CTRL1_BIN_SEARCH_MSB               (0x000001C0u)
        #define FREQ_MEAS_CTRL1_BIN_SEARCH_MSB_MASK          (0x000001C0u)
        #define FREQ_MEAS_CTRL1_BIN_SEARCH_MSB_BIT           (6)
        #define FREQ_MEAS_CTRL1_BIN_SEARCH_MSB_BITS          (3)
        /* TUNE_VCO_INIT field */
        #define FREQ_MEAS_CTRL1_TUNE_VCO_INIT                (0x0000003Fu)
        #define FREQ_MEAS_CTRL1_TUNE_VCO_INIT_MASK           (0x0000003Fu)
        #define FREQ_MEAS_CTRL1_TUNE_VCO_INIT_BIT            (0)
        #define FREQ_MEAS_CTRL1_TUNE_VCO_INIT_BITS           (6)

#define FREQ_MEAS_CTRL2                                      *((volatile uint32_t *)0x400010D4u)
#define FREQ_MEAS_CTRL2_REG                                  *((volatile uint32_t *)0x400010D4u)
#define FREQ_MEAS_CTRL2_ADDR                                 (0x400010D4u)
#define FREQ_MEAS_CTRL2_RESET                                (0x0000201Eu)
        /* FREQ_MEAS_TIMER field */
        #define FREQ_MEAS_CTRL2_FREQ_MEAS_TIMER              (0x0000FF00u)
        #define FREQ_MEAS_CTRL2_FREQ_MEAS_TIMER_MASK         (0x0000FF00u)
        #define FREQ_MEAS_CTRL2_FREQ_MEAS_TIMER_BIT          (8)
        #define FREQ_MEAS_CTRL2_FREQ_MEAS_TIMER_BITS         (8)
        /* TARGET_PERIOD field */
        #define FREQ_MEAS_CTRL2_TARGET_PERIOD                (0x000000FFu)
        #define FREQ_MEAS_CTRL2_TARGET_PERIOD_MASK           (0x000000FFu)
        #define FREQ_MEAS_CTRL2_TARGET_PERIOD_BIT            (0)
        #define FREQ_MEAS_CTRL2_TARGET_PERIOD_BITS           (8)

#define FREQ_MEAS_SHIFT                                      *((volatile uint32_t *)0x400010D8u)
#define FREQ_MEAS_SHIFT_REG                                  *((volatile uint32_t *)0x400010D8u)
#define FREQ_MEAS_SHIFT_ADDR                                 (0x400010D8u)
#define FREQ_MEAS_SHIFT_RESET                                (0x00000035u)
        /* FREQ_MEAS_SHIFT field */
        #define FREQ_MEAS_SHIFT_FREQ_MEAS_SHIFT              (0x000000FFu)
        #define FREQ_MEAS_SHIFT_FREQ_MEAS_SHIFT_MASK         (0x000000FFu)
        #define FREQ_MEAS_SHIFT_FREQ_MEAS_SHIFT_BIT          (0)
        #define FREQ_MEAS_SHIFT_FREQ_MEAS_SHIFT_BITS         (8)

#define FREQ_MEAS_STATUS1                                    *((volatile uint32_t *)0x400010DCu)
#define FREQ_MEAS_STATUS1_REG                                *((volatile uint32_t *)0x400010DCu)
#define FREQ_MEAS_STATUS1_ADDR                               (0x400010DCu)
#define FREQ_MEAS_STATUS1_RESET                              (0x00000000u)
        /* INVALID_EDGE field */
        #define FREQ_MEAS_STATUS1_INVALID_EDGE               (0x00008000u)
        #define FREQ_MEAS_STATUS1_INVALID_EDGE_MASK          (0x00008000u)
        #define FREQ_MEAS_STATUS1_INVALID_EDGE_BIT           (15)
        #define FREQ_MEAS_STATUS1_INVALID_EDGE_BITS          (1)
        /* SIGN_FOUND field */
        #define FREQ_MEAS_STATUS1_SIGN_FOUND                 (0x00004000u)
        #define FREQ_MEAS_STATUS1_SIGN_FOUND_MASK            (0x00004000u)
        #define FREQ_MEAS_STATUS1_SIGN_FOUND_BIT             (14)
        #define FREQ_MEAS_STATUS1_SIGN_FOUND_BITS            (1)
        /* FREQ_SIGN field */
        #define FREQ_MEAS_STATUS1_FREQ_SIGN                  (0x00002000u)
        #define FREQ_MEAS_STATUS1_FREQ_SIGN_MASK             (0x00002000u)
        #define FREQ_MEAS_STATUS1_FREQ_SIGN_BIT              (13)
        #define FREQ_MEAS_STATUS1_FREQ_SIGN_BITS             (1)
        /* PERIOD_FOUND field */
        #define FREQ_MEAS_STATUS1_PERIOD_FOUND               (0x00001000u)
        #define FREQ_MEAS_STATUS1_PERIOD_FOUND_MASK          (0x00001000u)
        #define FREQ_MEAS_STATUS1_PERIOD_FOUND_BIT           (12)
        #define FREQ_MEAS_STATUS1_PERIOD_FOUND_BITS          (1)
        /* NEAREST_DIFF field */
        #define FREQ_MEAS_STATUS1_NEAREST_DIFF               (0x000003FFu)
        #define FREQ_MEAS_STATUS1_NEAREST_DIFF_MASK          (0x000003FFu)
        #define FREQ_MEAS_STATUS1_NEAREST_DIFF_BIT           (0)
        #define FREQ_MEAS_STATUS1_NEAREST_DIFF_BITS          (10)

#define FREQ_MEAS_STATUS2                                    *((volatile uint32_t *)0x400010E0u)
#define FREQ_MEAS_STATUS2_REG                                *((volatile uint32_t *)0x400010E0u)
#define FREQ_MEAS_STATUS2_ADDR                               (0x400010E0u)
#define FREQ_MEAS_STATUS2_RESET                              (0x00000000u)
        /* BEAT_TIMER field */
        #define FREQ_MEAS_STATUS2_BEAT_TIMER                 (0x0000FFC0u)
        #define FREQ_MEAS_STATUS2_BEAT_TIMER_MASK            (0x0000FFC0u)
        #define FREQ_MEAS_STATUS2_BEAT_TIMER_BIT             (6)
        #define FREQ_MEAS_STATUS2_BEAT_TIMER_BITS            (10)
        /* BEATS field */
        #define FREQ_MEAS_STATUS2_BEATS                      (0x0000003Fu)
        #define FREQ_MEAS_STATUS2_BEATS_MASK                 (0x0000003Fu)
        #define FREQ_MEAS_STATUS2_BEATS_BIT                  (0)
        #define FREQ_MEAS_STATUS2_BEATS_BITS                 (6)

#define FREQ_MEAS_STATUS3                                    *((volatile uint32_t *)0x400010E4u)
#define FREQ_MEAS_STATUS3_REG                                *((volatile uint32_t *)0x400010E4u)
#define FREQ_MEAS_STATUS3_ADDR                               (0x400010E4u)
#define FREQ_MEAS_STATUS3_RESET                              (0x00000020u)
        /* TUNE_VCO field */
        #define FREQ_MEAS_STATUS3_TUNE_VCO                   (0x0000003Fu)
        #define FREQ_MEAS_STATUS3_TUNE_VCO_MASK              (0x0000003Fu)
        #define FREQ_MEAS_STATUS3_TUNE_VCO_BIT               (0)
        #define FREQ_MEAS_STATUS3_TUNE_VCO_BITS              (6)

#define SCR_CTRL                                             *((volatile uint32_t *)0x400010E8u)
#define SCR_CTRL_REG                                         *((volatile uint32_t *)0x400010E8u)
#define SCR_CTRL_ADDR                                        (0x400010E8u)
#define SCR_CTRL_RESET                                       (0x00000004u)
        /* SCR_RESET field */
        #define SCR_CTRL_SCR_RESET                           (0x00000004u)
        #define SCR_CTRL_SCR_RESET_MASK                      (0x00000004u)
        #define SCR_CTRL_SCR_RESET_BIT                       (2)
        #define SCR_CTRL_SCR_RESET_BITS                      (1)
        /* SCR_WRITE field */
        #define SCR_CTRL_SCR_WRITE                           (0x00000002u)
        #define SCR_CTRL_SCR_WRITE_MASK                      (0x00000002u)
        #define SCR_CTRL_SCR_WRITE_BIT                       (1)
        #define SCR_CTRL_SCR_WRITE_BITS                      (1)
        /* SCR_READ field */
        #define SCR_CTRL_SCR_READ                            (0x00000001u)
        #define SCR_CTRL_SCR_READ_MASK                       (0x00000001u)
        #define SCR_CTRL_SCR_READ_BIT                        (0)
        #define SCR_CTRL_SCR_READ_BITS                       (1)

