contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define MAC_TX_ST_ADDR_B                                     *((volatile uint32_t *)0x40002018u)
#define MAC_TX_ST_ADDR_B_REG                                 *((volatile uint32_t *)0x40002018u)
#define MAC_TX_ST_ADDR_B_ADDR                                (0x40002018u)
#define MAC_TX_ST_ADDR_B_RESET                               (0x20000000u)
        /* MAC_RAM_OFFS field */
        #define MAC_TX_ST_ADDR_B_MAC_RAM_OFFS                (0xFFFFE000u)
        #define MAC_TX_ST_ADDR_B_MAC_RAM_OFFS_MASK           (0xFFFFE000u)
        #define MAC_TX_ST_ADDR_B_MAC_RAM_OFFS_BIT            (13)
        #define MAC_TX_ST_ADDR_B_MAC_RAM_OFFS_BITS           (19)
        /* MAC_TX_ST_ADDR_B field */
        #define MAC_TX_ST_ADDR_B_MAC_TX_ST_ADDR_B            (0x00001FFEu)
        #define MAC_TX_ST_ADDR_B_MAC_TX_ST_ADDR_B_MASK       (0x00001FFEu)
        #define MAC_TX_ST_ADDR_B_MAC_TX_ST_ADDR_B_BIT        (1)
        #define MAC_TX_ST_ADDR_B_MAC_TX_ST_ADDR_B_BITS       (12)

#define MAC_TX_END_ADDR_B                                    *((volatile uint32_t *)0x4000201Cu)
#define MAC_TX_END_ADDR_B_REG                                *((volatile uint32_t *)0x4000201Cu)
#define MAC_TX_END_ADDR_B_ADDR                               (0x4000201Cu)
#define MAC_TX_END_ADDR_B_RESET                              (0x20000000u)
        /* MAC_RAM_OFFS field */
        #define MAC_TX_END_ADDR_B_MAC_RAM_OFFS               (0xFFFFE000u)
        #define MAC_TX_END_ADDR_B_MAC_RAM_OFFS_MASK          (0xFFFFE000u)
        #define MAC_TX_END_ADDR_B_MAC_RAM_OFFS_BIT           (13)
        #define MAC_TX_END_ADDR_B_MAC_RAM_OFFS_BITS          (19)
        /* MAC_TX_END_ADDR_B field */
        #define MAC_TX_END_ADDR_B_MAC_TX_END_ADDR_B          (0x00001FFEu)
        #define MAC_TX_END_ADDR_B_MAC_TX_END_ADDR_B_MASK     (0x00001FFEu)
        #define MAC_TX_END_ADDR_B_MAC_TX_END_ADDR_B_BIT      (1)
        #define MAC_TX_END_ADDR_B_MAC_TX_END_ADDR_B_BITS     (12)

#define RX_A_COUNT                                           *((volatile uint32_t *)0x40002020u)
#define RX_A_COUNT_REG                                       *((volatile uint32_t *)0x40002020u)
#define RX_A_COUNT_ADDR                                      (0x40002020u)
#define RX_A_COUNT_RESET                                     (0x00000000u)
        /* RX_A_COUNT field */
        #define RX_A_COUNT_RX_A_COUNT                        (0x000007FFu)
        #define RX_A_COUNT_RX_A_COUNT_MASK                   (0x000007FFu)
        #define RX_A_COUNT_RX_A_COUNT_BIT                    (0)
        #define RX_A_COUNT_RX_A_COUNT_BITS                   (11)

#define RX_B_COUNT                                           *((volatile uint32_t *)0x40002024u)
#define RX_B_COUNT_REG                                       *((volatile uint32_t *)0x40002024u)
#define RX_B_COUNT_ADDR                                      (0x40002024u)
#define RX_B_COUNT_RESET                                     (0x00000000u)
        /* RX_B_COUNT field */
        #define RX_B_COUNT_RX_B_COUNT                        (0x000007FFu)
        #define RX_B_COUNT_RX_B_COUNT_MASK                   (0x000007FFu)
        #define RX_B_COUNT_RX_B_COUNT_BIT                    (0)
        #define RX_B_COUNT_RX_B_COUNT_BITS                   (11)

#define TX_COUNT                                             *((volatile uint32_t *)0x40002028u)
#define TX_COUNT_REG                                         *((volatile uint32_t *)0x40002028u)
#define TX_COUNT_ADDR                                        (0x40002028u)
#define TX_COUNT_RESET                                       (0x00000000u)
        /* TX_COUNT field */
        #define TX_COUNT_TX_COUNT                            (0x000007FFu)
        #define TX_COUNT_TX_COUNT_MASK                       (0x000007FFu)
        #define TX_COUNT_TX_COUNT_BIT                        (0)
        #define TX_COUNT_TX_COUNT_BITS                       (11)

#define MAC_DMA_STATUS                                       *((volatile uint32_t *)0x4000202Cu)
#define MAC_DMA_STATUS_REG                                   *((volatile uint32_t *)0x4000202Cu)
#define MAC_DMA_STATUS_ADDR                                  (0x4000202Cu)
#define MAC_DMA_STATUS_RESET                                 (0x00000000u)
        /* TX_ACTIVE_B field */
        #define MAC_DMA_STATUS_TX_ACTIVE_B                   (0x00000008u)
        #define MAC_DMA_STATUS_TX_ACTIVE_B_MASK              (0x00000008u)
        #define MAC_DMA_STATUS_TX_ACTIVE_B_BIT               (3)
        #define MAC_DMA_STATUS_TX_ACTIVE_B_BITS              (1)
        /* TX_ACTIVE_A field */
        #define MAC_DMA_STATUS_TX_ACTIVE_A                   (0x00000004u)
        #define MAC_DMA_STATUS_TX_ACTIVE_A_MASK              (0x00000004u)
        #define MAC_DMA_STATUS_TX_ACTIVE_A_BIT               (2)
        #define MAC_DMA_STATUS_TX_ACTIVE_A_BITS              (1)
        /* RX_ACTIVE_B field */
        #define MAC_DMA_STATUS_RX_ACTIVE_B                   (0x00000002u)
        #define MAC_DMA_STATUS_RX_ACTIVE_B_MASK              (0x00000002u)
        #define MAC_DMA_STATUS_RX_ACTIVE_B_BIT               (1)
        #define MAC_DMA_STATUS_RX_ACTIVE_B_BITS              (1)
        /* RX_ACTIVE_A field */
        #define MAC_DMA_STATUS_RX_ACTIVE_A                   (0x00000001u)
        #define MAC_DMA_STATUS_RX_ACTIVE_A_MASK              (0x00000001u)
        #define MAC_DMA_STATUS_RX_ACTIVE_A_BIT               (0)
        #define MAC_DMA_STATUS_RX_ACTIVE_A_BITS              (1)

#define MAC_DMA_CONFIG                                       *((volatile uint32_t *)0x40002030u)
#define MAC_DMA_CONFIG_REG                                   *((volatile uint32_t *)0x40002030u)
#define MAC_DMA_CONFIG_ADDR                                  (0x40002030u)
#define MAC_DMA_CONFIG_RESET                                 (0x00000000u)
        /* TX_DMA_RESET field */
        #define MAC_DMA_CONFIG_TX_DMA_RESET                  (0x00000020u)
        #define MAC_DMA_CONFIG_TX_DMA_RESET_MASK             (0x00000020u)
        #define MAC_DMA_CONFIG_TX_DMA_RESET_BIT              (5)
        #define MAC_DMA_CONFIG_TX_DMA_RESET_BITS             (1)
        /* RX_DMA_RESET field */
        #define MAC_DMA_CONFIG_RX_DMA_RESET                  (0x00000010u)
        #define MAC_DMA_CONFIG_RX_DMA_RESET_MASK             (0x00000010u)
        #define MAC_DMA_CONFIG_RX_DMA_RESET_BIT              (4)
        #define MAC_DMA_CONFIG_RX_DMA_RESET_BITS             (1)
        /* TX_LOAD_B field */
        #define MAC_DMA_CONFIG_TX_LOAD_B                     (0x00000008u)
        #define MAC_DMA_CONFIG_TX_LOAD_B_MASK                (0x00000008u)
        #define MAC_DMA_CONFIG_TX_LOAD_B_BIT                 (3)
        #define MAC_DMA_CONFIG_TX_LOAD_B_BITS                (1)
        /* TX_LOAD_A field */
        #define MAC_DMA_CONFIG_TX_LOAD_A                     (0x00000004u)
        #define MAC_DMA_CONFIG_TX_LOAD_A_MASK                (0x00000004u)
        #define MAC_DMA_CONFIG_TX_LOAD_A_BIT                 (2)
        #define MAC_DMA_CONFIG_TX_LOAD_A_BITS                (1)
        /* RX_LOAD_B field */
        #define MAC_DMA_CONFIG_RX_LOAD_B                     (0x00000002u)
        #define MAC_DMA_CONFIG_RX_LOAD_B_MASK                (0x00000002u)
        #define MAC_DMA_CONFIG_RX_LOAD_B_BIT                 (1)
        #define MAC_DMA_CONFIG_RX_LOAD_B_BITS                (1)
        /* RX_LOAD_A field */
        #define MAC_DMA_CONFIG_RX_LOAD_A                     (0x00000001u)
        #define MAC_DMA_CONFIG_RX_LOAD_A_MASK                (0x00000001u)
        #define MAC_DMA_CONFIG_RX_LOAD_A_BIT                 (0)
        #define MAC_DMA_CONFIG_RX_LOAD_A_BITS                (1)

#define MAC_TIMER                                            *((volatile uint32_t *)0x40002038u)
#define MAC_TIMER_REG                                        *((volatile uint32_t *)0x40002038u)
#define MAC_TIMER_ADDR                                       (0x40002038u)
#define MAC_TIMER_RESET                                      (0x00000000u)
        /* MAC_TIMER field */
        #define MAC_TIMER_MAC_TIMER                          (0x000FFFFFu)
        #define MAC_TIMER_MAC_TIMER_MASK                     (0x000FFFFFu)
        #define MAC_TIMER_MAC_TIMER_BIT                      (0)
        #define MAC_TIMER_MAC_TIMER_BITS                     (20)

#define MAC_TIMER_COMPARE_A_H                                *((volatile uint32_t *)0x40002040u)
#define MAC_TIMER_COMPARE_A_H_REG                            *((volatile uint32_t *)0x40002040u)
#define MAC_TIMER_COMPARE_A_H_ADDR                           (0x40002040u)
#define MAC_TIMER_COMPARE_A_H_RESET                          (0x00000000u)
        /* MAC_COMPARE_A_H field */
        #define MAC_TIMER_COMPARE_A_H_MAC_COMPARE_A_H        (0x0000000Fu)
        #define MAC_TIMER_COMPARE_A_H_MAC_COMPARE_A_H_MASK   (0x0000000Fu)
        #define MAC_TIMER_COMPARE_A_H_MAC_COMPARE_A_H_BIT    (0)
        #define MAC_TIMER_COMPARE_A_H_MAC_COMPARE_A_H_BITS   (4)

