contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define MAC_TIMER_COMPARE_A_L                                *((volatile uint32_t *)0x40002044u)
#define MAC_TIMER_COMPARE_A_L_REG                            *((volatile uint32_t *)0x40002044u)
#define MAC_TIMER_COMPARE_A_L_ADDR                           (0x40002044u)
#define MAC_TIMER_COMPARE_A_L_RESET                          (0x00000000u)
        /* MAC_COMPARE_A_L field */
        #define MAC_TIMER_COMPARE_A_L_MAC_COMPARE_A_L        (0x0000FFFFu)
        #define MAC_TIMER_COMPARE_A_L_MAC_COMPARE_A_L_MASK   (0x0000FFFFu)
        #define MAC_TIMER_COMPARE_A_L_MAC_COMPARE_A_L_BIT    (0)
        #define MAC_TIMER_COMPARE_A_L_MAC_COMPARE_A_L_BITS   (16)

#define MAC_TIMER_COMPARE_B_H                                *((volatile uint32_t *)0x40002048u)
#define MAC_TIMER_COMPARE_B_H_REG                            *((volatile uint32_t *)0x40002048u)
#define MAC_TIMER_COMPARE_B_H_ADDR                           (0x40002048u)
#define MAC_TIMER_COMPARE_B_H_RESET                          (0x00000000u)
        /* MAC_COMPARE_B_H field */
        #define MAC_TIMER_COMPARE_B_H_MAC_COMPARE_B_H        (0x0000000Fu)
        #define MAC_TIMER_COMPARE_B_H_MAC_COMPARE_B_H_MASK   (0x0000000Fu)
        #define MAC_TIMER_COMPARE_B_H_MAC_COMPARE_B_H_BIT    (0)
        #define MAC_TIMER_COMPARE_B_H_MAC_COMPARE_B_H_BITS   (4)

#define MAC_TIMER_COMPARE_B_L                                *((volatile uint32_t *)0x4000204Cu)
#define MAC_TIMER_COMPARE_B_L_REG                            *((volatile uint32_t *)0x4000204Cu)
#define MAC_TIMER_COMPARE_B_L_ADDR                           (0x4000204Cu)
#define MAC_TIMER_COMPARE_B_L_RESET                          (0x00000000u)
        /* MAC_COMPARE_B_L field */
        #define MAC_TIMER_COMPARE_B_L_MAC_COMPARE_B_L        (0x0000FFFFu)
        #define MAC_TIMER_COMPARE_B_L_MAC_COMPARE_B_L_MASK   (0x0000FFFFu)
        #define MAC_TIMER_COMPARE_B_L_MAC_COMPARE_B_L_BIT    (0)
        #define MAC_TIMER_COMPARE_B_L_MAC_COMPARE_B_L_BITS   (16)

#define MAC_TIMER_CAPTURE_H                                  *((volatile uint32_t *)0x40002050u)
#define MAC_TIMER_CAPTURE_H_REG                              *((volatile uint32_t *)0x40002050u)
#define MAC_TIMER_CAPTURE_H_ADDR                             (0x40002050u)
#define MAC_TIMER_CAPTURE_H_RESET                            (0x00000000u)
        /* MAC_SFD_CAPTURE_HIGH field */
        #define MAC_TIMER_CAPTURE_H_MAC_SFD_CAPTURE_HIGH     (0x0000000Fu)
        #define MAC_TIMER_CAPTURE_H_MAC_SFD_CAPTURE_HIGH_MASK (0x0000000Fu)
        #define MAC_TIMER_CAPTURE_H_MAC_SFD_CAPTURE_HIGH_BIT (0)
        #define MAC_TIMER_CAPTURE_H_MAC_SFD_CAPTURE_HIGH_BITS (4)

#define MAC_TIMER_CAPTURE_L                                  *((volatile uint32_t *)0x40002054u)
#define MAC_TIMER_CAPTURE_L_REG                              *((volatile uint32_t *)0x40002054u)
#define MAC_TIMER_CAPTURE_L_ADDR                             (0x40002054u)
#define MAC_TIMER_CAPTURE_L_RESET                            (0x00000000u)
        /* MAC_SFD_CAPTURE_LOW field */
        #define MAC_TIMER_CAPTURE_L_MAC_SFD_CAPTURE_LOW      (0x0000FFFFu)
        #define MAC_TIMER_CAPTURE_L_MAC_SFD_CAPTURE_LOW_MASK (0x0000FFFFu)
        #define MAC_TIMER_CAPTURE_L_MAC_SFD_CAPTURE_LOW_BIT  (0)
        #define MAC_TIMER_CAPTURE_L_MAC_SFD_CAPTURE_LOW_BITS (16)

#define MAC_BO_TIMER                                         *((volatile uint32_t *)0x40002058u)
#define MAC_BO_TIMER_REG                                     *((volatile uint32_t *)0x40002058u)
#define MAC_BO_TIMER_ADDR                                    (0x40002058u)
#define MAC_BO_TIMER_RESET                                   (0x00000000u)
        /* MAC_BO_TIMER field */
        #define MAC_BO_TIMER_MAC_BO_TIMER                    (0x00000FFFu)
        #define MAC_BO_TIMER_MAC_BO_TIMER_MASK               (0x00000FFFu)
        #define MAC_BO_TIMER_MAC_BO_TIMER_BIT                (0)
        #define MAC_BO_TIMER_MAC_BO_TIMER_BITS               (12)

#define MAC_BOP_TIMER                                        *((volatile uint32_t *)0x4000205Cu)
#define MAC_BOP_TIMER_REG                                    *((volatile uint32_t *)0x4000205Cu)
#define MAC_BOP_TIMER_ADDR                                   (0x4000205Cu)
#define MAC_BOP_TIMER_RESET                                  (0x00000000u)
        /* MAC_BOP_TIMER field */
        #define MAC_BOP_TIMER_MAC_BOP_TIMER                  (0x0000007Fu)
        #define MAC_BOP_TIMER_MAC_BOP_TIMER_MASK             (0x0000007Fu)
        #define MAC_BOP_TIMER_MAC_BOP_TIMER_BIT              (0)
        #define MAC_BOP_TIMER_MAC_BOP_TIMER_BITS             (7)

#define MAC_TX_STROBE                                        *((volatile uint32_t *)0x40002060u)
#define MAC_TX_STROBE_REG                                    *((volatile uint32_t *)0x40002060u)
#define MAC_TX_STROBE_ADDR                                   (0x40002060u)
#define MAC_TX_STROBE_RESET                                  (0x00000000u)
        /* AUTO_CRC_TX field */
        #define MAC_TX_STROBE_AUTO_CRC_TX                    (0x00000008u)
        #define MAC_TX_STROBE_AUTO_CRC_TX_MASK               (0x00000008u)
        #define MAC_TX_STROBE_AUTO_CRC_TX_BIT                (3)
        #define MAC_TX_STROBE_AUTO_CRC_TX_BITS               (1)
        /* CCA_ON field */
        #define MAC_TX_STROBE_CCA_ON                         (0x00000004u)
        #define MAC_TX_STROBE_CCA_ON_MASK                    (0x00000004u)
        #define MAC_TX_STROBE_CCA_ON_BIT                     (2)
        #define MAC_TX_STROBE_CCA_ON_BITS                    (1)
        /* MAC_TX_RST field */
        #define MAC_TX_STROBE_MAC_TX_RST                     (0x00000002u)
        #define MAC_TX_STROBE_MAC_TX_RST_MASK                (0x00000002u)
        #define MAC_TX_STROBE_MAC_TX_RST_BIT                 (1)
        #define MAC_TX_STROBE_MAC_TX_RST_BITS                (1)
        /* START_TX field */
        #define MAC_TX_STROBE_START_TX                       (0x00000001u)
        #define MAC_TX_STROBE_START_TX_MASK                  (0x00000001u)
        #define MAC_TX_STROBE_START_TX_BIT                   (0)
        #define MAC_TX_STROBE_START_TX_BITS                  (1)

#define MAC_ACK_STROBE                                       *((volatile uint32_t *)0x40002064u)
#define MAC_ACK_STROBE_REG                                   *((volatile uint32_t *)0x40002064u)
#define MAC_ACK_STROBE_ADDR                                  (0x40002064u)
#define MAC_ACK_STROBE_RESET                                 (0x00000000u)
        /* MANUAL_ACK field */
        #define MAC_ACK_STROBE_MANUAL_ACK                    (0x00000002u)
        #define MAC_ACK_STROBE_MANUAL_ACK_MASK               (0x00000002u)
        #define MAC_ACK_STROBE_MANUAL_ACK_BIT                (1)
        #define MAC_ACK_STROBE_MANUAL_ACK_BITS               (1)
        /* FRAME_PENDING field */
        #define MAC_ACK_STROBE_FRAME_PENDING                 (0x00000001u)
        #define MAC_ACK_STROBE_FRAME_PENDING_MASK            (0x00000001u)
        #define MAC_ACK_STROBE_FRAME_PENDING_BIT             (0)
        #define MAC_ACK_STROBE_FRAME_PENDING_BITS            (1)

#define MAC_STATUS                                           *((volatile uint32_t *)0x40002068u)
#define MAC_STATUS_REG                                       *((volatile uint32_t *)0x40002068u)
#define MAC_STATUS_ADDR                                      (0x40002068u)
#define MAC_STATUS_RESET                                     (0x00000000u)
        /* RX_B_PEND_TX_ACK field */
        #define MAC_STATUS_RX_B_PEND_TX_ACK                  (0x00000800u)
        #define MAC_STATUS_RX_B_PEND_TX_ACK_MASK             (0x00000800u)
        #define MAC_STATUS_RX_B_PEND_TX_ACK_BIT              (11)
        #define MAC_STATUS_RX_B_PEND_TX_ACK_BITS             (1)
        /* RX_A_PEND_TX_ACK field */
        #define MAC_STATUS_RX_A_PEND_TX_ACK                  (0x00000400u)
        #define MAC_STATUS_RX_A_PEND_TX_ACK_MASK             (0x00000400u)
        #define MAC_STATUS_RX_A_PEND_TX_ACK_BIT              (10)
        #define MAC_STATUS_RX_A_PEND_TX_ACK_BITS             (1)
        /* RX_B_LAST_UNLOAD field */
        #define MAC_STATUS_RX_B_LAST_UNLOAD                  (0x00000200u)
        #define MAC_STATUS_RX_B_LAST_UNLOAD_MASK             (0x00000200u)
        #define MAC_STATUS_RX_B_LAST_UNLOAD_BIT              (9)
        #define MAC_STATUS_RX_B_LAST_UNLOAD_BITS             (1)
        /* RX_A_LAST_UNLOAD field */
        #define MAC_STATUS_RX_A_LAST_UNLOAD                  (0x00000100u)
        #define MAC_STATUS_RX_A_LAST_UNLOAD_MASK             (0x00000100u)
        #define MAC_STATUS_RX_A_LAST_UNLOAD_BIT              (8)
        #define MAC_STATUS_RX_A_LAST_UNLOAD_BITS             (1)
        /* WRONG_FORMAT field */
        #define MAC_STATUS_WRONG_FORMAT                      (0x00000080u)
        #define MAC_STATUS_WRONG_FORMAT_MASK                 (0x00000080u)
        #define MAC_STATUS_WRONG_FORMAT_BIT                  (7)
        #define MAC_STATUS_WRONG_FORMAT_BITS                 (1)
        /* WRONG_ADDRESS field */
        #define MAC_STATUS_WRONG_ADDRESS                     (0x00000040u)
        #define MAC_STATUS_WRONG_ADDRESS_MASK                (0x00000040u)
        #define MAC_STATUS_WRONG_ADDRESS_BIT                 (6)
        #define MAC_STATUS_WRONG_ADDRESS_BITS                (1)
        /* RX_ACK_REC field */
        #define MAC_STATUS_RX_ACK_REC                        (0x00000020u)
        #define MAC_STATUS_RX_ACK_REC_MASK                   (0x00000020u)
        #define MAC_STATUS_RX_ACK_REC_BIT                    (5)
        #define MAC_STATUS_RX_ACK_REC_BITS                   (1)
        /* SENDING_ACK field */
        #define MAC_STATUS_SENDING_ACK                       (0x00000010u)
        #define MAC_STATUS_SENDING_ACK_MASK                  (0x00000010u)
        #define MAC_STATUS_SENDING_ACK_BIT                   (4)
        #define MAC_STATUS_SENDING_ACK_BITS                  (1)
        /* RUN_BO field */
        #define MAC_STATUS_RUN_BO                            (0x00000008u)
        #define MAC_STATUS_RUN_BO_MASK                       (0x00000008u)
        #define MAC_STATUS_RUN_BO_BIT                        (3)
        #define MAC_STATUS_RUN_BO_BITS                       (1)
        /* TX_FRAME field */
        #define MAC_STATUS_TX_FRAME                          (0x00000004u)
        #define MAC_STATUS_TX_FRAME_MASK                     (0x00000004u)
        #define MAC_STATUS_TX_FRAME_BIT                      (2)
        #define MAC_STATUS_TX_FRAME_BITS                     (1)
        /* RX_FRAME field */
        #define MAC_STATUS_RX_FRAME                          (0x00000002u)
        #define MAC_STATUS_RX_FRAME_MASK                     (0x00000002u)
        #define MAC_STATUS_RX_FRAME_BIT                      (1)
        #define MAC_STATUS_RX_FRAME_BITS                     (1)
        /* RX_CRC_PASS field */
        #define MAC_STATUS_RX_CRC_PASS                       (0x00000001u)
        #define MAC_STATUS_RX_CRC_PASS_MASK                  (0x00000001u)
        #define MAC_STATUS_RX_CRC_PASS_BIT                   (0)
        #define MAC_STATUS_RX_CRC_PASS_BITS                  (1)

#define TX_CRC                                               *((volatile uint32_t *)0x4000206Cu)
#define TX_CRC_REG                                           *((volatile uint32_t *)0x4000206Cu)
#define TX_CRC_ADDR                                          (0x4000206Cu)
#define TX_CRC_RESET                                         (0x00000000u)
        /* TX_CRC field */
        #define TX_CRC_TX_CRC                                (0x0000FFFFu)
        #define TX_CRC_TX_CRC_MASK                           (0x0000FFFFu)
        #define TX_CRC_TX_CRC_BIT                            (0)
        #define TX_CRC_TX_CRC_BITS                           (16)

#define RX_CRC                                               *((volatile uint32_t *)0x40002070u)
#define RX_CRC_REG                                           *((volatile uint32_t *)0x40002070u)
#define RX_CRC_ADDR                                          (0x40002070u)
#define RX_CRC_RESET                                         (0x00000000u)
        /* RX_CRC field */
        #define RX_CRC_RX_CRC                                (0x0000FFFFu)
        #define RX_CRC_RX_CRC_MASK                           (0x0000FFFFu)
        #define RX_CRC_RX_CRC_BIT                            (0)
        #define RX_CRC_RX_CRC_BITS                           (16)

#define MAC_ACK_TO                                           *((volatile uint32_t *)0x40002074u)
#define MAC_ACK_TO_REG                                       *((volatile uint32_t *)0x40002074u)
#define MAC_ACK_TO_ADDR                                      (0x40002074u)
#define MAC_ACK_TO_RESET                                     (0x00000300u)
        /* ACK_TO field */
        #define MAC_ACK_TO_ACK_TO                            (0x00003FFFu)
        #define MAC_ACK_TO_ACK_TO_MASK                       (0x00003FFFu)
        #define MAC_ACK_TO_ACK_TO_BIT                        (0)
        #define MAC_ACK_TO_ACK_TO_BITS                       (14)

#define MAC_BOP_COMPARE                                      *((volatile uint32_t *)0x40002078u)
#define MAC_BOP_COMPARE_REG                                  *((volatile uint32_t *)0x40002078u)
#define MAC_BOP_COMPARE_ADDR                                 (0x40002078u)
#define MAC_BOP_COMPARE_RESET                                (0x00000014u)
        /* MAC_BOP_COMPARE field */
        #define MAC_BOP_COMPARE_MAC_BOP_COMPARE              (0x0000007Fu)
        #define MAC_BOP_COMPARE_MAC_BOP_COMPARE_MASK         (0x0000007Fu)
        #define MAC_BOP_COMPARE_MAC_BOP_COMPARE_BIT          (0)
        #define MAC_BOP_COMPARE_MAC_BOP_COMPARE_BITS         (7)

