contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define MAC_TX_ACK_FRAME                                     *((volatile uint32_t *)0x4000207Cu)
#define MAC_TX_ACK_FRAME_REG                                 *((volatile uint32_t *)0x4000207Cu)
#define MAC_TX_ACK_FRAME_ADDR                                (0x4000207Cu)
#define MAC_TX_ACK_FRAME_RESET                               (0x00000002u)
        /* ACK_SRC_AM field */
        #define MAC_TX_ACK_FRAME_ACK_SRC_AM                  (0x0000C000u)
        #define MAC_TX_ACK_FRAME_ACK_SRC_AM_MASK             (0x0000C000u)
        #define MAC_TX_ACK_FRAME_ACK_SRC_AM_BIT              (14)
        #define MAC_TX_ACK_FRAME_ACK_SRC_AM_BITS             (2)
        /* RES1213 field */
        #define MAC_TX_ACK_FRAME_RES1213                     (0x00003000u)
        #define MAC_TX_ACK_FRAME_RES1213_MASK                (0x00003000u)
        #define MAC_TX_ACK_FRAME_RES1213_BIT                 (12)
        #define MAC_TX_ACK_FRAME_RES1213_BITS                (2)
        /* ACK_DST_AM field */
        #define MAC_TX_ACK_FRAME_ACK_DST_AM                  (0x00000C00u)
        #define MAC_TX_ACK_FRAME_ACK_DST_AM_MASK             (0x00000C00u)
        #define MAC_TX_ACK_FRAME_ACK_DST_AM_BIT              (10)
        #define MAC_TX_ACK_FRAME_ACK_DST_AM_BITS             (2)
        /* RES789 field */
        #define MAC_TX_ACK_FRAME_RES789                      (0x00000380u)
        #define MAC_TX_ACK_FRAME_RES789_MASK                 (0x00000380u)
        #define MAC_TX_ACK_FRAME_RES789_BIT                  (7)
        #define MAC_TX_ACK_FRAME_RES789_BITS                 (3)
        /* ACK_IP field */
        #define MAC_TX_ACK_FRAME_ACK_IP                      (0x00000040u)
        #define MAC_TX_ACK_FRAME_ACK_IP_MASK                 (0x00000040u)
        #define MAC_TX_ACK_FRAME_ACK_IP_BIT                  (6)
        #define MAC_TX_ACK_FRAME_ACK_IP_BITS                 (1)
        /* ACK_ACK_REQ field */
        #define MAC_TX_ACK_FRAME_ACK_ACK_REQ                 (0x00000020u)
        #define MAC_TX_ACK_FRAME_ACK_ACK_REQ_MASK            (0x00000020u)
        #define MAC_TX_ACK_FRAME_ACK_ACK_REQ_BIT             (5)
        #define MAC_TX_ACK_FRAME_ACK_ACK_REQ_BITS            (1)
        /* ACK_FRAME_P field */
        #define MAC_TX_ACK_FRAME_ACK_FRAME_P                 (0x00000010u)
        #define MAC_TX_ACK_FRAME_ACK_FRAME_P_MASK            (0x00000010u)
        #define MAC_TX_ACK_FRAME_ACK_FRAME_P_BIT             (4)
        #define MAC_TX_ACK_FRAME_ACK_FRAME_P_BITS            (1)
        /* ACK_SEC_EN field */
        #define MAC_TX_ACK_FRAME_ACK_SEC_EN                  (0x00000008u)
        #define MAC_TX_ACK_FRAME_ACK_SEC_EN_MASK             (0x00000008u)
        #define MAC_TX_ACK_FRAME_ACK_SEC_EN_BIT              (3)
        #define MAC_TX_ACK_FRAME_ACK_SEC_EN_BITS             (1)
        /* ACK_FRAME_T field */
        #define MAC_TX_ACK_FRAME_ACK_FRAME_T                 (0x00000007u)
        #define MAC_TX_ACK_FRAME_ACK_FRAME_T_MASK            (0x00000007u)
        #define MAC_TX_ACK_FRAME_ACK_FRAME_T_BIT             (0)
        #define MAC_TX_ACK_FRAME_ACK_FRAME_T_BITS            (3)

#define MAC_CONFIG                                           *((volatile uint32_t *)0x40002080u)
#define MAC_CONFIG_REG                                       *((volatile uint32_t *)0x40002080u)
#define MAC_CONFIG_ADDR                                      (0x40002080u)
#define MAC_CONFIG_RESET                                     (0x00000000u)
        /* RSSI_INST_EN field */
        #define MAC_CONFIG_RSSI_INST_EN                      (0x00000004u)
        #define MAC_CONFIG_RSSI_INST_EN_MASK                 (0x00000004u)
        #define MAC_CONFIG_RSSI_INST_EN_BIT                  (2)
        #define MAC_CONFIG_RSSI_INST_EN_BITS                 (1)
        /* SPI_SPY_EN field */
        #define MAC_CONFIG_SPI_SPY_EN                        (0x00000002u)
        #define MAC_CONFIG_SPI_SPY_EN_MASK                   (0x00000002u)
        #define MAC_CONFIG_SPI_SPY_EN_BIT                    (1)
        #define MAC_CONFIG_SPI_SPY_EN_BITS                   (1)
        /* MAC_MODE field */
        #define MAC_CONFIG_MAC_MODE                          (0x00000001u)
        #define MAC_CONFIG_MAC_MODE_MASK                     (0x00000001u)
        #define MAC_CONFIG_MAC_MODE_BIT                      (0)
        #define MAC_CONFIG_MAC_MODE_BITS                     (1)

#define MAC_RX_CONFIG                                        *((volatile uint32_t *)0x40002084u)
#define MAC_RX_CONFIG_REG                                    *((volatile uint32_t *)0x40002084u)
#define MAC_RX_CONFIG_ADDR                                   (0x40002084u)
#define MAC_RX_CONFIG_RESET                                  (0x00000000u)
        /* AUTO_ACK field */
        #define MAC_RX_CONFIG_AUTO_ACK                       (0x00000080u)
        #define MAC_RX_CONFIG_AUTO_ACK_MASK                  (0x00000080u)
        #define MAC_RX_CONFIG_AUTO_ACK_BIT                   (7)
        #define MAC_RX_CONFIG_AUTO_ACK_BITS                  (1)
        /* APPEND_INFO field */
        #define MAC_RX_CONFIG_APPEND_INFO                    (0x00000040u)
        #define MAC_RX_CONFIG_APPEND_INFO_MASK               (0x00000040u)
        #define MAC_RX_CONFIG_APPEND_INFO_BIT                (6)
        #define MAC_RX_CONFIG_APPEND_INFO_BITS               (1)
        /* COORDINATOR field */
        #define MAC_RX_CONFIG_COORDINATOR                    (0x00000020u)
        #define MAC_RX_CONFIG_COORDINATOR_MASK               (0x00000020u)
        #define MAC_RX_CONFIG_COORDINATOR_BIT                (5)
        #define MAC_RX_CONFIG_COORDINATOR_BITS               (1)
        /* FILT_ADDR_ON field */
        #define MAC_RX_CONFIG_FILT_ADDR_ON                   (0x00000010u)
        #define MAC_RX_CONFIG_FILT_ADDR_ON_MASK              (0x00000010u)
        #define MAC_RX_CONFIG_FILT_ADDR_ON_BIT               (4)
        #define MAC_RX_CONFIG_FILT_ADDR_ON_BITS              (1)
        /* RES_FILT_PASS_ADDR field */
        #define MAC_RX_CONFIG_RES_FILT_PASS_ADDR             (0x00000008u)
        #define MAC_RX_CONFIG_RES_FILT_PASS_ADDR_MASK        (0x00000008u)
        #define MAC_RX_CONFIG_RES_FILT_PASS_ADDR_BIT         (3)
        #define MAC_RX_CONFIG_RES_FILT_PASS_ADDR_BITS        (1)
        /* RES_FILT_PASS field */
        #define MAC_RX_CONFIG_RES_FILT_PASS                  (0x00000004u)
        #define MAC_RX_CONFIG_RES_FILT_PASS_MASK             (0x00000004u)
        #define MAC_RX_CONFIG_RES_FILT_PASS_BIT              (2)
        #define MAC_RX_CONFIG_RES_FILT_PASS_BITS             (1)
        /* FILT_FORMAT_ON field */
        #define MAC_RX_CONFIG_FILT_FORMAT_ON                 (0x00000002u)
        #define MAC_RX_CONFIG_FILT_FORMAT_ON_MASK            (0x00000002u)
        #define MAC_RX_CONFIG_FILT_FORMAT_ON_BIT             (1)
        #define MAC_RX_CONFIG_FILT_FORMAT_ON_BITS            (1)
        /* MAC_RX_RST field */
        #define MAC_RX_CONFIG_MAC_RX_RST                     (0x00000001u)
        #define MAC_RX_CONFIG_MAC_RX_RST_MASK                (0x00000001u)
        #define MAC_RX_CONFIG_MAC_RX_RST_BIT                 (0)
        #define MAC_RX_CONFIG_MAC_RX_RST_BITS                (1)

#define MAC_TX_CONFIG                                        *((volatile uint32_t *)0x40002088u)
#define MAC_TX_CONFIG_REG                                    *((volatile uint32_t *)0x40002088u)
#define MAC_TX_CONFIG_ADDR                                   (0x40002088u)
#define MAC_TX_CONFIG_RESET                                  (0x00000008u)
        /* SLOTTED field */
        #define MAC_TX_CONFIG_SLOTTED                        (0x00000010u)
        #define MAC_TX_CONFIG_SLOTTED_MASK                   (0x00000010u)
        #define MAC_TX_CONFIG_SLOTTED_BIT                    (4)
        #define MAC_TX_CONFIG_SLOTTED_BITS                   (1)
        /* CCA_DELAY field */
        #define MAC_TX_CONFIG_CCA_DELAY                      (0x00000008u)
        #define MAC_TX_CONFIG_CCA_DELAY_MASK                 (0x00000008u)
        #define MAC_TX_CONFIG_CCA_DELAY_BIT                  (3)
        #define MAC_TX_CONFIG_CCA_DELAY_BITS                 (1)
        /* SLOTTED_ACK field */
        #define MAC_TX_CONFIG_SLOTTED_ACK                    (0x00000004u)
        #define MAC_TX_CONFIG_SLOTTED_ACK_MASK               (0x00000004u)
        #define MAC_TX_CONFIG_SLOTTED_ACK_BIT                (2)
        #define MAC_TX_CONFIG_SLOTTED_ACK_BITS               (1)
        /* INFINITE_CRC field */
        #define MAC_TX_CONFIG_INFINITE_CRC                   (0x00000002u)
        #define MAC_TX_CONFIG_INFINITE_CRC_MASK              (0x00000002u)
        #define MAC_TX_CONFIG_INFINITE_CRC_BIT               (1)
        #define MAC_TX_CONFIG_INFINITE_CRC_BITS              (1)
        /* WAIT_ACK field */
        #define MAC_TX_CONFIG_WAIT_ACK                       (0x00000001u)
        #define MAC_TX_CONFIG_WAIT_ACK_MASK                  (0x00000001u)
        #define MAC_TX_CONFIG_WAIT_ACK_BIT                   (0)
        #define MAC_TX_CONFIG_WAIT_ACK_BITS                  (1)

