contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define CBC_STATE_3                                          *((volatile uint32_t *)0x40003014u)
#define CBC_STATE_3_REG                                      *((volatile uint32_t *)0x40003014u)
#define CBC_STATE_3_ADDR                                     (0x40003014u)
#define CBC_STATE_3_RESET                                    (0x00000000u)
        /* CBC_STATE_3 field */
        #define CBC_STATE_3_CBC_STATE_3                      (0xFFFFFFFFu)
        #define CBC_STATE_3_CBC_STATE_3_MASK                 (0xFFFFFFFFu)
        #define CBC_STATE_3_CBC_STATE_3_BIT                  (0)
        #define CBC_STATE_3_CBC_STATE_3_BITS                 (32)

#define PT                                                   *((volatile uint32_t *)0x40003028u)
#define PT_REG                                               *((volatile uint32_t *)0x40003028u)
#define PT_ADDR                                              (0x40003028u)
#define PT_RESET                                             (0x00000000u)
        /* PT field */
        #define PT_PT                                        (0xFFFFFFFFu)
        #define PT_PT_MASK                                   (0xFFFFFFFFu)
        #define PT_PT_BIT                                    (0)
        #define PT_PT_BITS                                   (32)

#define CT                                                   *((volatile uint32_t *)0x40003030u)
#define CT_REG                                               *((volatile uint32_t *)0x40003030u)
#define CT_ADDR                                              (0x40003030u)
#define CT_RESET                                             (0x00000000u)
        /* CT field */
        #define CT_CT                                        (0xFFFFFFFFu)
        #define CT_CT_MASK                                   (0xFFFFFFFFu)
        #define CT_CT_BIT                                    (0)
        #define CT_CT_BITS                                   (32)

#define KEY_0                                                *((volatile uint32_t *)0x40003038u)
#define KEY_0_REG                                            *((volatile uint32_t *)0x40003038u)
#define KEY_0_ADDR                                           (0x40003038u)
#define KEY_0_RESET                                          (0x00000000u)
        /* KEY_O field */
        #define KEY_0_KEY_O                                  (0xFFFFFFFFu)
        #define KEY_0_KEY_O_MASK                             (0xFFFFFFFFu)
        #define KEY_0_KEY_O_BIT                              (0)
        #define KEY_0_KEY_O_BITS                             (32)

#define KEY_1                                                *((volatile uint32_t *)0x4000303Cu)
#define KEY_1_REG                                            *((volatile uint32_t *)0x4000303Cu)
#define KEY_1_ADDR                                           (0x4000303Cu)
#define KEY_1_RESET                                          (0x00000000u)
        /* KEY_1 field */
        #define KEY_1_KEY_1                                  (0xFFFFFFFFu)
        #define KEY_1_KEY_1_MASK                             (0xFFFFFFFFu)
        #define KEY_1_KEY_1_BIT                              (0)
        #define KEY_1_KEY_1_BITS                             (32)

#define KEY_2                                                *((volatile uint32_t *)0x40003040u)
#define KEY_2_REG                                            *((volatile uint32_t *)0x40003040u)
#define KEY_2_ADDR                                           (0x40003040u)
#define KEY_2_RESET                                          (0x00000000u)
        /* KEY_2 field */
        #define KEY_2_KEY_2                                  (0xFFFFFFFFu)
        #define KEY_2_KEY_2_MASK                             (0xFFFFFFFFu)
        #define KEY_2_KEY_2_BIT                              (0)
        #define KEY_2_KEY_2_BITS                             (32)

#define KEY_3                                                *((volatile uint32_t *)0x40003044u)
#define KEY_3_REG                                            *((volatile uint32_t *)0x40003044u)
#define KEY_3_ADDR                                           (0x40003044u)
#define KEY_3_RESET                                          (0x00000000u)
        /* KEY_3 field */
        #define KEY_3_KEY_3                                  (0xFFFFFFFFu)
        #define KEY_3_KEY_3_MASK                             (0xFFFFFFFFu)
        #define KEY_3_KEY_3_BIT                              (0)
        #define KEY_3_KEY_3_BITS                             (32)

/* CM_LV block */
#define BLOCK_CM_LV_BASE                                     (0x40004000u)
#define BLOCK_CM_LV_END                                      (0x40004034u)
#define BLOCK_CM_LV_SIZE                                     (BLOCK_CM_LV_END - BLOCK_CM_LV_BASE + 1)

#define SILICON_ID                                           *((volatile uint32_t *)0x40004000u)
#define SILICON_ID_REG                                       *((volatile uint32_t *)0x40004000u)
#define SILICON_ID_ADDR                                      (0x40004000u)
#define SILICON_ID_RESET                                     (0x069A862Bu)
        /* HW_VERSION field */
        #define SILICON_ID_HW_VERSION                        (0xF0000000u)
        #define SILICON_ID_HW_VERSION_MASK                   (0xF0000000u)
        #define SILICON_ID_HW_VERSION_BIT                    (28)
        #define SILICON_ID_HW_VERSION_BITS                   (4)
        /* ST_DIVISION field */
        #define SILICON_ID_ST_DIVISION                       (0x0F000000u)
        #define SILICON_ID_ST_DIVISION_MASK                  (0x0F000000u)
        #define SILICON_ID_ST_DIVISION_BIT                   (24)
        #define SILICON_ID_ST_DIVISION_BITS                  (4)
        /* CHIP_TYPE field */
        #define SILICON_ID_CHIP_TYPE                         (0x00FF8000u)
        #define SILICON_ID_CHIP_TYPE_MASK                    (0x00FF8000u)
        #define SILICON_ID_CHIP_TYPE_BIT                     (15)
        #define SILICON_ID_CHIP_TYPE_BITS                    (9)
        /* SUB_TYPE field */
        #define SILICON_ID_SUB_TYPE                          (0x00007000u)
        #define SILICON_ID_SUB_TYPE_MASK                     (0x00007000u)
        #define SILICON_ID_SUB_TYPE_BIT                      (12)
        #define SILICON_ID_SUB_TYPE_BITS                     (3)
        /* JEDEC_MAN_ID field */
        #define SILICON_ID_JEDEC_MAN_ID                      (0x00000FFEu)
        #define SILICON_ID_JEDEC_MAN_ID_MASK                 (0x00000FFEu)
        #define SILICON_ID_JEDEC_MAN_ID_BIT                  (1)
        #define SILICON_ID_JEDEC_MAN_ID_BITS                 (11)
        /* ONE field */
        #define SILICON_ID_ONE                               (0x00000001u)
        #define SILICON_ID_ONE_MASK                          (0x00000001u)
        #define SILICON_ID_ONE_BIT                           (0)
        #define SILICON_ID_ONE_BITS                          (1)

