contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define OSC24M_BIASTRIM                                      *((volatile uint32_t *)0x40004004u)
#define OSC24M_BIASTRIM_REG                                  *((volatile uint32_t *)0x40004004u)
#define OSC24M_BIASTRIM_ADDR                                 (0x40004004u)
#define OSC24M_BIASTRIM_RESET                                (0x0000000Fu)
        /* OSC24M_BIAS_TRIM field */
        #define OSC24M_BIASTRIM_OSC24M_BIAS_TRIM             (0x0000000Fu)
        #define OSC24M_BIASTRIM_OSC24M_BIAS_TRIM_MASK        (0x0000000Fu)
        #define OSC24M_BIASTRIM_OSC24M_BIAS_TRIM_BIT         (0)
        #define OSC24M_BIASTRIM_OSC24M_BIAS_TRIM_BITS        (4)

#define OSCHF_TUNE                                           *((volatile uint32_t *)0x40004008u)
#define OSCHF_TUNE_REG                                       *((volatile uint32_t *)0x40004008u)
#define OSCHF_TUNE_ADDR                                      (0x40004008u)
#define OSCHF_TUNE_RESET                                     (0x00000017u)
        /* OSCHF_TUNE_FIELD field */
        #define OSCHF_TUNE_FIELD                             (0x0000001Fu)
        #define OSCHF_TUNE_FIELD_MASK                        (0x0000001Fu)
        #define OSCHF_TUNE_FIELD_BIT                         (0)
        #define OSCHF_TUNE_FIELD_BITS                        (5)

#define OSC24M_COMP                                          *((volatile uint32_t *)0x4000400Cu)
#define OSC24M_COMP_REG                                      *((volatile uint32_t *)0x4000400Cu)
#define OSC24M_COMP_ADDR                                     (0x4000400Cu)
#define OSC24M_COMP_RESET                                    (0x00000000u)
        /* OSC24M_HI field */
        #define OSC24M_HI                                    (0x00000002u)
        #define OSC24M_HI_MASK                               (0x00000002u)
        #define OSC24M_HI_BIT                                (1)
        #define OSC24M_HI_BITS                               (1)
        /* OSC24M_LO field */
        #define OSC24M_LO                                    (0x00000001u)
        #define OSC24M_LO_MASK                               (0x00000001u)
        #define OSC24M_LO_BIT                                (0)
        #define OSC24M_LO_BITS                               (1)

#define CLK_PERIODMODE                                       *((volatile uint32_t *)0x40004010u)
#define CLK_PERIODMODE_REG                                   *((volatile uint32_t *)0x40004010u)
#define CLK_PERIODMODE_ADDR                                  (0x40004010u)
#define CLK_PERIODMODE_RESET                                 (0x00000000u)
        /* CLK_PERIODMODE_FIELD field */
        #define CLK_PERIODMODE_FIELD                         (0x00000003u)
        #define CLK_PERIODMODE_FIELD_MASK                    (0x00000003u)
        #define CLK_PERIODMODE_FIELD_BIT                     (0)
        #define CLK_PERIODMODE_FIELD_BITS                    (2)

#define CLK_PERIOD                                           *((volatile uint32_t *)0x40004014u)
#define CLK_PERIOD_REG                                       *((volatile uint32_t *)0x40004014u)
#define CLK_PERIOD_ADDR                                      (0x40004014u)
#define CLK_PERIOD_RESET                                     (0x00000000u)
        /* CLK_PERIOD_FIELD field */
        #define CLK_PERIOD_FIELD                             (0x0000FFFFu)
        #define CLK_PERIOD_FIELD_MASK                        (0x0000FFFFu)
        #define CLK_PERIOD_FIELD_BIT                         (0)
        #define CLK_PERIOD_FIELD_BITS                        (16)

#define DITHER_DIS                                           *((volatile uint32_t *)0x40004018u)
#define DITHER_DIS_REG                                       *((volatile uint32_t *)0x40004018u)
#define DITHER_DIS_ADDR                                      (0x40004018u)
#define DITHER_DIS_RESET                                     (0x00000000u)
        /* DITHER_DIS field */
        #define DITHER_DIS_DITHER_DIS                        (0x00000001u)
        #define DITHER_DIS_DITHER_DIS_MASK                   (0x00000001u)
        #define DITHER_DIS_DITHER_DIS_BIT                    (0)
        #define DITHER_DIS_DITHER_DIS_BITS                   (1)

#define OSC24M_CTRL                                          *((volatile uint32_t *)0x4000401Cu)
#define OSC24M_CTRL_REG                                      *((volatile uint32_t *)0x4000401Cu)
#define OSC24M_CTRL_ADDR                                     (0x4000401Cu)
#define OSC24M_CTRL_RESET                                    (0x00000000u)
        /* OSC24M_EN field */
        #define OSC24M_CTRL_OSC24M_EN                        (0x00000002u)
        #define OSC24M_CTRL_OSC24M_EN_MASK                   (0x00000002u)
        #define OSC24M_CTRL_OSC24M_EN_BIT                    (1)
        #define OSC24M_CTRL_OSC24M_EN_BITS                   (1)
        /* OSC24M_SEL field */
        #define OSC24M_CTRL_OSC24M_SEL                       (0x00000001u)
        #define OSC24M_CTRL_OSC24M_SEL_MASK                  (0x00000001u)
        #define OSC24M_CTRL_OSC24M_SEL_BIT                   (0)
        #define OSC24M_CTRL_OSC24M_SEL_BITS                  (1)

#define CPU_CLKSEL                                           *((volatile uint32_t *)0x40004020u)
#define CPU_CLKSEL_REG                                       *((volatile uint32_t *)0x40004020u)
#define CPU_CLKSEL_ADDR                                      (0x40004020u)
#define CPU_CLKSEL_RESET                                     (0x00000000u)
        /* CPU_CLKSEL_FIELD field */
        #define CPU_CLKSEL_FIELD                             (0x00000001u)
        #define CPU_CLKSEL_FIELD_MASK                        (0x00000001u)
        #define CPU_CLKSEL_FIELD_BIT                         (0)
        #define CPU_CLKSEL_FIELD_BITS                        (1)

#define BUS_FAULT                                            *((volatile uint32_t *)0x40004024u)
#define BUS_FAULT_REG                                        *((volatile uint32_t *)0x40004024u)
#define BUS_FAULT_ADDR                                       (0x40004024u)
#define BUS_FAULT_RESET                                      (0x00000000u)
        /* WRONGSIZE field */
        #define BUS_FAULT_WRONGSIZE                          (0x00000008u)
        #define BUS_FAULT_WRONGSIZE_MASK                     (0x00000008u)
        #define BUS_FAULT_WRONGSIZE_BIT                      (3)
        #define BUS_FAULT_WRONGSIZE_BITS                     (1)
        /* PROTECTED field */
        #define BUS_FAULT_PROTECTED                          (0x00000004u)
        #define BUS_FAULT_PROTECTED_MASK                     (0x00000004u)
        #define BUS_FAULT_PROTECTED_BIT                      (2)
        #define BUS_FAULT_PROTECTED_BITS                     (1)
        /* RESERVED field */
        #define BUS_FAULT_RESERVED                           (0x00000002u)
        #define BUS_FAULT_RESERVED_MASK                      (0x00000002u)
        #define BUS_FAULT_RESERVED_BIT                       (1)
        #define BUS_FAULT_RESERVED_BITS                      (1)
        /* MISSED field */
        #define BUS_FAULT_MISSED                             (0x00000001u)
        #define BUS_FAULT_MISSED_MASK                        (0x00000001u)
        #define BUS_FAULT_MISSED_BIT                         (0)
        #define BUS_FAULT_MISSED_BITS                        (1)

#define PCTRACE_SEL                                          *((volatile uint32_t *)0x40004028u)
#define PCTRACE_SEL_REG                                      *((volatile uint32_t *)0x40004028u)
#define PCTRACE_SEL_ADDR                                     (0x40004028u)
#define PCTRACE_SEL_RESET                                    (0x00000000u)
        /* PCTRACE_SEL_FIELD field */
        #define PCTRACE_SEL_FIELD                            (0x00000001u)
        #define PCTRACE_SEL_FIELD_MASK                       (0x00000001u)
        #define PCTRACE_SEL_FIELD_BIT                        (0)
        #define PCTRACE_SEL_FIELD_BITS                       (1)

