contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define WDOG_RESET                                           *((volatile uint32_t *)0x40006008u)
#define WDOG_RESET_REG                                       *((volatile uint32_t *)0x40006008u)
#define WDOG_RESET_ADDR                                      (0x40006008u)
#define WDOG_RESET_RESET                                     (0x00000000u)

#define SLEEPTMR_CFG                                         *((volatile uint32_t *)0x4000600Cu)
#define SLEEPTMR_CFG_REG                                     *((volatile uint32_t *)0x4000600Cu)
#define SLEEPTMR_CFG_ADDR                                    (0x4000600Cu)
#define SLEEPTMR_CFG_RESET                                   (0x00000400u)
        /* SLEEPTMR_REVERSE field */
        #define SLEEPTMR_REVERSE                             (0x00001000u)
        #define SLEEPTMR_REVERSE_MASK                        (0x00001000u)
        #define SLEEPTMR_REVERSE_BIT                         (12)
        #define SLEEPTMR_REVERSE_BITS                        (1)
        /* SLEEPTMR_ENABLE field */
        #define SLEEPTMR_ENABLE                              (0x00000800u)
        #define SLEEPTMR_ENABLE_MASK                         (0x00000800u)
        #define SLEEPTMR_ENABLE_BIT                          (11)
        #define SLEEPTMR_ENABLE_BITS                         (1)
        /* SLEEPTMR_DBGPAUSE field */
        #define SLEEPTMR_DBGPAUSE                            (0x00000400u)
        #define SLEEPTMR_DBGPAUSE_MASK                       (0x00000400u)
        #define SLEEPTMR_DBGPAUSE_BIT                        (10)
        #define SLEEPTMR_DBGPAUSE_BITS                       (1)
        /* SLEEPTMR_CLKDIV field */
        #define SLEEPTMR_CLKDIV                              (0x000000F0u)
        #define SLEEPTMR_CLKDIV_MASK                         (0x000000F0u)
        #define SLEEPTMR_CLKDIV_BIT                          (4)
        #define SLEEPTMR_CLKDIV_BITS                         (4)
        /* SLEEPTMR_CLKSEL field */
        #define SLEEPTMR_CLKSEL                              (0x00000001u)
        #define SLEEPTMR_CLKSEL_MASK                         (0x00000001u)
        #define SLEEPTMR_CLKSEL_BIT                          (0)
        #define SLEEPTMR_CLKSEL_BITS                         (1)

#define SLEEPTMR_CNTH                                        *((volatile uint32_t *)0x40006010u)
#define SLEEPTMR_CNTH_REG                                    *((volatile uint32_t *)0x40006010u)
#define SLEEPTMR_CNTH_ADDR                                   (0x40006010u)
#define SLEEPTMR_CNTH_RESET                                  (0x00000000u)
        /* SLEEPTMR_CNTH_FIELD field */
        #define SLEEPTMR_CNTH_FIELD                          (0x0000FFFFu)
        #define SLEEPTMR_CNTH_FIELD_MASK                     (0x0000FFFFu)
        #define SLEEPTMR_CNTH_FIELD_BIT                      (0)
        #define SLEEPTMR_CNTH_FIELD_BITS                     (16)

#define SLEEPTMR_CNTL                                        *((volatile uint32_t *)0x40006014u)
#define SLEEPTMR_CNTL_REG                                    *((volatile uint32_t *)0x40006014u)
#define SLEEPTMR_CNTL_ADDR                                   (0x40006014u)
#define SLEEPTMR_CNTL_RESET                                  (0x00000000u)
        /* SLEEPTMR_CNTL_FIELD field */
        #define SLEEPTMR_CNTL_FIELD                          (0x0000FFFFu)
        #define SLEEPTMR_CNTL_FIELD_MASK                     (0x0000FFFFu)
        #define SLEEPTMR_CNTL_FIELD_BIT                      (0)
        #define SLEEPTMR_CNTL_FIELD_BITS                     (16)

#define SLEEPTMR_CMPAH                                       *((volatile uint32_t *)0x40006018u)
#define SLEEPTMR_CMPAH_REG                                   *((volatile uint32_t *)0x40006018u)
#define SLEEPTMR_CMPAH_ADDR                                  (0x40006018u)
#define SLEEPTMR_CMPAH_RESET                                 (0x0000FFFFu)
        /* SLEEPTMR_CMPAH_FIELD field */
        #define SLEEPTMR_CMPAH_FIELD                         (0x0000FFFFu)
        #define SLEEPTMR_CMPAH_FIELD_MASK                    (0x0000FFFFu)
        #define SLEEPTMR_CMPAH_FIELD_BIT                     (0)
        #define SLEEPTMR_CMPAH_FIELD_BITS                    (16)

#define SLEEPTMR_CMPAL                                       *((volatile uint32_t *)0x4000601Cu)
#define SLEEPTMR_CMPAL_REG                                   *((volatile uint32_t *)0x4000601Cu)
#define SLEEPTMR_CMPAL_ADDR                                  (0x4000601Cu)
#define SLEEPTMR_CMPAL_RESET                                 (0x0000FFFFu)
        /* SLEEPTMR_CMPAL_FIELD field */
        #define SLEEPTMR_CMPAL_FIELD                         (0x0000FFFFu)
        #define SLEEPTMR_CMPAL_FIELD_MASK                    (0x0000FFFFu)
        #define SLEEPTMR_CMPAL_FIELD_BIT                     (0)
        #define SLEEPTMR_CMPAL_FIELD_BITS                    (16)

#define SLEEPTMR_CMPBH                                       *((volatile uint32_t *)0x40006020u)
#define SLEEPTMR_CMPBH_REG                                   *((volatile uint32_t *)0x40006020u)
#define SLEEPTMR_CMPBH_ADDR                                  (0x40006020u)
#define SLEEPTMR_CMPBH_RESET                                 (0x0000FFFFu)
        /* SLEEPTMR_CMPBH_FIELD field */
        #define SLEEPTMR_CMPBH_FIELD                         (0x0000FFFFu)
        #define SLEEPTMR_CMPBH_FIELD_MASK                    (0x0000FFFFu)
        #define SLEEPTMR_CMPBH_FIELD_BIT                     (0)
        #define SLEEPTMR_CMPBH_FIELD_BITS                    (16)

#define SLEEPTMR_CMPBL                                       *((volatile uint32_t *)0x40006024u)
#define SLEEPTMR_CMPBL_REG                                   *((volatile uint32_t *)0x40006024u)
#define SLEEPTMR_CMPBL_ADDR                                  (0x40006024u)
#define SLEEPTMR_CMPBL_RESET                                 (0x0000FFFFu)
        /* SLEEPTMR_CMPBL_FIELD field */
        #define SLEEPTMR_CMPBL_FIELD                         (0x0000FFFFu)
        #define SLEEPTMR_CMPBL_FIELD_MASK                    (0x0000FFFFu)
        #define SLEEPTMR_CMPBL_FIELD_BIT                     (0)
        #define SLEEPTMR_CMPBL_FIELD_BITS                    (16)

/* CAL_ADC block */
#define DATA_CAL_ADC_BASE                                    (0x40007000u)
#define DATA_CAL_ADC_END                                     (0x40007004u)
#define DATA_CAL_ADC_SIZE                                    (DATA_CAL_ADC_END - DATA_CAL_ADC_BASE + 1)

#define CAL_ADC_DATA                                         *((volatile uint32_t *)0x40007000u)
#define CAL_ADC_DATA_REG                                     *((volatile uint32_t *)0x40007000u)
#define CAL_ADC_DATA_ADDR                                    (0x40007000u)
#define CAL_ADC_DATA_RESET                                   (0x00000000u)
        /* CAL_ADC_DATA field */
        #define CAL_ADC_DATA_CAL_ADC_DATA                    (0x0000FFFFu)
        #define CAL_ADC_DATA_CAL_ADC_DATA_MASK               (0x0000FFFFu)
        #define CAL_ADC_DATA_CAL_ADC_DATA_BIT                (0)
        #define CAL_ADC_DATA_CAL_ADC_DATA_BITS               (16)

