contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define CAL_ADC_CONFIG                                       *((volatile uint32_t *)0x40007004u)
#define CAL_ADC_CONFIG_REG                                   *((volatile uint32_t *)0x40007004u)
#define CAL_ADC_CONFIG_ADDR                                  (0x40007004u)
#define CAL_ADC_CONFIG_RESET                                 (0x00000000u)
        /* CAL_ADC_RATE field */
        #define CAL_ADC_CONFIG_CAL_ADC_RATE                  (0x00007000u)
        #define CAL_ADC_CONFIG_CAL_ADC_RATE_MASK             (0x00007000u)
        #define CAL_ADC_CONFIG_CAL_ADC_RATE_BIT              (12)
        #define CAL_ADC_CONFIG_CAL_ADC_RATE_BITS             (3)
        /* CAL_ADC_MUX field */
        #define CAL_ADC_CONFIG_CAL_ADC_MUX                   (0x00000F80u)
        #define CAL_ADC_CONFIG_CAL_ADC_MUX_MASK              (0x00000F80u)
        #define CAL_ADC_CONFIG_CAL_ADC_MUX_BIT               (7)
        #define CAL_ADC_CONFIG_CAL_ADC_MUX_BITS              (5)
        /* CAL_ADC_CLKSEL field */
        #define CAL_ADC_CONFIG_CAL_ADC_CLKSEL                (0x00000004u)
        #define CAL_ADC_CONFIG_CAL_ADC_CLKSEL_MASK           (0x00000004u)
        #define CAL_ADC_CONFIG_CAL_ADC_CLKSEL_BIT            (2)
        #define CAL_ADC_CONFIG_CAL_ADC_CLKSEL_BITS           (1)
        /* CAL_ADC_DITHER_DIS field */
        #define CAL_ADC_CONFIG_CAL_ADC_DITHER_DIS            (0x00000002u)
        #define CAL_ADC_CONFIG_CAL_ADC_DITHER_DIS_MASK       (0x00000002u)
        #define CAL_ADC_CONFIG_CAL_ADC_DITHER_DIS_BIT        (1)
        #define CAL_ADC_CONFIG_CAL_ADC_DITHER_DIS_BITS       (1)
        /* CAL_ADC_EN field */
        #define CAL_ADC_CONFIG_CAL_ADC_EN                    (0x00000001u)
        #define CAL_ADC_CONFIG_CAL_ADC_EN_MASK               (0x00000001u)
        #define CAL_ADC_CONFIG_CAL_ADC_EN_BIT                (0)
        #define CAL_ADC_CONFIG_CAL_ADC_EN_BITS               (1)

/* FLASH_CONTROL block */
#define DATA_FLASH_CONTROL_BASE                              (0x40008000u)
#define DATA_FLASH_CONTROL_END                               (0x40008084u)
#define DATA_FLASH_CONTROL_SIZE                              (DATA_FLASH_CONTROL_END - DATA_FLASH_CONTROL_BASE + 1)

#define FLASH_ACCESS                                         *((volatile uint32_t *)0x40008000u)
#define FLASH_ACCESS_REG                                     *((volatile uint32_t *)0x40008000u)
#define FLASH_ACCESS_ADDR                                    (0x40008000u)
#define FLASH_ACCESS_RESET                                   (0x00000031u)
        /* PREFETCH_STATUS field */
        #define FLASH_ACCESS_PREFETCH_STATUS                 (0x00000020u)
        #define FLASH_ACCESS_PREFETCH_STATUS_MASK            (0x00000020u)
        #define FLASH_ACCESS_PREFETCH_STATUS_BIT             (5)
        #define FLASH_ACCESS_PREFETCH_STATUS_BITS            (1)
        /* PREFETCH_EN field */
        #define FLASH_ACCESS_PREFETCH_EN                     (0x00000010u)
        #define FLASH_ACCESS_PREFETCH_EN_MASK                (0x00000010u)
        #define FLASH_ACCESS_PREFETCH_EN_BIT                 (4)
        #define FLASH_ACCESS_PREFETCH_EN_BITS                (1)
        /* HALFCYCLE_ACCESS field */
        #define FLASH_ACCESS_HALFCYCLE_ACCESS                (0x00000008u)
        #define FLASH_ACCESS_HALFCYCLE_ACCESS_MASK           (0x00000008u)
        #define FLASH_ACCESS_HALFCYCLE_ACCESS_BIT            (3)
        #define FLASH_ACCESS_HALFCYCLE_ACCESS_BITS           (1)
        /* CODE_LATENCY field */
        #define FLASH_ACCESS_CODE_LATENCY                    (0x00000007u)
        #define FLASH_ACCESS_CODE_LATENCY_MASK               (0x00000007u)
        #define FLASH_ACCESS_CODE_LATENCY_BIT                (0)
        #define FLASH_ACCESS_CODE_LATENCY_BITS               (3)

#define FPEC_KEY                                             *((volatile uint32_t *)0x40008004u)
#define FPEC_KEY_REG                                         *((volatile uint32_t *)0x40008004u)
#define FPEC_KEY_ADDR                                        (0x40008004u)
#define FPEC_KEY_RESET                                       (0x00000000u)
        /* FKEYR field */
        #define FPEC_KEY_FKEYR                               (0xFFFFFFFFu)
        #define FPEC_KEY_FKEYR_MASK                          (0xFFFFFFFFu)
        #define FPEC_KEY_FKEYR_BIT                           (0)
        #define FPEC_KEY_FKEYR_BITS                          (32)

#define OPT_KEY                                              *((volatile uint32_t *)0x40008008u)
#define OPT_KEY_REG                                          *((volatile uint32_t *)0x40008008u)
#define OPT_KEY_ADDR                                         (0x40008008u)
#define OPT_KEY_RESET                                        (0x00000000u)
        /* OPTKEYR field */
        #define OPT_KEY_OPTKEYR                              (0xFFFFFFFFu)
        #define OPT_KEY_OPTKEYR_MASK                         (0xFFFFFFFFu)
        #define OPT_KEY_OPTKEYR_BIT                          (0)
        #define OPT_KEY_OPTKEYR_BITS                         (32)

#define FLASH_STATUS                                         *((volatile uint32_t *)0x4000800Cu)
#define FLASH_STATUS_REG                                     *((volatile uint32_t *)0x4000800Cu)
#define FLASH_STATUS_ADDR                                    (0x4000800Cu)
#define FLASH_STATUS_RESET                                   (0x00000000u)
        /* EOP field */
        #define FLASH_STATUS_EOP                             (0x00000020u)
        #define FLASH_STATUS_EOP_MASK                        (0x00000020u)
        #define FLASH_STATUS_EOP_BIT                         (5)
        #define FLASH_STATUS_EOP_BITS                        (1)
        /* WRP_ERR field */
        #define FLASH_STATUS_WRP_ERR                         (0x00000010u)
        #define FLASH_STATUS_WRP_ERR_MASK                    (0x00000010u)
        #define FLASH_STATUS_WRP_ERR_BIT                     (4)
        #define FLASH_STATUS_WRP_ERR_BITS                    (1)
        /* PAGE_PROG_ERR field */
        #define FLASH_STATUS_PAGE_PROG_ERR                   (0x00000008u)
        #define FLASH_STATUS_PAGE_PROG_ERR_MASK              (0x00000008u)
        #define FLASH_STATUS_PAGE_PROG_ERR_BIT               (3)
        #define FLASH_STATUS_PAGE_PROG_ERR_BITS              (1)
        /* PROG_ERR field */
        #define FLASH_STATUS_PROG_ERR                        (0x00000004u)
        #define FLASH_STATUS_PROG_ERR_MASK                   (0x00000004u)
        #define FLASH_STATUS_PROG_ERR_BIT                    (2)
        #define FLASH_STATUS_PROG_ERR_BITS                   (1)
        /* EARLY_BSY field */
        #define FLASH_STATUS_EARLY_BSY                       (0x00000002u)
        #define FLASH_STATUS_EARLY_BSY_MASK                  (0x00000002u)
        #define FLASH_STATUS_EARLY_BSY_BIT                   (1)
        #define FLASH_STATUS_EARLY_BSY_BITS                  (1)
        /* FLA_BSY field */
        #define FLASH_STATUS_FLA_BSY                         (0x00000001u)
        #define FLASH_STATUS_FLA_BSY_MASK                    (0x00000001u)
        #define FLASH_STATUS_FLA_BSY_BIT                     (0)
        #define FLASH_STATUS_FLA_BSY_BITS                    (1)

#define FLASH_CTRL                                           *((volatile uint32_t *)0x40008010u)
#define FLASH_CTRL_REG                                       *((volatile uint32_t *)0x40008010u)
#define FLASH_CTRL_ADDR                                      (0x40008010u)
#define FLASH_CTRL_RESET                                     (0x00000080u)
        /* EOPIE field */
        #define FLASH_CTRL_EOPIE                             (0x00001000u)
        #define FLASH_CTRL_EOPIE_MASK                        (0x00001000u)
        #define FLASH_CTRL_EOPIE_BIT                         (12)
        #define FLASH_CTRL_EOPIE_BITS                        (1)
        /* EARLYBSYIE field */
        #define FLASH_CTRL_EARLYBSYIE                        (0x00000800u)
        #define FLASH_CTRL_EARLYBSYIE_MASK                   (0x00000800u)
        #define FLASH_CTRL_EARLYBSYIE_BIT                    (11)
        #define FLASH_CTRL_EARLYBSYIE_BITS                   (1)
        /* ERRIE field */
        #define FLASH_CTRL_ERRIE                             (0x00000400u)
        #define FLASH_CTRL_ERRIE_MASK                        (0x00000400u)
        #define FLASH_CTRL_ERRIE_BIT                         (10)
        #define FLASH_CTRL_ERRIE_BITS                        (1)
        /* OPTWREN field */
        #define FLASH_CTRL_OPTWREN                           (0x00000200u)
        #define FLASH_CTRL_OPTWREN_MASK                      (0x00000200u)
        #define FLASH_CTRL_OPTWREN_BIT                       (9)
        #define FLASH_CTRL_OPTWREN_BITS                      (1)
        /* FSTPROG field */
        #define FLASH_CTRL_FSTPROG                           (0x00000100u)
        #define FLASH_CTRL_FSTPROG_MASK                      (0x00000100u)
        #define FLASH_CTRL_FSTPROG_BIT                       (8)
        #define FLASH_CTRL_FSTPROG_BITS                      (1)
        /* LOCK field */
        #define FLASH_CTRL_LOCK                              (0x00000080u)
        #define FLASH_CTRL_LOCK_MASK                         (0x00000080u)
        #define FLASH_CTRL_LOCK_BIT                          (7)
        #define FLASH_CTRL_LOCK_BITS                         (1)
        /* FLA_START field */
        #define FLASH_CTRL_FLA_START                         (0x00000040u)
        #define FLASH_CTRL_FLA_START_MASK                    (0x00000040u)
        #define FLASH_CTRL_FLA_START_BIT                     (6)
        #define FLASH_CTRL_FLA_START_BITS                    (1)
        /* OPTERASE field */
        #define FLASH_CTRL_OPTERASE                          (0x00000020u)
        #define FLASH_CTRL_OPTERASE_MASK                     (0x00000020u)
        #define FLASH_CTRL_OPTERASE_BIT                      (5)
        #define FLASH_CTRL_OPTERASE_BITS                     (1)
        /* OPTPROG field */
        #define FLASH_CTRL_OPTPROG                           (0x00000010u)
        #define FLASH_CTRL_OPTPROG_MASK                      (0x00000010u)
        #define FLASH_CTRL_OPTPROG_BIT                       (4)
        #define FLASH_CTRL_OPTPROG_BITS                      (1)
        /* GLOBALERASE field */
        #define FLASH_CTRL_GLOBALERASE                       (0x00000008u)
        #define FLASH_CTRL_GLOBALERASE_MASK                  (0x00000008u)
        #define FLASH_CTRL_GLOBALERASE_BIT                   (3)
        #define FLASH_CTRL_GLOBALERASE_BITS                  (1)
        /* MASSERASE field */
        #define FLASH_CTRL_MASSERASE                         (0x00000004u)
        #define FLASH_CTRL_MASSERASE_MASK                    (0x00000004u)
        #define FLASH_CTRL_MASSERASE_BIT                     (2)
        #define FLASH_CTRL_MASSERASE_BITS                    (1)
        /* PAGEERASE field */
        #define FLASH_CTRL_PAGEERASE                         (0x00000002u)
        #define FLASH_CTRL_PAGEERASE_MASK                    (0x00000002u)
        #define FLASH_CTRL_PAGEERASE_BIT                     (1)
        #define FLASH_CTRL_PAGEERASE_BITS                    (1)
        /* PROG field */
        #define FLASH_CTRL_PROG                              (0x00000001u)
        #define FLASH_CTRL_PROG_MASK                         (0x00000001u)
        #define FLASH_CTRL_PROG_BIT                          (0)
        #define FLASH_CTRL_PROG_BITS                         (1)

