contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define FLASH_ADDR                                           *((volatile uint32_t *)0x40008014u)
#define FLASH_ADDR_REG                                       *((volatile uint32_t *)0x40008014u)
#define FLASH_ADDR_ADDR                                      (0x40008014u)
#define FLASH_ADDR_RESET                                     (0x00000000u)
        /* FAR field */
        #define FLASH_ADDR_FAR                               (0xFFFFFFFFu)
        #define FLASH_ADDR_FAR_MASK                          (0xFFFFFFFFu)
        #define FLASH_ADDR_FAR_BIT                           (0)
        #define FLASH_ADDR_FAR_BITS                          (32)

#define OPT_BYTE                                             *((volatile uint32_t *)0x4000801Cu)
#define OPT_BYTE_REG                                         *((volatile uint32_t *)0x4000801Cu)
#define OPT_BYTE_ADDR                                        (0x4000801Cu)
#define OPT_BYTE_RESET                                       (0xFBFFFFFEu)
        /* RSVD field */
        #define OPT_BYTE_RSVD                                (0xF8000000u)
        #define OPT_BYTE_RSVD_MASK                           (0xF8000000u)
        #define OPT_BYTE_RSVD_BIT                            (27)
        #define OPT_BYTE_RSVD_BITS                           (5)
        /* OBR field */
        #define OPT_BYTE_OBR                                 (0x07FFFFFCu)
        #define OPT_BYTE_OBR_MASK                            (0x07FFFFFCu)
        #define OPT_BYTE_OBR_BIT                             (2)
        #define OPT_BYTE_OBR_BITS                            (25)
        /* RDPROT field */
        #define OPT_BYTE_RDPROT                              (0x00000002u)
        #define OPT_BYTE_RDPROT_MASK                         (0x00000002u)
        #define OPT_BYTE_RDPROT_BIT                          (1)
        #define OPT_BYTE_RDPROT_BITS                         (1)
        /* OPT_ERR field */
        #define OPT_BYTE_OPT_ERR                             (0x00000001u)
        #define OPT_BYTE_OPT_ERR_MASK                        (0x00000001u)
        #define OPT_BYTE_OPT_ERR_BIT                         (0)
        #define OPT_BYTE_OPT_ERR_BITS                        (1)

#define WRPROT                                               *((volatile uint32_t *)0x40008020u)
#define WRPROT_REG                                           *((volatile uint32_t *)0x40008020u)
#define WRPROT_ADDR                                          (0x40008020u)
#define WRPROT_RESET                                         (0xFFFFFFFFu)
        /* WRP field */
        #define WRPROT_WRP                                   (0xFFFFFFFFu)
        #define WRPROT_WRP_MASK                              (0xFFFFFFFFu)
        #define WRPROT_WRP_BIT                               (0)
        #define WRPROT_WRP_BITS                              (32)

#define FLASH_TEST_CTRL                                      *((volatile uint32_t *)0x40008080u)
#define FLASH_TEST_CTRL_REG                                  *((volatile uint32_t *)0x40008080u)
#define FLASH_TEST_CTRL_ADDR                                 (0x40008080u)
#define FLASH_TEST_CTRL_RESET                                (0x00000000u)
        /* TMR field */
        #define FLASH_TEST_CTRL_TMR                          (0x00001000u)
        #define FLASH_TEST_CTRL_TMR_MASK                     (0x00001000u)
        #define FLASH_TEST_CTRL_TMR_BIT                      (12)
        #define FLASH_TEST_CTRL_TMR_BITS                     (1)
        /* ERASE field */
        #define FLASH_TEST_CTRL_ERASE                        (0x00000800u)
        #define FLASH_TEST_CTRL_ERASE_MASK                   (0x00000800u)
        #define FLASH_TEST_CTRL_ERASE_BIT                    (11)
        #define FLASH_TEST_CTRL_ERASE_BITS                   (1)
        /* MAS1 field */
        #define FLASH_TEST_CTRL_MAS1                         (0x00000400u)
        #define FLASH_TEST_CTRL_MAS1_MASK                    (0x00000400u)
        #define FLASH_TEST_CTRL_MAS1_BIT                     (10)
        #define FLASH_TEST_CTRL_MAS1_BITS                    (1)
        /* TEST_PROG field */
        #define FLASH_TEST_CTRL_TEST_PROG                    (0x00000200u)
        #define FLASH_TEST_CTRL_TEST_PROG_MASK               (0x00000200u)
        #define FLASH_TEST_CTRL_TEST_PROG_BIT                (9)
        #define FLASH_TEST_CTRL_TEST_PROG_BITS               (1)
        /* NVSTR field */
        #define FLASH_TEST_CTRL_NVSTR                        (0x00000100u)
        #define FLASH_TEST_CTRL_NVSTR_MASK                   (0x00000100u)
        #define FLASH_TEST_CTRL_NVSTR_BIT                    (8)
        #define FLASH_TEST_CTRL_NVSTR_BITS                   (1)
        /* SE field */
        #define FLASH_TEST_CTRL_SE                           (0x00000080u)
        #define FLASH_TEST_CTRL_SE_MASK                      (0x00000080u)
        #define FLASH_TEST_CTRL_SE_BIT                       (7)
        #define FLASH_TEST_CTRL_SE_BITS                      (1)
        /* IFREN field */
        #define FLASH_TEST_CTRL_IFREN                        (0x00000040u)
        #define FLASH_TEST_CTRL_IFREN_MASK                   (0x00000040u)
        #define FLASH_TEST_CTRL_IFREN_BIT                    (6)
        #define FLASH_TEST_CTRL_IFREN_BITS                   (1)
        /* YE field */
        #define FLASH_TEST_CTRL_YE                           (0x00000020u)
        #define FLASH_TEST_CTRL_YE_MASK                      (0x00000020u)
        #define FLASH_TEST_CTRL_YE_BIT                       (5)
        #define FLASH_TEST_CTRL_YE_BITS                      (1)
        /* XE field */
        #define FLASH_TEST_CTRL_XE                           (0x00000010u)
        #define FLASH_TEST_CTRL_XE_MASK                      (0x00000010u)
        #define FLASH_TEST_CTRL_XE_BIT                       (4)
        #define FLASH_TEST_CTRL_XE_BITS                      (1)
        /* SW_CTRL field */
        #define FLASH_TEST_CTRL_SW_CTRL                      (0x00000008u)
        #define FLASH_TEST_CTRL_SW_CTRL_MASK                 (0x00000008u)
        #define FLASH_TEST_CTRL_SW_CTRL_BIT                  (3)
        #define FLASH_TEST_CTRL_SW_CTRL_BITS                 (1)
        /* SW field */
        #define FLASH_TEST_CTRL_SW                           (0x00000006u)
        #define FLASH_TEST_CTRL_SW_MASK                      (0x00000006u)
        #define FLASH_TEST_CTRL_SW_BIT                       (1)
        #define FLASH_TEST_CTRL_SW_BITS                      (2)
        /* SW_EN field */
        #define FLASH_TEST_CTRL_SW_EN                        (0x00000001u)
        #define FLASH_TEST_CTRL_SW_EN_MASK                   (0x00000001u)
        #define FLASH_TEST_CTRL_SW_EN_BIT                    (0)
        #define FLASH_TEST_CTRL_SW_EN_BITS                   (1)

#define FLASH_DATA0                                          *((volatile uint32_t *)0x40008084u)
#define FLASH_DATA0_REG                                      *((volatile uint32_t *)0x40008084u)
#define FLASH_DATA0_ADDR                                     (0x40008084u)
#define FLASH_DATA0_RESET                                    (0xFFFFFFFFu)
        /* FDR0 field */
        #define FLASH_DATA0_FDR0                             (0xFFFFFFFFu)
        #define FLASH_DATA0_FDR0_MASK                        (0xFFFFFFFFu)
        #define FLASH_DATA0_FDR0_BIT                         (0)
        #define FLASH_DATA0_FDR0_BITS                        (32)

/* EMU_REGS block */
#define DATA_EMU_REGS_BASE                                   (0x40009000u)
#define DATA_EMU_REGS_END                                    (0x40009000u)
#define DATA_EMU_REGS_SIZE                                   (DATA_EMU_REGS_END - DATA_EMU_REGS_BASE + 1)

#define I_AM_AN_EMULATOR                                     *((volatile uint32_t *)0x40009000u)
#define I_AM_AN_EMULATOR_REG                                 *((volatile uint32_t *)0x40009000u)
#define I_AM_AN_EMULATOR_ADDR                                (0x40009000u)
#define I_AM_AN_EMULATOR_RESET                               (0x00000000u)
        /* I_AM_AN_EMULATOR field */
        #define I_AM_AN_EMULATOR_I_AM_AN_EMULATOR            (0x00000001u)
        #define I_AM_AN_EMULATOR_I_AM_AN_EMULATOR_MASK       (0x00000001u)
        #define I_AM_AN_EMULATOR_I_AM_AN_EMULATOR_BIT        (0)
        #define I_AM_AN_EMULATOR_I_AM_AN_EMULATOR_BITS       (1)

