contiki-os/contiki/cpu/arm/stm32l152/regs.h
/* INTERRUPTS block */
#define BLOCK_INTERRUPTS_BASE                                (0x4000A000u)
#define BLOCK_INTERRUPTS_END                                 (0x4000A86Cu)
#define BLOCK_INTERRUPTS_SIZE                                (BLOCK_INTERRUPTS_END - BLOCK_INTERRUPTS_BASE + 1)

#define MAC_RX_INT_SRC                                       *((volatile uint32_t *)0x4000A000u)
#define MAC_RX_INT_SRC_REG                                   *((volatile uint32_t *)0x4000A000u)
#define MAC_RX_INT_SRC_ADDR                                  (0x4000A000u)
#define MAC_RX_INT_SRC_RESET                                 (0x00000000u)
        /* TX_B_ACK_ERR_SRC field */
        #define MAC_RX_INT_SRC_TX_B_ACK_ERR_SRC              (0x00008000u)
        #define MAC_RX_INT_SRC_TX_B_ACK_ERR_SRC_MASK         (0x00008000u)
        #define MAC_RX_INT_SRC_TX_B_ACK_ERR_SRC_BIT          (15)
        #define MAC_RX_INT_SRC_TX_B_ACK_ERR_SRC_BITS         (1)
        /* TX_A_ACK_ERR_SRC field */
        #define MAC_RX_INT_SRC_TX_A_ACK_ERR_SRC              (0x00004000u)
        #define MAC_RX_INT_SRC_TX_A_ACK_ERR_SRC_MASK         (0x00004000u)
        #define MAC_RX_INT_SRC_TX_A_ACK_ERR_SRC_BIT          (14)
        #define MAC_RX_INT_SRC_TX_A_ACK_ERR_SRC_BITS         (1)
        /* RX_OVFLW_SRC field */
        #define MAC_RX_INT_SRC_RX_OVFLW_SRC                  (0x00002000u)
        #define MAC_RX_INT_SRC_RX_OVFLW_SRC_MASK             (0x00002000u)
        #define MAC_RX_INT_SRC_RX_OVFLW_SRC_BIT              (13)
        #define MAC_RX_INT_SRC_RX_OVFLW_SRC_BITS             (1)
        /* RX_ERROR_SRC field */
        #define MAC_RX_INT_SRC_RX_ERROR_SRC                  (0x00001000u)
        #define MAC_RX_INT_SRC_RX_ERROR_SRC_MASK             (0x00001000u)
        #define MAC_RX_INT_SRC_RX_ERROR_SRC_BIT              (12)
        #define MAC_RX_INT_SRC_RX_ERROR_SRC_BITS             (1)
        /* BB_RX_LEN_ERR_SRC field */
        #define MAC_RX_INT_SRC_BB_RX_LEN_ERR_SRC             (0x00000800u)
        #define MAC_RX_INT_SRC_BB_RX_LEN_ERR_SRC_MASK        (0x00000800u)
        #define MAC_RX_INT_SRC_BB_RX_LEN_ERR_SRC_BIT         (11)
        #define MAC_RX_INT_SRC_BB_RX_LEN_ERR_SRC_BITS        (1)
        /* TX_COLL_RX_SRC field */
        #define MAC_RX_INT_SRC_TX_COLL_RX_SRC                (0x00000400u)
        #define MAC_RX_INT_SRC_TX_COLL_RX_SRC_MASK           (0x00000400u)
        #define MAC_RX_INT_SRC_TX_COLL_RX_SRC_BIT            (10)
        #define MAC_RX_INT_SRC_TX_COLL_RX_SRC_BITS           (1)
        /* RSSI_INST_MEAS_SRC field */
        #define MAC_RX_INT_SRC_RSSI_INST_MEAS_SRC            (0x00000200u)
        #define MAC_RX_INT_SRC_RSSI_INST_MEAS_SRC_MASK       (0x00000200u)
        #define MAC_RX_INT_SRC_RSSI_INST_MEAS_SRC_BIT        (9)
        #define MAC_RX_INT_SRC_RSSI_INST_MEAS_SRC_BITS       (1)
        /* TX_B_ACK_SRC field */
        #define MAC_RX_INT_SRC_TX_B_ACK_SRC                  (0x00000100u)
        #define MAC_RX_INT_SRC_TX_B_ACK_SRC_MASK             (0x00000100u)
        #define MAC_RX_INT_SRC_TX_B_ACK_SRC_BIT              (8)
        #define MAC_RX_INT_SRC_TX_B_ACK_SRC_BITS             (1)
        /* TX_A_ACK_SRC field */
        #define MAC_RX_INT_SRC_TX_A_ACK_SRC                  (0x00000080u)
        #define MAC_RX_INT_SRC_TX_A_ACK_SRC_MASK             (0x00000080u)
        #define MAC_RX_INT_SRC_TX_A_ACK_SRC_BIT              (7)
        #define MAC_RX_INT_SRC_TX_A_ACK_SRC_BITS             (1)
        /* RX_B_UNLOAD_COMP_SRC field */
        #define MAC_RX_INT_SRC_RX_B_UNLOAD_COMP_SRC          (0x00000040u)
        #define MAC_RX_INT_SRC_RX_B_UNLOAD_COMP_SRC_MASK     (0x00000040u)
        #define MAC_RX_INT_SRC_RX_B_UNLOAD_COMP_SRC_BIT      (6)
        #define MAC_RX_INT_SRC_RX_B_UNLOAD_COMP_SRC_BITS     (1)
        /* RX_A_UNLOAD_COMP_SRC field */
        #define MAC_RX_INT_SRC_RX_A_UNLOAD_COMP_SRC          (0x00000020u)
        #define MAC_RX_INT_SRC_RX_A_UNLOAD_COMP_SRC_MASK     (0x00000020u)
        #define MAC_RX_INT_SRC_RX_A_UNLOAD_COMP_SRC_BIT      (5)
        #define MAC_RX_INT_SRC_RX_A_UNLOAD_COMP_SRC_BITS     (1)
        /* RX_B_ADDR_REC_SRC field */
        #define MAC_RX_INT_SRC_RX_B_ADDR_REC_SRC             (0x00000010u)
        #define MAC_RX_INT_SRC_RX_B_ADDR_REC_SRC_MASK        (0x00000010u)
        #define MAC_RX_INT_SRC_RX_B_ADDR_REC_SRC_BIT         (4)
        #define MAC_RX_INT_SRC_RX_B_ADDR_REC_SRC_BITS        (1)
        /* RX_A_ADDR_REC_SRC field */
        #define MAC_RX_INT_SRC_RX_A_ADDR_REC_SRC             (0x00000008u)
        #define MAC_RX_INT_SRC_RX_A_ADDR_REC_SRC_MASK        (0x00000008u)
        #define MAC_RX_INT_SRC_RX_A_ADDR_REC_SRC_BIT         (3)
        #define MAC_RX_INT_SRC_RX_A_ADDR_REC_SRC_BITS        (1)
        /* RX_B_FILT_COMP_SRC field */
        #define MAC_RX_INT_SRC_RX_B_FILT_COMP_SRC            (0x00000004u)
        #define MAC_RX_INT_SRC_RX_B_FILT_COMP_SRC_MASK       (0x00000004u)
        #define MAC_RX_INT_SRC_RX_B_FILT_COMP_SRC_BIT        (2)
        #define MAC_RX_INT_SRC_RX_B_FILT_COMP_SRC_BITS       (1)
        /* RX_A_FILT_COMP_SRC field */
        #define MAC_RX_INT_SRC_RX_A_FILT_COMP_SRC            (0x00000002u)
        #define MAC_RX_INT_SRC_RX_A_FILT_COMP_SRC_MASK       (0x00000002u)
        #define MAC_RX_INT_SRC_RX_A_FILT_COMP_SRC_BIT        (1)
        #define MAC_RX_INT_SRC_RX_A_FILT_COMP_SRC_BITS       (1)
        /* RX_FRAME_SRC field */
        #define MAC_RX_INT_SRC_RX_FRAME_SRC                  (0x00000001u)
        #define MAC_RX_INT_SRC_RX_FRAME_SRC_MASK             (0x00000001u)
        #define MAC_RX_INT_SRC_RX_FRAME_SRC_BIT              (0)
        #define MAC_RX_INT_SRC_RX_FRAME_SRC_BITS             (1)

#define MAC_TX_INT_SRC                                       *((volatile uint32_t *)0x4000A004u)
#define MAC_TX_INT_SRC_REG                                   *((volatile uint32_t *)0x4000A004u)
#define MAC_TX_INT_SRC_ADDR                                  (0x4000A004u)
#define MAC_TX_INT_SRC_RESET                                 (0x00000000u)
        /* RX_B_ACK_SRC field */
        #define MAC_TX_INT_SRC_RX_B_ACK_SRC                  (0x00000800u)
        #define MAC_TX_INT_SRC_RX_B_ACK_SRC_MASK             (0x00000800u)
        #define MAC_TX_INT_SRC_RX_B_ACK_SRC_BIT              (11)
        #define MAC_TX_INT_SRC_RX_B_ACK_SRC_BITS             (1)
        /* RX_A_ACK_SRC field */
        #define MAC_TX_INT_SRC_RX_A_ACK_SRC                  (0x00000400u)
        #define MAC_TX_INT_SRC_RX_A_ACK_SRC_MASK             (0x00000400u)
        #define MAC_TX_INT_SRC_RX_A_ACK_SRC_BIT              (10)
        #define MAC_TX_INT_SRC_RX_A_ACK_SRC_BITS             (1)
        /* TX_B_UNLOAD_SRC field */
        #define MAC_TX_INT_SRC_TX_B_UNLOAD_SRC               (0x00000200u)
        #define MAC_TX_INT_SRC_TX_B_UNLOAD_SRC_MASK          (0x00000200u)
        #define MAC_TX_INT_SRC_TX_B_UNLOAD_SRC_BIT           (9)
        #define MAC_TX_INT_SRC_TX_B_UNLOAD_SRC_BITS          (1)
        /* TX_A_UNLOAD_SRC field */
        #define MAC_TX_INT_SRC_TX_A_UNLOAD_SRC               (0x00000100u)
        #define MAC_TX_INT_SRC_TX_A_UNLOAD_SRC_MASK          (0x00000100u)
        #define MAC_TX_INT_SRC_TX_A_UNLOAD_SRC_BIT           (8)
        #define MAC_TX_INT_SRC_TX_A_UNLOAD_SRC_BITS          (1)
        /* ACK_EXPIRED_SRC field */
        #define MAC_TX_INT_SRC_ACK_EXPIRED_SRC               (0x00000080u)
        #define MAC_TX_INT_SRC_ACK_EXPIRED_SRC_MASK          (0x00000080u)
        #define MAC_TX_INT_SRC_ACK_EXPIRED_SRC_BIT           (7)
        #define MAC_TX_INT_SRC_ACK_EXPIRED_SRC_BITS          (1)
        /* TX_LOCK_FAIL_SRC field */
        #define MAC_TX_INT_SRC_TX_LOCK_FAIL_SRC              (0x00000040u)
        #define MAC_TX_INT_SRC_TX_LOCK_FAIL_SRC_MASK         (0x00000040u)
        #define MAC_TX_INT_SRC_TX_LOCK_FAIL_SRC_BIT          (6)
        #define MAC_TX_INT_SRC_TX_LOCK_FAIL_SRC_BITS         (1)
        /* TX_UNDERFLOW_SRC field */
        #define MAC_TX_INT_SRC_TX_UNDERFLOW_SRC              (0x00000020u)
        #define MAC_TX_INT_SRC_TX_UNDERFLOW_SRC_MASK         (0x00000020u)
        #define MAC_TX_INT_SRC_TX_UNDERFLOW_SRC_BIT          (5)
        #define MAC_TX_INT_SRC_TX_UNDERFLOW_SRC_BITS         (1)
        /* CCA_FAIL_SRC field */
        #define MAC_TX_INT_SRC_CCA_FAIL_SRC                  (0x00000010u)
        #define MAC_TX_INT_SRC_CCA_FAIL_SRC_MASK             (0x00000010u)
        #define MAC_TX_INT_SRC_CCA_FAIL_SRC_BIT              (4)
        #define MAC_TX_INT_SRC_CCA_FAIL_SRC_BITS             (1)
        /* SFD_SENT_SRC field */
        #define MAC_TX_INT_SRC_SFD_SENT_SRC                  (0x00000008u)
        #define MAC_TX_INT_SRC_SFD_SENT_SRC_MASK             (0x00000008u)
        #define MAC_TX_INT_SRC_SFD_SENT_SRC_BIT              (3)
        #define MAC_TX_INT_SRC_SFD_SENT_SRC_BITS             (1)
        /* BO_COMPLETE_SRC field */
        #define MAC_TX_INT_SRC_BO_COMPLETE_SRC               (0x00000004u)
        #define MAC_TX_INT_SRC_BO_COMPLETE_SRC_MASK          (0x00000004u)
        #define MAC_TX_INT_SRC_BO_COMPLETE_SRC_BIT           (2)
        #define MAC_TX_INT_SRC_BO_COMPLETE_SRC_BITS          (1)
        /* RX_ACK_SRC field */
        #define MAC_TX_INT_SRC_RX_ACK_SRC                    (0x00000002u)
        #define MAC_TX_INT_SRC_RX_ACK_SRC_MASK               (0x00000002u)
        #define MAC_TX_INT_SRC_RX_ACK_SRC_BIT                (1)
        #define MAC_TX_INT_SRC_RX_ACK_SRC_BITS               (1)
        /* TX_COMPLETE_SRC field */
        #define MAC_TX_INT_SRC_TX_COMPLETE_SRC               (0x00000001u)
        #define MAC_TX_INT_SRC_TX_COMPLETE_SRC_MASK          (0x00000001u)
        #define MAC_TX_INT_SRC_TX_COMPLETE_SRC_BIT           (0)
        #define MAC_TX_INT_SRC_TX_COMPLETE_SRC_BITS          (1)

#define MAC_TIMER_INT_SRC                                    *((volatile uint32_t *)0x4000A008u)
#define MAC_TIMER_INT_SRC_REG                                *((volatile uint32_t *)0x4000A008u)
#define MAC_TIMER_INT_SRC_ADDR                               (0x4000A008u)
#define MAC_TIMER_INT_SRC_RESET                              (0x00000000u)
        /* TIMER_COMP_B_SRC field */
        #define MAC_TIMER_INT_SRC_TIMER_COMP_B_SRC           (0x00000004u)
        #define MAC_TIMER_INT_SRC_TIMER_COMP_B_SRC_MASK      (0x00000004u)
        #define MAC_TIMER_INT_SRC_TIMER_COMP_B_SRC_BIT       (2)
        #define MAC_TIMER_INT_SRC_TIMER_COMP_B_SRC_BITS      (1)
        /* TIMER_COMP_A_SRC field */
        #define MAC_TIMER_INT_SRC_TIMER_COMP_A_SRC           (0x00000002u)
        #define MAC_TIMER_INT_SRC_TIMER_COMP_A_SRC_MASK      (0x00000002u)
        #define MAC_TIMER_INT_SRC_TIMER_COMP_A_SRC_BIT       (1)
        #define MAC_TIMER_INT_SRC_TIMER_COMP_A_SRC_BITS      (1)
        /* TIMER_WRAP_SRC field */
        #define MAC_TIMER_INT_SRC_TIMER_WRAP_SRC             (0x00000001u)
        #define MAC_TIMER_INT_SRC_TIMER_WRAP_SRC_MASK        (0x00000001u)
        #define MAC_TIMER_INT_SRC_TIMER_WRAP_SRC_BIT         (0)
        #define MAC_TIMER_INT_SRC_TIMER_WRAP_SRC_BITS        (1)

