contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define BB_INT_SRC                                           *((volatile uint32_t *)0x4000A00Cu)
#define BB_INT_SRC_REG                                       *((volatile uint32_t *)0x4000A00Cu)
#define BB_INT_SRC_ADDR                                      (0x4000A00Cu)
#define BB_INT_SRC_RESET                                     (0x00000000u)
        /* RSSI_INT_SRC field */
        #define BB_INT_SRC_RSSI_INT_SRC                      (0x00000002u)
        #define BB_INT_SRC_RSSI_INT_SRC_MASK                 (0x00000002u)
        #define BB_INT_SRC_RSSI_INT_SRC_BIT                  (1)
        #define BB_INT_SRC_RSSI_INT_SRC_BITS                 (1)
        /* BASEBAND_INT_SRC field */
        #define BB_INT_SRC_BASEBAND_INT_SRC                  (0x00000001u)
        #define BB_INT_SRC_BASEBAND_INT_SRC_MASK             (0x00000001u)
        #define BB_INT_SRC_BASEBAND_INT_SRC_BIT              (0)
        #define BB_INT_SRC_BASEBAND_INT_SRC_BITS             (1)

#define SEC_INT_SRC                                          *((volatile uint32_t *)0x4000A010u)
#define SEC_INT_SRC_REG                                      *((volatile uint32_t *)0x4000A010u)
#define SEC_INT_SRC_ADDR                                     (0x4000A010u)
#define SEC_INT_SRC_RESET                                    (0x00000000u)
        /* CT_WORD_VALID_SRC field */
        #define SEC_INT_SRC_CT_WORD_VALID_SRC                (0x00000004u)
        #define SEC_INT_SRC_CT_WORD_VALID_SRC_MASK           (0x00000004u)
        #define SEC_INT_SRC_CT_WORD_VALID_SRC_BIT            (2)
        #define SEC_INT_SRC_CT_WORD_VALID_SRC_BITS           (1)
        /* PT_WORD_REQ_SRC field */
        #define SEC_INT_SRC_PT_WORD_REQ_SRC                  (0x00000002u)
        #define SEC_INT_SRC_PT_WORD_REQ_SRC_MASK             (0x00000002u)
        #define SEC_INT_SRC_PT_WORD_REQ_SRC_BIT              (1)
        #define SEC_INT_SRC_PT_WORD_REQ_SRC_BITS             (1)
        /* ENC_COMPLETE_SRC field */
        #define SEC_INT_SRC_ENC_COMPLETE_SRC                 (0x00000001u)
        #define SEC_INT_SRC_ENC_COMPLETE_SRC_MASK            (0x00000001u)
        #define SEC_INT_SRC_ENC_COMPLETE_SRC_BIT             (0)
        #define SEC_INT_SRC_ENC_COMPLETE_SRC_BITS            (1)

#define INT_SLEEPTMRFLAG                                     *((volatile uint32_t *)0x4000A014u)
#define INT_SLEEPTMRFLAG_REG                                 *((volatile uint32_t *)0x4000A014u)
#define INT_SLEEPTMRFLAG_ADDR                                (0x4000A014u)
#define INT_SLEEPTMRFLAG_RESET                               (0x00000000u)
        /* INT_SLEEPTMRCMPB field */
        #define INT_SLEEPTMRCMPB                             (0x00000004u)
        #define INT_SLEEPTMRCMPB_MASK                        (0x00000004u)
        #define INT_SLEEPTMRCMPB_BIT                         (2)
        #define INT_SLEEPTMRCMPB_BITS                        (1)
        /* INT_SLEEPTMRCMPA field */
        #define INT_SLEEPTMRCMPA                             (0x00000002u)
        #define INT_SLEEPTMRCMPA_MASK                        (0x00000002u)
        #define INT_SLEEPTMRCMPA_BIT                         (1)
        #define INT_SLEEPTMRCMPA_BITS                        (1)
        /* INT_SLEEPTMRWRAP field */
        #define INT_SLEEPTMRWRAP                             (0x00000001u)
        #define INT_SLEEPTMRWRAP_MASK                        (0x00000001u)
        #define INT_SLEEPTMRWRAP_BIT                         (0)
        #define INT_SLEEPTMRWRAP_BITS                        (1)

#define INT_MGMTFLAG                                         *((volatile uint32_t *)0x4000A018u)
#define INT_MGMTFLAG_REG                                     *((volatile uint32_t *)0x4000A018u)
#define INT_MGMTFLAG_ADDR                                    (0x4000A018u)
#define INT_MGMTFLAG_RESET                                   (0x00000000u)
        /* INT_MGMTDMAPROT field */
        #define INT_MGMTDMAPROT                              (0x00000010u)
        #define INT_MGMTDMAPROT_MASK                         (0x00000010u)
        #define INT_MGMTDMAPROT_BIT                          (4)
        #define INT_MGMTDMAPROT_BITS                         (1)
        /* INT_MGMTCALADC field */
        #define INT_MGMTCALADC                               (0x00000008u)
        #define INT_MGMTCALADC_MASK                          (0x00000008u)
        #define INT_MGMTCALADC_BIT                           (3)
        #define INT_MGMTCALADC_BITS                          (1)
        /* INT_MGMTFPEC field */
        #define INT_MGMTFPEC                                 (0x00000004u)
        #define INT_MGMTFPEC_MASK                            (0x00000004u)
        #define INT_MGMTFPEC_BIT                             (2)
        #define INT_MGMTFPEC_BITS                            (1)
        /* INT_MGMTOSC24MHI field */
        #define INT_MGMTOSC24MHI                             (0x00000002u)
        #define INT_MGMTOSC24MHI_MASK                        (0x00000002u)
        #define INT_MGMTOSC24MHI_BIT                         (1)
        #define INT_MGMTOSC24MHI_BITS                        (1)
        /* INT_MGMTOSC24MLO field */
        #define INT_MGMTOSC24MLO                             (0x00000001u)
        #define INT_MGMTOSC24MLO_MASK                        (0x00000001u)
        #define INT_MGMTOSC24MLO_BIT                         (0)
        #define INT_MGMTOSC24MLO_BITS                        (1)

#define INT_NMIFLAG                                          *((volatile uint32_t *)0x4000A01Cu)
#define INT_NMIFLAG_REG                                      *((volatile uint32_t *)0x4000A01Cu)
#define INT_NMIFLAG_ADDR                                     (0x4000A01Cu)
#define INT_NMIFLAG_RESET                                    (0x00000000u)
        /* INT_NMICLK24M field */
        #define INT_NMICLK24M                                (0x00000002u)
        #define INT_NMICLK24M_MASK                           (0x00000002u)
        #define INT_NMICLK24M_BIT                            (1)
        #define INT_NMICLK24M_BITS                           (1)
        /* INT_NMIWDOG field */
        #define INT_NMIWDOG                                  (0x00000001u)
        #define INT_NMIWDOG_MASK                             (0x00000001u)
        #define INT_NMIWDOG_BIT                              (0)
        #define INT_NMIWDOG_BITS                             (1)

