contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define INT_SLEEPTMRFORCE                                    *((volatile uint32_t *)0x4000A020u)
#define INT_SLEEPTMRFORCE_REG                                *((volatile uint32_t *)0x4000A020u)
#define INT_SLEEPTMRFORCE_ADDR                               (0x4000A020u)
#define INT_SLEEPTMRFORCE_RESET                              (0x00000000u)
        /* INT_SLEEPTMRCMPB field */
        #define INT_SLEEPTMRCMPB                             (0x00000004u)
        #define INT_SLEEPTMRCMPB_MASK                        (0x00000004u)
        #define INT_SLEEPTMRCMPB_BIT                         (2)
        #define INT_SLEEPTMRCMPB_BITS                        (1)
        /* INT_SLEEPTMRCMPA field */
        #define INT_SLEEPTMRCMPA                             (0x00000002u)
        #define INT_SLEEPTMRCMPA_MASK                        (0x00000002u)
        #define INT_SLEEPTMRCMPA_BIT                         (1)
        #define INT_SLEEPTMRCMPA_BITS                        (1)
        /* INT_SLEEPTMRWRAP field */
        #define INT_SLEEPTMRWRAP                             (0x00000001u)
        #define INT_SLEEPTMRWRAP_MASK                        (0x00000001u)
        #define INT_SLEEPTMRWRAP_BIT                         (0)
        #define INT_SLEEPTMRWRAP_BITS                        (1)

#define TEST_FORCE_ALL_INT                                   *((volatile uint32_t *)0x4000A024u)
#define TEST_FORCE_ALL_INT_REG                               *((volatile uint32_t *)0x4000A024u)
#define TEST_FORCE_ALL_INT_ADDR                              (0x4000A024u)
#define TEST_FORCE_ALL_INT_RESET                             (0x00000000u)
        /* FORCE_ALL_INT field */
        #define TEST_FORCE_ALL_INT_FORCE_ALL_INT             (0x00000001u)
        #define TEST_FORCE_ALL_INT_FORCE_ALL_INT_MASK        (0x00000001u)
        #define TEST_FORCE_ALL_INT_FORCE_ALL_INT_BIT         (0)
        #define TEST_FORCE_ALL_INT_FORCE_ALL_INT_BITS        (1)

#define MAC_RX_INT_MASK                                      *((volatile uint32_t *)0x4000A040u)
#define MAC_RX_INT_MASK_REG                                  *((volatile uint32_t *)0x4000A040u)
#define MAC_RX_INT_MASK_ADDR                                 (0x4000A040u)
#define MAC_RX_INT_MASK_RESET                                (0x00000000u)
        /* TX_B_ACK_ERR_MSK field */
        #define MAC_RX_INT_MASK_TX_B_ACK_ERR_MSK             (0x00008000u)
        #define MAC_RX_INT_MASK_TX_B_ACK_ERR_MSK_MASK        (0x00008000u)
        #define MAC_RX_INT_MASK_TX_B_ACK_ERR_MSK_BIT         (15)
        #define MAC_RX_INT_MASK_TX_B_ACK_ERR_MSK_BITS        (1)
        /* TX_A_ACK_ERR_MSK field */
        #define MAC_RX_INT_MASK_TX_A_ACK_ERR_MSK             (0x00004000u)
        #define MAC_RX_INT_MASK_TX_A_ACK_ERR_MSK_MASK        (0x00004000u)
        #define MAC_RX_INT_MASK_TX_A_ACK_ERR_MSK_BIT         (14)
        #define MAC_RX_INT_MASK_TX_A_ACK_ERR_MSK_BITS        (1)
        /* RX_OVFLW_MSK field */
        #define MAC_RX_INT_MASK_RX_OVFLW_MSK                 (0x00002000u)
        #define MAC_RX_INT_MASK_RX_OVFLW_MSK_MASK            (0x00002000u)
        #define MAC_RX_INT_MASK_RX_OVFLW_MSK_BIT             (13)
        #define MAC_RX_INT_MASK_RX_OVFLW_MSK_BITS            (1)
        /* RX_ERROR_MSK field */
        #define MAC_RX_INT_MASK_RX_ERROR_MSK                 (0x00001000u)
        #define MAC_RX_INT_MASK_RX_ERROR_MSK_MASK            (0x00001000u)
        #define MAC_RX_INT_MASK_RX_ERROR_MSK_BIT             (12)
        #define MAC_RX_INT_MASK_RX_ERROR_MSK_BITS            (1)
        /* BB_RX_LEN_ERR_MSK field */
        #define MAC_RX_INT_MASK_BB_RX_LEN_ERR_MSK            (0x00000800u)
        #define MAC_RX_INT_MASK_BB_RX_LEN_ERR_MSK_MASK       (0x00000800u)
        #define MAC_RX_INT_MASK_BB_RX_LEN_ERR_MSK_BIT        (11)
        #define MAC_RX_INT_MASK_BB_RX_LEN_ERR_MSK_BITS       (1)
        /* TX_COLL_RX_MSK field */
        #define MAC_RX_INT_MASK_TX_COLL_RX_MSK               (0x00000400u)
        #define MAC_RX_INT_MASK_TX_COLL_RX_MSK_MASK          (0x00000400u)
        #define MAC_RX_INT_MASK_TX_COLL_RX_MSK_BIT           (10)
        #define MAC_RX_INT_MASK_TX_COLL_RX_MSK_BITS          (1)
        /* RSSI_INST_MEAS_MSK field */
        #define MAC_RX_INT_MASK_RSSI_INST_MEAS_MSK           (0x00000200u)
        #define MAC_RX_INT_MASK_RSSI_INST_MEAS_MSK_MASK      (0x00000200u)
        #define MAC_RX_INT_MASK_RSSI_INST_MEAS_MSK_BIT       (9)
        #define MAC_RX_INT_MASK_RSSI_INST_MEAS_MSK_BITS      (1)
        /* TX_B_ACK_MSK field */
        #define MAC_RX_INT_MASK_TX_B_ACK_MSK                 (0x00000100u)
        #define MAC_RX_INT_MASK_TX_B_ACK_MSK_MASK            (0x00000100u)
        #define MAC_RX_INT_MASK_TX_B_ACK_MSK_BIT             (8)
        #define MAC_RX_INT_MASK_TX_B_ACK_MSK_BITS            (1)
        /* TX_A_ACK_MSK field */
        #define MAC_RX_INT_MASK_TX_A_ACK_MSK                 (0x00000080u)
        #define MAC_RX_INT_MASK_TX_A_ACK_MSK_MASK            (0x00000080u)
        #define MAC_RX_INT_MASK_TX_A_ACK_MSK_BIT             (7)
        #define MAC_RX_INT_MASK_TX_A_ACK_MSK_BITS            (1)
        /* RX_B_UNLOAD_COMP_MSK field */
        #define MAC_RX_INT_MASK_RX_B_UNLOAD_COMP_MSK         (0x00000040u)
        #define MAC_RX_INT_MASK_RX_B_UNLOAD_COMP_MSK_MASK    (0x00000040u)
        #define MAC_RX_INT_MASK_RX_B_UNLOAD_COMP_MSK_BIT     (6)
        #define MAC_RX_INT_MASK_RX_B_UNLOAD_COMP_MSK_BITS    (1)
        /* RX_A_UNLOAD_COMP_MSK field */
        #define MAC_RX_INT_MASK_RX_A_UNLOAD_COMP_MSK         (0x00000020u)
        #define MAC_RX_INT_MASK_RX_A_UNLOAD_COMP_MSK_MASK    (0x00000020u)
        #define MAC_RX_INT_MASK_RX_A_UNLOAD_COMP_MSK_BIT     (5)
        #define MAC_RX_INT_MASK_RX_A_UNLOAD_COMP_MSK_BITS    (1)
        /* RX_B_ADDR_REC_MSK field */
        #define MAC_RX_INT_MASK_RX_B_ADDR_REC_MSK            (0x00000010u)
        #define MAC_RX_INT_MASK_RX_B_ADDR_REC_MSK_MASK       (0x00000010u)
        #define MAC_RX_INT_MASK_RX_B_ADDR_REC_MSK_BIT        (4)
        #define MAC_RX_INT_MASK_RX_B_ADDR_REC_MSK_BITS       (1)
        /* RX_A_ADDR_REC_MSK field */
        #define MAC_RX_INT_MASK_RX_A_ADDR_REC_MSK            (0x00000008u)
        #define MAC_RX_INT_MASK_RX_A_ADDR_REC_MSK_MASK       (0x00000008u)
        #define MAC_RX_INT_MASK_RX_A_ADDR_REC_MSK_BIT        (3)
        #define MAC_RX_INT_MASK_RX_A_ADDR_REC_MSK_BITS       (1)
        /* RX_B_FILT_COMP_MSK field */
        #define MAC_RX_INT_MASK_RX_B_FILT_COMP_MSK           (0x00000004u)
        #define MAC_RX_INT_MASK_RX_B_FILT_COMP_MSK_MASK      (0x00000004u)
        #define MAC_RX_INT_MASK_RX_B_FILT_COMP_MSK_BIT       (2)
        #define MAC_RX_INT_MASK_RX_B_FILT_COMP_MSK_BITS      (1)
        /* RX_A_FILT_COMP_MSK field */
        #define MAC_RX_INT_MASK_RX_A_FILT_COMP_MSK           (0x00000002u)
        #define MAC_RX_INT_MASK_RX_A_FILT_COMP_MSK_MASK      (0x00000002u)
        #define MAC_RX_INT_MASK_RX_A_FILT_COMP_MSK_BIT       (1)
        #define MAC_RX_INT_MASK_RX_A_FILT_COMP_MSK_BITS      (1)
        /* RX_FRAME_MSK field */
        #define MAC_RX_INT_MASK_RX_FRAME_MSK                 (0x00000001u)
        #define MAC_RX_INT_MASK_RX_FRAME_MSK_MASK            (0x00000001u)
        #define MAC_RX_INT_MASK_RX_FRAME_MSK_BIT             (0)
        #define MAC_RX_INT_MASK_RX_FRAME_MSK_BITS            (1)

