contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define MAC_TX_INT_MASK                                      *((volatile uint32_t *)0x4000A044u)
#define MAC_TX_INT_MASK_REG                                  *((volatile uint32_t *)0x4000A044u)
#define MAC_TX_INT_MASK_ADDR                                 (0x4000A044u)
#define MAC_TX_INT_MASK_RESET                                (0x00000000u)
        /* RX_B_ACK_MSK field */
        #define MAC_TX_INT_MASK_RX_B_ACK_MSK                 (0x00000800u)
        #define MAC_TX_INT_MASK_RX_B_ACK_MSK_MASK            (0x00000800u)
        #define MAC_TX_INT_MASK_RX_B_ACK_MSK_BIT             (11)
        #define MAC_TX_INT_MASK_RX_B_ACK_MSK_BITS            (1)
        /* RX_A_ACK_MSK field */
        #define MAC_TX_INT_MASK_RX_A_ACK_MSK                 (0x00000400u)
        #define MAC_TX_INT_MASK_RX_A_ACK_MSK_MASK            (0x00000400u)
        #define MAC_TX_INT_MASK_RX_A_ACK_MSK_BIT             (10)
        #define MAC_TX_INT_MASK_RX_A_ACK_MSK_BITS            (1)
        /* TX_B_UNLOAD_MSK field */
        #define MAC_TX_INT_MASK_TX_B_UNLOAD_MSK              (0x00000200u)
        #define MAC_TX_INT_MASK_TX_B_UNLOAD_MSK_MASK         (0x00000200u)
        #define MAC_TX_INT_MASK_TX_B_UNLOAD_MSK_BIT          (9)
        #define MAC_TX_INT_MASK_TX_B_UNLOAD_MSK_BITS         (1)
        /* TX_A_UNLOAD_MSK field */
        #define MAC_TX_INT_MASK_TX_A_UNLOAD_MSK              (0x00000100u)
        #define MAC_TX_INT_MASK_TX_A_UNLOAD_MSK_MASK         (0x00000100u)
        #define MAC_TX_INT_MASK_TX_A_UNLOAD_MSK_BIT          (8)
        #define MAC_TX_INT_MASK_TX_A_UNLOAD_MSK_BITS         (1)
        /* ACK_EXPIRED_MSK field */
        #define MAC_TX_INT_MASK_ACK_EXPIRED_MSK              (0x00000080u)
        #define MAC_TX_INT_MASK_ACK_EXPIRED_MSK_MASK         (0x00000080u)
        #define MAC_TX_INT_MASK_ACK_EXPIRED_MSK_BIT          (7)
        #define MAC_TX_INT_MASK_ACK_EXPIRED_MSK_BITS         (1)
        /* TX_LOCK_FAIL_MSK field */
        #define MAC_TX_INT_MASK_TX_LOCK_FAIL_MSK             (0x00000040u)
        #define MAC_TX_INT_MASK_TX_LOCK_FAIL_MSK_MASK        (0x00000040u)
        #define MAC_TX_INT_MASK_TX_LOCK_FAIL_MSK_BIT         (6)
        #define MAC_TX_INT_MASK_TX_LOCK_FAIL_MSK_BITS        (1)
        /* TX_UNDERFLOW_MSK field */
        #define MAC_TX_INT_MASK_TX_UNDERFLOW_MSK             (0x00000020u)
        #define MAC_TX_INT_MASK_TX_UNDERFLOW_MSK_MASK        (0x00000020u)
        #define MAC_TX_INT_MASK_TX_UNDERFLOW_MSK_BIT         (5)
        #define MAC_TX_INT_MASK_TX_UNDERFLOW_MSK_BITS        (1)
        /* CCA_FAIL_MSK field */
        #define MAC_TX_INT_MASK_CCA_FAIL_MSK                 (0x00000010u)
        #define MAC_TX_INT_MASK_CCA_FAIL_MSK_MASK            (0x00000010u)
        #define MAC_TX_INT_MASK_CCA_FAIL_MSK_BIT             (4)
        #define MAC_TX_INT_MASK_CCA_FAIL_MSK_BITS            (1)
        /* SFD_SENT_MSK field */
        #define MAC_TX_INT_MASK_SFD_SENT_MSK                 (0x00000008u)
        #define MAC_TX_INT_MASK_SFD_SENT_MSK_MASK            (0x00000008u)
        #define MAC_TX_INT_MASK_SFD_SENT_MSK_BIT             (3)
        #define MAC_TX_INT_MASK_SFD_SENT_MSK_BITS            (1)
        /* BO_COMPLETE_MSK field */
        #define MAC_TX_INT_MASK_BO_COMPLETE_MSK              (0x00000004u)
        #define MAC_TX_INT_MASK_BO_COMPLETE_MSK_MASK         (0x00000004u)
        #define MAC_TX_INT_MASK_BO_COMPLETE_MSK_BIT          (2)
        #define MAC_TX_INT_MASK_BO_COMPLETE_MSK_BITS         (1)
        /* RX_ACK_MSK field */
        #define MAC_TX_INT_MASK_RX_ACK_MSK                   (0x00000002u)
        #define MAC_TX_INT_MASK_RX_ACK_MSK_MASK              (0x00000002u)
        #define MAC_TX_INT_MASK_RX_ACK_MSK_BIT               (1)
        #define MAC_TX_INT_MASK_RX_ACK_MSK_BITS              (1)
        /* TX_COMPLETE_MSK field */
        #define MAC_TX_INT_MASK_TX_COMPLETE_MSK              (0x00000001u)
        #define MAC_TX_INT_MASK_TX_COMPLETE_MSK_MASK         (0x00000001u)
        #define MAC_TX_INT_MASK_TX_COMPLETE_MSK_BIT          (0)
        #define MAC_TX_INT_MASK_TX_COMPLETE_MSK_BITS         (1)

#define MAC_TIMER_INT_MASK                                   *((volatile uint32_t *)0x4000A048u)
#define MAC_TIMER_INT_MASK_REG                               *((volatile uint32_t *)0x4000A048u)
#define MAC_TIMER_INT_MASK_ADDR                              (0x4000A048u)
#define MAC_TIMER_INT_MASK_RESET                             (0x00000000u)
        /* TIMER_COMP_B_MSK field */
        #define MAC_TIMER_INT_MASK_TIMER_COMP_B_MSK          (0x00000004u)
        #define MAC_TIMER_INT_MASK_TIMER_COMP_B_MSK_MASK     (0x00000004u)
        #define MAC_TIMER_INT_MASK_TIMER_COMP_B_MSK_BIT      (2)
        #define MAC_TIMER_INT_MASK_TIMER_COMP_B_MSK_BITS     (1)
        /* TIMER_COMP_A_MSK field */
        #define MAC_TIMER_INT_MASK_TIMER_COMP_A_MSK          (0x00000002u)
        #define MAC_TIMER_INT_MASK_TIMER_COMP_A_MSK_MASK     (0x00000002u)
        #define MAC_TIMER_INT_MASK_TIMER_COMP_A_MSK_BIT      (1)
        #define MAC_TIMER_INT_MASK_TIMER_COMP_A_MSK_BITS     (1)
        /* TIMER_WRAP_MSK field */
        #define MAC_TIMER_INT_MASK_TIMER_WRAP_MSK            (0x00000001u)
        #define MAC_TIMER_INT_MASK_TIMER_WRAP_MSK_MASK       (0x00000001u)
        #define MAC_TIMER_INT_MASK_TIMER_WRAP_MSK_BIT        (0)
        #define MAC_TIMER_INT_MASK_TIMER_WRAP_MSK_BITS       (1)

#define BB_INT_MASK                                          *((volatile uint32_t *)0x4000A04Cu)
#define BB_INT_MASK_REG                                      *((volatile uint32_t *)0x4000A04Cu)
#define BB_INT_MASK_ADDR                                     (0x4000A04Cu)
#define BB_INT_MASK_RESET                                    (0x00000000u)
        /* RSSI_INT_MSK field */
        #define BB_INT_MASK_RSSI_INT_MSK                     (0x00000002u)
        #define BB_INT_MASK_RSSI_INT_MSK_MASK                (0x00000002u)
        #define BB_INT_MASK_RSSI_INT_MSK_BIT                 (1)
        #define BB_INT_MASK_RSSI_INT_MSK_BITS                (1)
        /* BASEBAND_INT_MSK field */
        #define BB_INT_MASK_BASEBAND_INT_MSK                 (0x00000001u)
        #define BB_INT_MASK_BASEBAND_INT_MSK_MASK            (0x00000001u)
        #define BB_INT_MASK_BASEBAND_INT_MSK_BIT             (0)
        #define BB_INT_MASK_BASEBAND_INT_MSK_BITS            (1)

