contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define GPIO_PCWAKE                                          *((volatile uint32_t *)0x4000BC10u)
#define GPIO_PCWAKE_REG                                      *((volatile uint32_t *)0x4000BC10u)
#define GPIO_PCWAKE_ADDR                                     (0x4000BC10u)
#define GPIO_PCWAKE_RESET                                    (0x00000000u)
        /* PC7 field */
        #define PC7                                          (0x00000080u)
        #define PC7_MASK                                     (0x00000080u)
        #define PC7_BIT                                      (7)
        #define PC7_BITS                                     (1)
        /* PC6 field */
        #define PC6                                          (0x00000040u)
        #define PC6_MASK                                     (0x00000040u)
        #define PC6_BIT                                      (6)
        #define PC6_BITS                                     (1)
        /* PC5 field */
        #define PC5                                          (0x00000020u)
        #define PC5_MASK                                     (0x00000020u)
        #define PC5_BIT                                      (5)
        #define PC5_BITS                                     (1)
        /* PC4 field */
        #define PC4                                          (0x00000010u)
        #define PC4_MASK                                     (0x00000010u)
        #define PC4_BIT                                      (4)
        #define PC4_BITS                                     (1)
        /* PC3 field */
        #define PC3                                          (0x00000008u)
        #define PC3_MASK                                     (0x00000008u)
        #define PC3_BIT                                      (3)
        #define PC3_BITS                                     (1)
        /* PC2 field */
        #define PC2                                          (0x00000004u)
        #define PC2_MASK                                     (0x00000004u)
        #define PC2_BIT                                      (2)
        #define PC2_BITS                                     (1)
        /* PC1 field */
        #define PC1                                          (0x00000002u)
        #define PC1_MASK                                     (0x00000002u)
        #define PC1_BIT                                      (1)
        #define PC1_BITS                                     (1)
        /* PC0 field */
        #define PC0                                          (0x00000001u)
        #define PC0_MASK                                     (0x00000001u)
        #define PC0_BIT                                      (0)
        #define PC0_BITS                                     (1)

#define GPIO_IRQCSEL                                         *((volatile uint32_t *)0x4000BC14u)
#define GPIO_IRQCSEL_REG                                     *((volatile uint32_t *)0x4000BC14u)
#define GPIO_IRQCSEL_ADDR                                    (0x4000BC14u)
#define GPIO_IRQCSEL_RESET                                   (0x0000000Fu)
        /* SEL_GPIO field */
        #define SEL_GPIO                                     (0x0000001Fu)
        #define SEL_GPIO_MASK                                (0x0000001Fu)
        #define SEL_GPIO_BIT                                 (0)
        #define SEL_GPIO_BITS                                (5)

#define GPIO_IRQDSEL                                         *((volatile uint32_t *)0x4000BC18u)
#define GPIO_IRQDSEL_REG                                     *((volatile uint32_t *)0x4000BC18u)
#define GPIO_IRQDSEL_ADDR                                    (0x4000BC18u)
#define GPIO_IRQDSEL_RESET                                   (0x00000010u)
        /* SEL_GPIO field */
        #define SEL_GPIO                                     (0x0000001Fu)
        #define SEL_GPIO_MASK                                (0x0000001Fu)
        #define SEL_GPIO_BIT                                 (0)
        #define SEL_GPIO_BITS                                (5)

#define GPIO_WAKEFILT                                        *((volatile uint32_t *)0x4000BC1Cu)
#define GPIO_WAKEFILT_REG                                    *((volatile uint32_t *)0x4000BC1Cu)
#define GPIO_WAKEFILT_ADDR                                   (0x4000BC1Cu)
#define GPIO_WAKEFILT_RESET                                  (0x00000000u)
        /* IRQD_WAKE_FILTER field */
        #define IRQD_WAKE_FILTER                             (0x00000008u)
        #define IRQD_WAKE_FILTER_MASK                        (0x00000008u)
        #define IRQD_WAKE_FILTER_BIT                         (3)
        #define IRQD_WAKE_FILTER_BITS                        (1)
        /* SC2_WAKE_FILTER field */
        #define SC2_WAKE_FILTER                              (0x00000004u)
        #define SC2_WAKE_FILTER_MASK                         (0x00000004u)
        #define SC2_WAKE_FILTER_BIT                          (2)
        #define SC2_WAKE_FILTER_BITS                         (1)
        /* SC1_WAKE_FILTER field */
        #define SC1_WAKE_FILTER                              (0x00000002u)
        #define SC1_WAKE_FILTER_MASK                         (0x00000002u)
        #define SC1_WAKE_FILTER_BIT                          (1)
        #define SC1_WAKE_FILTER_BITS                         (1)
        /* GPIO_WAKE_FILTER field */
        #define GPIO_WAKE_FILTER                             (0x00000001u)
        #define GPIO_WAKE_FILTER_MASK                        (0x00000001u)
        #define GPIO_WAKE_FILTER_BIT                         (0)
        #define GPIO_WAKE_FILTER_BITS                        (1)

/* SERIAL block */
#define BLOCK_SERIAL_BASE                                    (0x4000C000u)
#define BLOCK_SERIAL_END                                     (0x4000C870u)
#define BLOCK_SERIAL_SIZE                                    (BLOCK_SERIAL_END - BLOCK_SERIAL_BASE + 1)

#define SC2_RXBEGA                                           *((volatile uint32_t *)0x4000C000u)
#define SC2_RXBEGA_REG                                       *((volatile uint32_t *)0x4000C000u)
#define SC2_RXBEGA_ADDR                                      (0x4000C000u)
#define SC2_RXBEGA_RESET                                     (0x20000000u)
        /* FIXED field */
        #define SC2_RXBEGA_FIXED                             (0xFFFFE000u)
        #define SC2_RXBEGA_FIXED_MASK                        (0xFFFFE000u)
        #define SC2_RXBEGA_FIXED_BIT                         (13)
        #define SC2_RXBEGA_FIXED_BITS                        (19)
        /* SC_RXBEGA field */
        #define SC_RXBEGA                                    (0x00001FFFu)
        #define SC_RXBEGA_MASK                               (0x00001FFFu)
        #define SC_RXBEGA_BIT                                (0)
        #define SC_RXBEGA_BITS                               (13)

#define SC2_RXENDA                                           *((volatile uint32_t *)0x4000C004u)
#define SC2_RXENDA_REG                                       *((volatile uint32_t *)0x4000C004u)
#define SC2_RXENDA_ADDR                                      (0x4000C004u)
#define SC2_RXENDA_RESET                                     (0x20000000u)
        /* FIXED field */
        #define SC2_RXENDA_FIXED                             (0xFFFFE000u)
        #define SC2_RXENDA_FIXED_MASK                        (0xFFFFE000u)
        #define SC2_RXENDA_FIXED_BIT                         (13)
        #define SC2_RXENDA_FIXED_BITS                        (19)
        /* SC_RXENDA field */
        #define SC_RXENDA                                    (0x00001FFFu)
        #define SC_RXENDA_MASK                               (0x00001FFFu)
        #define SC_RXENDA_BIT                                (0)
        #define SC_RXENDA_BITS                               (13)

#define SC2_RXBEGB                                           *((volatile uint32_t *)0x4000C008u)
#define SC2_RXBEGB_REG                                       *((volatile uint32_t *)0x4000C008u)
#define SC2_RXBEGB_ADDR                                      (0x4000C008u)
#define SC2_RXBEGB_RESET                                     (0x20000000u)
        /* FIXED field */
        #define SC2_RXBEGB_FIXED                             (0xFFFFE000u)
        #define SC2_RXBEGB_FIXED_MASK                        (0xFFFFE000u)
        #define SC2_RXBEGB_FIXED_BIT                         (13)
        #define SC2_RXBEGB_FIXED_BITS                        (19)
        /* SC_RXBEGB field */
        #define SC_RXBEGB                                    (0x00001FFFu)
        #define SC_RXBEGB_MASK                               (0x00001FFFu)
        #define SC_RXBEGB_BIT                                (0)
        #define SC_RXBEGB_BITS                               (13)

#define SC2_RXENDB                                           *((volatile uint32_t *)0x4000C00Cu)
#define SC2_RXENDB_REG                                       *((volatile uint32_t *)0x4000C00Cu)
#define SC2_RXENDB_ADDR                                      (0x4000C00Cu)
#define SC2_RXENDB_RESET                                     (0x20000000u)
        /* FIXED field */
        #define SC2_RXENDB_FIXED                             (0xFFFFE000u)
        #define SC2_RXENDB_FIXED_MASK                        (0xFFFFE000u)
        #define SC2_RXENDB_FIXED_BIT                         (13)
        #define SC2_RXENDB_FIXED_BITS                        (19)
        /* SC_RXENDB field */
        #define SC_RXENDB                                    (0x00001FFFu)
        #define SC_RXENDB_MASK                               (0x00001FFFu)
        #define SC_RXENDB_BIT                                (0)
        #define SC_RXENDB_BITS                               (13)

#define SC2_TXBEGA                                           *((volatile uint32_t *)0x4000C010u)
#define SC2_TXBEGA_REG                                       *((volatile uint32_t *)0x4000C010u)
#define SC2_TXBEGA_ADDR                                      (0x4000C010u)
#define SC2_TXBEGA_RESET                                     (0x20000000u)
        /* FIXED field */
        #define SC2_TXBEGA_FIXED                             (0xFFFFE000u)
        #define SC2_TXBEGA_FIXED_MASK                        (0xFFFFE000u)
        #define SC2_TXBEGA_FIXED_BIT                         (13)
        #define SC2_TXBEGA_FIXED_BITS                        (19)
        /* SC_TXBEGA field */
        #define SC_TXBEGA                                    (0x00001FFFu)
        #define SC_TXBEGA_MASK                               (0x00001FFFu)
        #define SC_TXBEGA_BIT                                (0)
        #define SC_TXBEGA_BITS                               (13)

#define SC2_TXENDA                                           *((volatile uint32_t *)0x4000C014u)
#define SC2_TXENDA_REG                                       *((volatile uint32_t *)0x4000C014u)
#define SC2_TXENDA_ADDR                                      (0x4000C014u)
#define SC2_TXENDA_RESET                                     (0x20000000u)
        /* FIXED field */
        #define SC2_TXENDA_FIXED                             (0xFFFFE000u)
        #define SC2_TXENDA_FIXED_MASK                        (0xFFFFE000u)
        #define SC2_TXENDA_FIXED_BIT                         (13)
        #define SC2_TXENDA_FIXED_BITS                        (19)
        /* SC_TXENDA field */
        #define SC_TXENDA                                    (0x00001FFFu)
        #define SC_TXENDA_MASK                               (0x00001FFFu)
        #define SC_TXENDA_BIT                                (0)
        #define SC_TXENDA_BITS                               (13)

