contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define SC2_TXBEGB                                           *((volatile uint32_t *)0x4000C018u)
#define SC2_TXBEGB_REG                                       *((volatile uint32_t *)0x4000C018u)
#define SC2_TXBEGB_ADDR                                      (0x4000C018u)
#define SC2_TXBEGB_RESET                                     (0x20000000u)
        /* FIXED field */
        #define SC2_TXBEGB_FIXED                             (0xFFFFE000u)
        #define SC2_TXBEGB_FIXED_MASK                        (0xFFFFE000u)
        #define SC2_TXBEGB_FIXED_BIT                         (13)
        #define SC2_TXBEGB_FIXED_BITS                        (19)
        /* SC_TXBEGB field */
        #define SC_TXBEGB                                    (0x00001FFFu)
        #define SC_TXBEGB_MASK                               (0x00001FFFu)
        #define SC_TXBEGB_BIT                                (0)
        #define SC_TXBEGB_BITS                               (13)

#define SC2_TXENDB                                           *((volatile uint32_t *)0x4000C01Cu)
#define SC2_TXENDB_REG                                       *((volatile uint32_t *)0x4000C01Cu)
#define SC2_TXENDB_ADDR                                      (0x4000C01Cu)
#define SC2_TXENDB_RESET                                     (0x20000000u)
        /* FIXED field */
        #define SC2_TXENDB_FIXED                             (0xFFFFE000u)
        #define SC2_TXENDB_FIXED_MASK                        (0xFFFFE000u)
        #define SC2_TXENDB_FIXED_BIT                         (13)
        #define SC2_TXENDB_FIXED_BITS                        (19)
        /* SC_TXENDB field */
        #define SC_TXENDB                                    (0x00001FFFu)
        #define SC_TXENDB_MASK                               (0x00001FFFu)
        #define SC_TXENDB_BIT                                (0)
        #define SC_TXENDB_BITS                               (13)

#define SC2_RXCNTA                                           *((volatile uint32_t *)0x4000C020u)
#define SC2_RXCNTA_REG                                       *((volatile uint32_t *)0x4000C020u)
#define SC2_RXCNTA_ADDR                                      (0x4000C020u)
#define SC2_RXCNTA_RESET                                     (0x00000000u)
        /* SC_RXCNTA field */
        #define SC_RXCNTA                                    (0x00001FFFu)
        #define SC_RXCNTA_MASK                               (0x00001FFFu)
        #define SC_RXCNTA_BIT                                (0)
        #define SC_RXCNTA_BITS                               (13)

#define SC2_RXCNTB                                           *((volatile uint32_t *)0x4000C024u)
#define SC2_RXCNTB_REG                                       *((volatile uint32_t *)0x4000C024u)
#define SC2_RXCNTB_ADDR                                      (0x4000C024u)
#define SC2_RXCNTB_RESET                                     (0x00000000u)
        /* SC_RXCNTB field */
        #define SC_RXCNTB                                    (0x00001FFFu)
        #define SC_RXCNTB_MASK                               (0x00001FFFu)
        #define SC_RXCNTB_BIT                                (0)
        #define SC_RXCNTB_BITS                               (13)

#define SC2_TXCNT                                            *((volatile uint32_t *)0x4000C028u)
#define SC2_TXCNT_REG                                        *((volatile uint32_t *)0x4000C028u)
#define SC2_TXCNT_ADDR                                       (0x4000C028u)
#define SC2_TXCNT_RESET                                      (0x00000000u)
        /* SC_TXCNT field */
        #define SC_TXCNT                                     (0x00001FFFu)
        #define SC_TXCNT_MASK                                (0x00001FFFu)
        #define SC_TXCNT_BIT                                 (0)
        #define SC_TXCNT_BITS                                (13)

#define SC2_DMASTAT                                          *((volatile uint32_t *)0x4000C02Cu)
#define SC2_DMASTAT_REG                                      *((volatile uint32_t *)0x4000C02Cu)
#define SC2_DMASTAT_ADDR                                     (0x4000C02Cu)
#define SC2_DMASTAT_RESET                                    (0x00000000u)
        /* SC_RXSSEL field */
        #define SC_RXSSEL                                    (0x00001C00u)
        #define SC_RXSSEL_MASK                               (0x00001C00u)
        #define SC_RXSSEL_BIT                                (10)
        #define SC_RXSSEL_BITS                               (3)
        /* SC_RXOVFB field */
        #define SC_RXOVFB                                    (0x00000020u)
        #define SC_RXOVFB_MASK                               (0x00000020u)
        #define SC_RXOVFB_BIT                                (5)
        #define SC_RXOVFB_BITS                               (1)
        /* SC_RXOVFA field */
        #define SC_RXOVFA                                    (0x00000010u)
        #define SC_RXOVFA_MASK                               (0x00000010u)
        #define SC_RXOVFA_BIT                                (4)
        #define SC_RXOVFA_BITS                               (1)
        /* SC_TXACTB field */
        #define SC_TXACTB                                    (0x00000008u)
        #define SC_TXACTB_MASK                               (0x00000008u)
        #define SC_TXACTB_BIT                                (3)
        #define SC_TXACTB_BITS                               (1)
        /* SC_TXACTA field */
        #define SC_TXACTA                                    (0x00000004u)
        #define SC_TXACTA_MASK                               (0x00000004u)
        #define SC_TXACTA_BIT                                (2)
        #define SC_TXACTA_BITS                               (1)
        /* SC_RXACTB field */
        #define SC_RXACTB                                    (0x00000002u)
        #define SC_RXACTB_MASK                               (0x00000002u)
        #define SC_RXACTB_BIT                                (1)
        #define SC_RXACTB_BITS                               (1)
        /* SC_RXACTA field */
        #define SC_RXACTA                                    (0x00000001u)
        #define SC_RXACTA_MASK                               (0x00000001u)
        #define SC_RXACTA_BIT                                (0)
        #define SC_RXACTA_BITS                               (1)

