contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define SC2_TWICTRL2                                         *((volatile uint32_t *)0x4000C050u)
#define SC2_TWICTRL2_REG                                     *((volatile uint32_t *)0x4000C050u)
#define SC2_TWICTRL2_ADDR                                    (0x4000C050u)
#define SC2_TWICTRL2_RESET                                   (0x00000000u)
        /* SC_TWIACK field */
        #define SC_TWIACK                                    (0x00000001u)
        #define SC_TWIACK_MASK                               (0x00000001u)
        #define SC_TWIACK_BIT                                (0)
        #define SC_TWIACK_BITS                               (1)

#define SC2_MODE                                             *((volatile uint32_t *)0x4000C054u)
#define SC2_MODE_REG                                         *((volatile uint32_t *)0x4000C054u)
#define SC2_MODE_ADDR                                        (0x4000C054u)
#define SC2_MODE_RESET                                       (0x00000000u)
        /* SC_MODE field */
        #define SC_MODE                                      (0x00000003u)
        #define SC_MODE_MASK                                 (0x00000003u)
        #define SC_MODE_BIT                                  (0)
        #define SC_MODE_BITS                                 (2)
                /* SC_MODE Bit Field Values */
                #define SC2_MODE_DISABLED                    (0)
                #define SC2_MODE_SPI                         (2)
                #define SC2_MODE_I2C                         (3)

#define SC2_SPICFG                                           *((volatile uint32_t *)0x4000C058u)
#define SC2_SPICFG_REG                                       *((volatile uint32_t *)0x4000C058u)
#define SC2_SPICFG_ADDR                                      (0x4000C058u)
#define SC2_SPICFG_RESET                                     (0x00000000u)
        /* SC_SPIRXDRV field */
        #define SC_SPIRXDRV                                  (0x00000020u)
        #define SC_SPIRXDRV_MASK                             (0x00000020u)
        #define SC_SPIRXDRV_BIT                              (5)
        #define SC_SPIRXDRV_BITS                             (1)
        /* SC_SPIMST field */
        #define SC_SPIMST                                    (0x00000010u)
        #define SC_SPIMST_MASK                               (0x00000010u)
        #define SC_SPIMST_BIT                                (4)
        #define SC_SPIMST_BITS                               (1)
        /* SC_SPIRPT field */
        #define SC_SPIRPT                                    (0x00000008u)
        #define SC_SPIRPT_MASK                               (0x00000008u)
        #define SC_SPIRPT_BIT                                (3)
        #define SC_SPIRPT_BITS                               (1)
        /* SC_SPIORD field */
        #define SC_SPIORD                                    (0x00000004u)
        #define SC_SPIORD_MASK                               (0x00000004u)
        #define SC_SPIORD_BIT                                (2)
        #define SC_SPIORD_BITS                               (1)
        /* SC_SPIPHA field */
        #define SC_SPIPHA                                    (0x00000002u)
        #define SC_SPIPHA_MASK                               (0x00000002u)
        #define SC_SPIPHA_BIT                                (1)
        #define SC_SPIPHA_BITS                               (1)
        /* SC_SPIPOL field */
        #define SC_SPIPOL                                    (0x00000001u)
        #define SC_SPIPOL_MASK                               (0x00000001u)
        #define SC_SPIPOL_BIT                                (0)
        #define SC_SPIPOL_BITS                               (1)

#define SC2_RATELIN                                          *((volatile uint32_t *)0x4000C060u)
#define SC2_RATELIN_REG                                      *((volatile uint32_t *)0x4000C060u)
#define SC2_RATELIN_ADDR                                     (0x4000C060u)
#define SC2_RATELIN_RESET                                    (0x00000000u)
        /* SC_RATELIN field */
        #define SC_RATELIN                                   (0x0000000Fu)
        #define SC_RATELIN_MASK                              (0x0000000Fu)
        #define SC_RATELIN_BIT                               (0)
        #define SC_RATELIN_BITS                              (4)

#define SC2_RATEEXP                                          *((volatile uint32_t *)0x4000C064u)
#define SC2_RATEEXP_REG                                      *((volatile uint32_t *)0x4000C064u)
#define SC2_RATEEXP_ADDR                                     (0x4000C064u)
#define SC2_RATEEXP_RESET                                    (0x00000000u)
        /* SC_RATEEXP field */
        #define SC_RATEEXP                                   (0x0000000Fu)
        #define SC_RATEEXP_MASK                              (0x0000000Fu)
        #define SC_RATEEXP_BIT                               (0)
        #define SC_RATEEXP_BITS                              (4)

#define SC2_RXCNTSAVED                                       *((volatile uint32_t *)0x4000C070u)
#define SC2_RXCNTSAVED_REG                                   *((volatile uint32_t *)0x4000C070u)
#define SC2_RXCNTSAVED_ADDR                                  (0x4000C070u)
#define SC2_RXCNTSAVED_RESET                                 (0x00000000u)
        /* SC_RXCNTSAVED field */
        #define SC_RXCNTSAVED                                (0x00001FFFu)
        #define SC_RXCNTSAVED_MASK                           (0x00001FFFu)
        #define SC_RXCNTSAVED_BIT                            (0)
        #define SC_RXCNTSAVED_BITS                           (13)

#define SC1_RXBEGA                                           *((volatile uint32_t *)0x4000C800u)
#define SC1_RXBEGA_REG                                       *((volatile uint32_t *)0x4000C800u)
#define SC1_RXBEGA_ADDR                                      (0x4000C800u)
#define SC1_RXBEGA_RESET                                     (0x20000000u)
        /* FIXED field */
        #define SC1_RXBEGA_FIXED                             (0xFFFFE000u)
        #define SC1_RXBEGA_FIXED_MASK                        (0xFFFFE000u)
        #define SC1_RXBEGA_FIXED_BIT                         (13)
        #define SC1_RXBEGA_FIXED_BITS                        (19)
        /* SC_RXBEGA field */
        #define SC_RXBEGA                                    (0x00001FFFu)
        #define SC_RXBEGA_MASK                               (0x00001FFFu)
        #define SC_RXBEGA_BIT                                (0)
        #define SC_RXBEGA_BITS                               (13)

#define SC1_RXENDA                                           *((volatile uint32_t *)0x4000C804u)
#define SC1_RXENDA_REG                                       *((volatile uint32_t *)0x4000C804u)
#define SC1_RXENDA_ADDR                                      (0x4000C804u)
#define SC1_RXENDA_RESET                                     (0x20000000u)
        /* FIXED field */
        #define SC1_RXENDA_FIXED                             (0xFFFFE000u)
        #define SC1_RXENDA_FIXED_MASK                        (0xFFFFE000u)
        #define SC1_RXENDA_FIXED_BIT                         (13)
        #define SC1_RXENDA_FIXED_BITS                        (19)
        /* SC_RXENDA field */
        #define SC_RXENDA                                    (0x00001FFFu)
        #define SC_RXENDA_MASK                               (0x00001FFFu)
        #define SC_RXENDA_BIT                                (0)
        #define SC_RXENDA_BITS                               (13)

