contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define SC1_RXBEGB                                           *((volatile uint32_t *)0x4000C808u)
#define SC1_RXBEGB_REG                                       *((volatile uint32_t *)0x4000C808u)
#define SC1_RXBEGB_ADDR                                      (0x4000C808u)
#define SC1_RXBEGB_RESET                                     (0x20000000u)
        /* FIXED field */
        #define SC1_RXBEGB_FIXED                             (0xFFFFE000u)
        #define SC1_RXBEGB_FIXED_MASK                        (0xFFFFE000u)
        #define SC1_RXBEGB_FIXED_BIT                         (13)
        #define SC1_RXBEGB_FIXED_BITS                        (19)
        /* SC_RXBEGB field */
        #define SC_RXBEGB                                    (0x00001FFFu)
        #define SC_RXBEGB_MASK                               (0x00001FFFu)
        #define SC_RXBEGB_BIT                                (0)
        #define SC_RXBEGB_BITS                               (13)

#define SC1_RXENDB                                           *((volatile uint32_t *)0x4000C80Cu)
#define SC1_RXENDB_REG                                       *((volatile uint32_t *)0x4000C80Cu)
#define SC1_RXENDB_ADDR                                      (0x4000C80Cu)
#define SC1_RXENDB_RESET                                     (0x20000000u)
        /* FIXED field */
        #define SC1_RXENDB_FIXED                             (0xFFFFE000u)
        #define SC1_RXENDB_FIXED_MASK                        (0xFFFFE000u)
        #define SC1_RXENDB_FIXED_BIT                         (13)
        #define SC1_RXENDB_FIXED_BITS                        (19)
        /* SC_RXENDB field */
        #define SC_RXENDB                                    (0x00001FFFu)
        #define SC_RXENDB_MASK                               (0x00001FFFu)
        #define SC_RXENDB_BIT                                (0)
        #define SC_RXENDB_BITS                               (13)

#define SC1_TXBEGA                                           *((volatile uint32_t *)0x4000C810u)
#define SC1_TXBEGA_REG                                       *((volatile uint32_t *)0x4000C810u)
#define SC1_TXBEGA_ADDR                                      (0x4000C810u)
#define SC1_TXBEGA_RESET                                     (0x20000000u)
        /* FIXED field */
        #define SC1_TXBEGA_FIXED                             (0xFFFFE000u)
        #define SC1_TXBEGA_FIXED_MASK                        (0xFFFFE000u)
        #define SC1_TXBEGA_FIXED_BIT                         (13)
        #define SC1_TXBEGA_FIXED_BITS                        (19)
        /* SC_TXBEGA field */
        #define SC_TXBEGA                                    (0x00001FFFu)
        #define SC_TXBEGA_MASK                               (0x00001FFFu)
        #define SC_TXBEGA_BIT                                (0)
        #define SC_TXBEGA_BITS                               (13)

#define SC1_TXENDA                                           *((volatile uint32_t *)0x4000C814u)
#define SC1_TXENDA_REG                                       *((volatile uint32_t *)0x4000C814u)
#define SC1_TXENDA_ADDR                                      (0x4000C814u)
#define SC1_TXENDA_RESET                                     (0x20000000u)
        /* FIXED field */
        #define SC1_TXENDA_FIXED                             (0xFFFFE000u)
        #define SC1_TXENDA_FIXED_MASK                        (0xFFFFE000u)
        #define SC1_TXENDA_FIXED_BIT                         (13)
        #define SC1_TXENDA_FIXED_BITS                        (19)
        /* SC_TXENDA field */
        #define SC_TXENDA                                    (0x00001FFFu)
        #define SC_TXENDA_MASK                               (0x00001FFFu)
        #define SC_TXENDA_BIT                                (0)
        #define SC_TXENDA_BITS                               (13)

#define SC1_TXBEGB                                           *((volatile uint32_t *)0x4000C818u)
#define SC1_TXBEGB_REG                                       *((volatile uint32_t *)0x4000C818u)
#define SC1_TXBEGB_ADDR                                      (0x4000C818u)
#define SC1_TXBEGB_RESET                                     (0x20000000u)
        /* FIXED field */
        #define SC1_TXBEGB_FIXED                             (0xFFFFE000u)
        #define SC1_TXBEGB_FIXED_MASK                        (0xFFFFE000u)
        #define SC1_TXBEGB_FIXED_BIT                         (13)
        #define SC1_TXBEGB_FIXED_BITS                        (19)
        /* SC_TXBEGB field */
        #define SC_TXBEGB                                    (0x00001FFFu)
        #define SC_TXBEGB_MASK                               (0x00001FFFu)
        #define SC_TXBEGB_BIT                                (0)
        #define SC_TXBEGB_BITS                               (13)

#define SC1_TXENDB                                           *((volatile uint32_t *)0x4000C81Cu)
#define SC1_TXENDB_REG                                       *((volatile uint32_t *)0x4000C81Cu)
#define SC1_TXENDB_ADDR                                      (0x4000C81Cu)
#define SC1_TXENDB_RESET                                     (0x20000000u)
        /* FIXED field */
        #define SC1_TXENDB_FIXED                             (0xFFFFE000u)
        #define SC1_TXENDB_FIXED_MASK                        (0xFFFFE000u)
        #define SC1_TXENDB_FIXED_BIT                         (13)
        #define SC1_TXENDB_FIXED_BITS                        (19)
        /* SC_TXENDB field */
        #define SC_TXENDB                                    (0x00001FFFu)
        #define SC_TXENDB_MASK                               (0x00001FFFu)
        #define SC_TXENDB_BIT                                (0)
        #define SC_TXENDB_BITS                               (13)

#define SC1_RXCNTA                                           *((volatile uint32_t *)0x4000C820u)
#define SC1_RXCNTA_REG                                       *((volatile uint32_t *)0x4000C820u)
#define SC1_RXCNTA_ADDR                                      (0x4000C820u)
#define SC1_RXCNTA_RESET                                     (0x00000000u)
        /* SC_RXCNTA field */
        #define SC_RXCNTA                                    (0x00001FFFu)
        #define SC_RXCNTA_MASK                               (0x00001FFFu)
        #define SC_RXCNTA_BIT                                (0)
        #define SC_RXCNTA_BITS                               (13)

#define SC1_RXCNTB                                           *((volatile uint32_t *)0x4000C824u)
#define SC1_RXCNTB_REG                                       *((volatile uint32_t *)0x4000C824u)
#define SC1_RXCNTB_ADDR                                      (0x4000C824u)
#define SC1_RXCNTB_RESET                                     (0x00000000u)
        /* SC_RXCNTB field */
        #define SC_RXCNTB                                    (0x00001FFFu)
        #define SC_RXCNTB_MASK                               (0x00001FFFu)
        #define SC_RXCNTB_BIT                                (0)
        #define SC_RXCNTB_BITS                               (13)

#define SC1_TXCNT                                            *((volatile uint32_t *)0x4000C828u)
#define SC1_TXCNT_REG                                        *((volatile uint32_t *)0x4000C828u)
#define SC1_TXCNT_ADDR                                       (0x4000C828u)
#define SC1_TXCNT_RESET                                      (0x00000000u)
        /* SC_TXCNT field */
        #define SC_TXCNT                                     (0x00001FFFu)
        #define SC_TXCNT_MASK                                (0x00001FFFu)
        #define SC_TXCNT_BIT                                 (0)
        #define SC_TXCNT_BITS                                (13)

#define SC1_DMASTAT                                          *((volatile uint32_t *)0x4000C82Cu)
#define SC1_DMASTAT_REG                                      *((volatile uint32_t *)0x4000C82Cu)
#define SC1_DMASTAT_ADDR                                     (0x4000C82Cu)
#define SC1_DMASTAT_RESET                                    (0x00000000u)
        /* SC_RXSSEL field */
        #define SC_RXSSEL                                    (0x00001C00u)
        #define SC_RXSSEL_MASK                               (0x00001C00u)
        #define SC_RXSSEL_BIT                                (10)
        #define SC_RXSSEL_BITS                               (3)
        /* SC_RXFRMB field */
        #define SC_RXFRMB                                    (0x00000200u)
        #define SC_RXFRMB_MASK                               (0x00000200u)
        #define SC_RXFRMB_BIT                                (9)
        #define SC_RXFRMB_BITS                               (1)
        /* SC_RXFRMA field */
        #define SC_RXFRMA                                    (0x00000100u)
        #define SC_RXFRMA_MASK                               (0x00000100u)
        #define SC_RXFRMA_BIT                                (8)
        #define SC_RXFRMA_BITS                               (1)
        /* SC_RXPARB field */
        #define SC_RXPARB                                    (0x00000080u)
        #define SC_RXPARB_MASK                               (0x00000080u)
        #define SC_RXPARB_BIT                                (7)
        #define SC_RXPARB_BITS                               (1)
        /* SC_RXPARA field */
        #define SC_RXPARA                                    (0x00000040u)
        #define SC_RXPARA_MASK                               (0x00000040u)
        #define SC_RXPARA_BIT                                (6)
        #define SC_RXPARA_BITS                               (1)
        /* SC_RXOVFB field */
        #define SC_RXOVFB                                    (0x00000020u)
        #define SC_RXOVFB_MASK                               (0x00000020u)
        #define SC_RXOVFB_BIT                                (5)
        #define SC_RXOVFB_BITS                               (1)
        /* SC_RXOVFA field */
        #define SC_RXOVFA                                    (0x00000010u)
        #define SC_RXOVFA_MASK                               (0x00000010u)
        #define SC_RXOVFA_BIT                                (4)
        #define SC_RXOVFA_BITS                               (1)
        /* SC_TXACTB field */
        #define SC_TXACTB                                    (0x00000008u)
        #define SC_TXACTB_MASK                               (0x00000008u)
        #define SC_TXACTB_BIT                                (3)
        #define SC_TXACTB_BITS                               (1)
        /* SC_TXACTA field */
        #define SC_TXACTA                                    (0x00000004u)
        #define SC_TXACTA_MASK                               (0x00000004u)
        #define SC_TXACTA_BIT                                (2)
        #define SC_TXACTA_BITS                               (1)
        /* SC_RXACTB field */
        #define SC_RXACTB                                    (0x00000002u)
        #define SC_RXACTB_MASK                               (0x00000002u)
        #define SC_RXACTB_BIT                                (1)
        #define SC_RXACTB_BITS                               (1)
        /* SC_RXACTA field */
        #define SC_RXACTA                                    (0x00000001u)
        #define SC_RXACTA_MASK                               (0x00000001u)
        #define SC_RXACTA_BIT                                (0)
        #define SC_RXACTA_BITS                               (1)

#define SC1_DMACTRL                                          *((volatile uint32_t *)0x4000C830u)
#define SC1_DMACTRL_REG                                      *((volatile uint32_t *)0x4000C830u)
#define SC1_DMACTRL_ADDR                                     (0x4000C830u)
#define SC1_DMACTRL_RESET                                    (0x00000000u)
        /* SC_TXDMARST field */
        #define SC_TXDMARST                                  (0x00000020u)
        #define SC_TXDMARST_MASK                             (0x00000020u)
        #define SC_TXDMARST_BIT                              (5)
        #define SC_TXDMARST_BITS                             (1)
        /* SC_RXDMARST field */
        #define SC_RXDMARST                                  (0x00000010u)
        #define SC_RXDMARST_MASK                             (0x00000010u)
        #define SC_RXDMARST_BIT                              (4)
        #define SC_RXDMARST_BITS                             (1)
        /* SC_TXLODB field */
        #define SC_TXLODB                                    (0x00000008u)
        #define SC_TXLODB_MASK                               (0x00000008u)
        #define SC_TXLODB_BIT                                (3)
        #define SC_TXLODB_BITS                               (1)
        /* SC_TXLODA field */
        #define SC_TXLODA                                    (0x00000004u)
        #define SC_TXLODA_MASK                               (0x00000004u)
        #define SC_TXLODA_BIT                                (2)
        #define SC_TXLODA_BITS                               (1)
        /* SC_RXLODB field */
        #define SC_RXLODB                                    (0x00000002u)
        #define SC_RXLODB_MASK                               (0x00000002u)
        #define SC_RXLODB_BIT                                (1)
        #define SC_RXLODB_BITS                               (1)
        /* SC_RXLODA field */
        #define SC_RXLODA                                    (0x00000001u)
        #define SC_RXLODA_MASK                               (0x00000001u)
        #define SC_RXLODA_BIT                                (0)
        #define SC_RXLODA_BITS                               (1)

