contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define SC1_UARTPER                                          *((volatile uint32_t *)0x4000C868u)
#define SC1_UARTPER_REG                                      *((volatile uint32_t *)0x4000C868u)
#define SC1_UARTPER_ADDR                                     (0x4000C868u)
#define SC1_UARTPER_RESET                                    (0x00000000u)
        /* SC_UARTPER field */
        #define SC_UARTPER                                   (0x0000FFFFu)
        #define SC_UARTPER_MASK                              (0x0000FFFFu)
        #define SC_UARTPER_BIT                               (0)
        #define SC_UARTPER_BITS                              (16)

#define SC1_UARTFRAC                                         *((volatile uint32_t *)0x4000C86Cu)
#define SC1_UARTFRAC_REG                                     *((volatile uint32_t *)0x4000C86Cu)
#define SC1_UARTFRAC_ADDR                                    (0x4000C86Cu)
#define SC1_UARTFRAC_RESET                                   (0x00000000u)
        /* SC_UARTFRAC field */
        #define SC_UARTFRAC                                  (0x00000001u)
        #define SC_UARTFRAC_MASK                             (0x00000001u)
        #define SC_UARTFRAC_BIT                              (0)
        #define SC_UARTFRAC_BITS                             (1)

#define SC1_RXCNTSAVED                                       *((volatile uint32_t *)0x4000C870u)
#define SC1_RXCNTSAVED_REG                                   *((volatile uint32_t *)0x4000C870u)
#define SC1_RXCNTSAVED_ADDR                                  (0x4000C870u)
#define SC1_RXCNTSAVED_RESET                                 (0x00000000u)
        /* SC_RXCNTSAVED field */
        #define SC_RXCNTSAVED                                (0x00001FFFu)
        #define SC_RXCNTSAVED_MASK                           (0x00001FFFu)
        #define SC_RXCNTSAVED_BIT                            (0)
        #define SC_RXCNTSAVED_BITS                           (13)

/* ADC block */
#define BLOCK_ADC_BASE                                       (0x4000D000u)
#define BLOCK_ADC_END                                        (0x4000D024u)
#define BLOCK_ADC_SIZE                                       (BLOCK_ADC_END - BLOCK_ADC_BASE + 1)

#define ADC_DATA                                             *((volatile uint32_t *)0x4000D000u)
#define ADC_DATA_REG                                         *((volatile uint32_t *)0x4000D000u)
#define ADC_DATA_ADDR                                        (0x4000D000u)
#define ADC_DATA_RESET                                       (0x00000000u)
        /* ADC_DATA_FIELD field */
        #define ADC_DATA_FIELD                               (0x0000FFFFu)
        #define ADC_DATA_FIELD_MASK                          (0x0000FFFFu)
        #define ADC_DATA_FIELD_BIT                           (0)
        #define ADC_DATA_FIELD_BITS                          (16)

#define ADC_CFG                                              *((volatile uint32_t *)0x4000D004u)
#define ADC_CFG_REG                                          *((volatile uint32_t *)0x4000D004u)
#define ADC_CFG_ADDR                                         (0x4000D004u)
#define ADC_CFG_RESET                                        (0x00001800u)
        /* ADC_PERIOD field */
        #define ADC_PERIOD                                   (0x0000E000u)
        #define ADC_PERIOD_MASK                              (0x0000E000u)
        #define ADC_PERIOD_BIT                               (13)
        #define ADC_PERIOD_BITS                              (3)
        /* ADC_HVSELP field */
        #define ADC_HVSELP                                   (0x00001000u)
        #define ADC_HVSELP_MASK                              (0x00001000u)
        #define ADC_HVSELP_BIT                               (12)
        #define ADC_HVSELP_BITS                              (1)
        /* ADC_HVSELN field */
        #define ADC_HVSELN                                   (0x00000800u)
        #define ADC_HVSELN_MASK                              (0x00000800u)
        #define ADC_HVSELN_BIT                               (11)
        #define ADC_HVSELN_BITS                              (1)
        /* ADC_MUXP field */
        #define ADC_MUXP                                     (0x00000780u)
        #define ADC_MUXP_MASK                                (0x00000780u)
        #define ADC_MUXP_BIT                                 (7)
        #define ADC_MUXP_BITS                                (4)
        /* ADC_MUXN field */
        #define ADC_MUXN                                     (0x00000078u)
        #define ADC_MUXN_MASK                                (0x00000078u)
        #define ADC_MUXN_BIT                                 (3)
        #define ADC_MUXN_BITS                                (4)
        /* ADC_1MHZCLK field */
        #define ADC_1MHZCLK                                  (0x00000004u)
        #define ADC_1MHZCLK_MASK                             (0x00000004u)
        #define ADC_1MHZCLK_BIT                              (2)
        #define ADC_1MHZCLK_BITS                             (1)
        /* ADC_CFGRSVD field */
        #define ADC_CFGRSVD                                  (0x00000002u)
        #define ADC_CFGRSVD_MASK                             (0x00000002u)
        #define ADC_CFGRSVD_BIT                              (1)
        #define ADC_CFGRSVD_BITS                             (1)
        /* ADC_ENABLE field */
        #define ADC_ENABLE                                   (0x00000001u)
        #define ADC_ENABLE_MASK                              (0x00000001u)
        #define ADC_ENABLE_BIT                               (0)
        #define ADC_ENABLE_BITS                              (1)

#define ADC_OFFSET                                           *((volatile uint32_t *)0x4000D008u)
#define ADC_OFFSET_REG                                       *((volatile uint32_t *)0x4000D008u)
#define ADC_OFFSET_ADDR                                      (0x4000D008u)
#define ADC_OFFSET_RESET                                     (0x00000000u)
        /* ADC_OFFSET_FIELD field */
        #define ADC_OFFSET_FIELD                             (0x0000FFFFu)
        #define ADC_OFFSET_FIELD_MASK                        (0x0000FFFFu)
        #define ADC_OFFSET_FIELD_BIT                         (0)
        #define ADC_OFFSET_FIELD_BITS                        (16)

#define ADC_GAIN                                             *((volatile uint32_t *)0x4000D00Cu)
#define ADC_GAIN_REG                                         *((volatile uint32_t *)0x4000D00Cu)
#define ADC_GAIN_ADDR                                        (0x4000D00Cu)
#define ADC_GAIN_RESET                                       (0x00008000u)
        /* ADC_GAIN_FIELD field */
        #define ADC_GAIN_FIELD                               (0x0000FFFFu)
        #define ADC_GAIN_FIELD_MASK                          (0x0000FFFFu)
        #define ADC_GAIN_FIELD_BIT                           (0)
        #define ADC_GAIN_FIELD_BITS                          (16)

