contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define ADC_DMACFG                                           *((volatile uint32_t *)0x4000D010u)
#define ADC_DMACFG_REG                                       *((volatile uint32_t *)0x4000D010u)
#define ADC_DMACFG_ADDR                                      (0x4000D010u)
#define ADC_DMACFG_RESET                                     (0x00000000u)
        /* ADC_DMARST field */
        #define ADC_DMARST                                   (0x00000010u)
        #define ADC_DMARST_MASK                              (0x00000010u)
        #define ADC_DMARST_BIT                               (4)
        #define ADC_DMARST_BITS                              (1)
        /* ADC_DMAAUTOWRAP field */
        #define ADC_DMAAUTOWRAP                              (0x00000002u)
        #define ADC_DMAAUTOWRAP_MASK                         (0x00000002u)
        #define ADC_DMAAUTOWRAP_BIT                          (1)
        #define ADC_DMAAUTOWRAP_BITS                         (1)
        /* ADC_DMALOAD field */
        #define ADC_DMALOAD                                  (0x00000001u)
        #define ADC_DMALOAD_MASK                             (0x00000001u)
        #define ADC_DMALOAD_BIT                              (0)
        #define ADC_DMALOAD_BITS                             (1)

#define ADC_DMASTAT                                          *((volatile uint32_t *)0x4000D014u)
#define ADC_DMASTAT_REG                                      *((volatile uint32_t *)0x4000D014u)
#define ADC_DMASTAT_ADDR                                     (0x4000D014u)
#define ADC_DMASTAT_RESET                                    (0x00000000u)
        /* ADC_DMAOVF field */
        #define ADC_DMAOVF                                   (0x00000002u)
        #define ADC_DMAOVF_MASK                              (0x00000002u)
        #define ADC_DMAOVF_BIT                               (1)
        #define ADC_DMAOVF_BITS                              (1)
        /* ADC_DMAACT field */
        #define ADC_DMAACT                                   (0x00000001u)
        #define ADC_DMAACT_MASK                              (0x00000001u)
        #define ADC_DMAACT_BIT                               (0)
        #define ADC_DMAACT_BITS                              (1)

#define ADC_DMABEG                                           *((volatile uint32_t *)0x4000D018u)
#define ADC_DMABEG_REG                                       *((volatile uint32_t *)0x4000D018u)
#define ADC_DMABEG_ADDR                                      (0x4000D018u)
#define ADC_DMABEG_RESET                                     (0x20000000u)
        /* ADC_DMABEG_FIXED field */
        #define ADC_DMABEG_FIXED                             (0xFFFFE000u)
        #define ADC_DMABEG_FIXED_MASK                        (0xFFFFE000u)
        #define ADC_DMABEG_FIXED_BIT                         (13)
        #define ADC_DMABEG_FIXED_BITS                        (19)
        /* ADC_DMABEG_FIELD field */
        #define ADC_DMABEG_FIELD                             (0x00001FFFu)
        #define ADC_DMABEG_FIELD_MASK                        (0x00001FFFu)
        #define ADC_DMABEG_FIELD_BIT                         (0)
        #define ADC_DMABEG_FIELD_BITS                        (13)

#define ADC_DMASIZE                                          *((volatile uint32_t *)0x4000D01Cu)
#define ADC_DMASIZE_REG                                      *((volatile uint32_t *)0x4000D01Cu)
#define ADC_DMASIZE_ADDR                                     (0x4000D01Cu)
#define ADC_DMASIZE_RESET                                    (0x00000000u)
        /* ADC_DMASIZE_FIELD field */
        #define ADC_DMASIZE_FIELD                            (0x00000FFFu)
        #define ADC_DMASIZE_FIELD_MASK                       (0x00000FFFu)
        #define ADC_DMASIZE_FIELD_BIT                        (0)
        #define ADC_DMASIZE_FIELD_BITS                       (12)

#define ADC_DMACUR                                           *((volatile uint32_t *)0x4000D020u)
#define ADC_DMACUR_REG                                       *((volatile uint32_t *)0x4000D020u)
#define ADC_DMACUR_ADDR                                      (0x4000D020u)
#define ADC_DMACUR_RESET                                     (0x20000000u)
        /* ADC_DMACUR_FIXED field */
        #define ADC_DMACUR_FIXED                             (0xFFFFE000u)
        #define ADC_DMACUR_FIXED_MASK                        (0xFFFFE000u)
        #define ADC_DMACUR_FIXED_BIT                         (13)
        #define ADC_DMACUR_FIXED_BITS                        (19)
        /* ADC_DMACUR_FIELD field */
        #define ADC_DMACUR_FIELD                             (0x00001FFFu)
        #define ADC_DMACUR_FIELD_MASK                        (0x00001FFFu)
        #define ADC_DMACUR_FIELD_BIT                         (0)
        #define ADC_DMACUR_FIELD_BITS                        (13)

#define ADC_DMACNT                                           *((volatile uint32_t *)0x4000D024u)
#define ADC_DMACNT_REG                                       *((volatile uint32_t *)0x4000D024u)
#define ADC_DMACNT_ADDR                                      (0x4000D024u)
#define ADC_DMACNT_RESET                                     (0x00000000u)
        /* ADC_DMACNT_FIELD field */
        #define ADC_DMACNT_FIELD                             (0x00000FFFu)
        #define ADC_DMACNT_FIELD_MASK                        (0x00000FFFu)
        #define ADC_DMACNT_FIELD_BIT                         (0)
        #define ADC_DMACNT_FIELD_BITS                        (12)

/* TIM1 block */
#define BLOCK_TIM1_BASE                                      (0x4000E000u)
#define BLOCK_TIM1_END                                       (0x4000E050u)
#define BLOCK_TIM1_SIZE                                      (BLOCK_TIM1_END - BLOCK_TIM1_BASE + 1)

#define TIM1_CR1                                             *((volatile uint32_t *)0x4000E000u)
#define TIM1_CR1_REG                                         *((volatile uint32_t *)0x4000E000u)
#define TIM1_CR1_ADDR                                        (0x4000E000u)
#define TIM1_CR1_RESET                                       (0x00000000u)
        /* TIM_ARBE field */
        #define TIM_ARBE                                     (0x00000080u)
        #define TIM_ARBE_MASK                                (0x00000080u)
        #define TIM_ARBE_BIT                                 (7)
        #define TIM_ARBE_BITS                                (1)
        /* TIM_CMS field */
        #define TIM_CMS                                      (0x00000060u)
        #define TIM_CMS_MASK                                 (0x00000060u)
        #define TIM_CMS_BIT                                  (5)
        #define TIM_CMS_BITS                                 (2)
        /* TIM_DIR field */
        #define TIM_DIR                                      (0x00000010u)
        #define TIM_DIR_MASK                                 (0x00000010u)
        #define TIM_DIR_BIT                                  (4)
        #define TIM_DIR_BITS                                 (1)
        /* TIM_OPM field */
        #define TIM_OPM                                      (0x00000008u)
        #define TIM_OPM_MASK                                 (0x00000008u)
        #define TIM_OPM_BIT                                  (3)
        #define TIM_OPM_BITS                                 (1)
        /* TIM_URS field */
        #define TIM_URS                                      (0x00000004u)
        #define TIM_URS_MASK                                 (0x00000004u)
        #define TIM_URS_BIT                                  (2)
        #define TIM_URS_BITS                                 (1)
        /* TIM_UDIS field */
        #define TIM_UDIS                                     (0x00000002u)
        #define TIM_UDIS_MASK                                (0x00000002u)
        #define TIM_UDIS_BIT                                 (1)
        #define TIM_UDIS_BITS                                (1)
        /* TIM_CEN field */
        #define TIM_CEN                                      (0x00000001u)
        #define TIM_CEN_MASK                                 (0x00000001u)
        #define TIM_CEN_BIT                                  (0)
        #define TIM_CEN_BITS                                 (1)

#define TIM1_CR2                                             *((volatile uint32_t *)0x4000E004u)
#define TIM1_CR2_REG                                         *((volatile uint32_t *)0x4000E004u)
#define TIM1_CR2_ADDR                                        (0x4000E004u)
#define TIM1_CR2_RESET                                       (0x00000000u)
        /* TIM_TI1S field */
        #define TIM_TI1S                                     (0x00000080u)
        #define TIM_TI1S_MASK                                (0x00000080u)
        #define TIM_TI1S_BIT                                 (7)
        #define TIM_TI1S_BITS                                (1)
        /* TIM_MMS field */
        #define TIM_MMS                                      (0x00000070u)
        #define TIM_MMS_MASK                                 (0x00000070u)
        #define TIM_MMS_BIT                                  (4)
        #define TIM_MMS_BITS                                 (3)

#define TIM1_SMCR                                            *((volatile uint32_t *)0x4000E008u)
#define TIM1_SMCR_REG                                        *((volatile uint32_t *)0x4000E008u)
#define TIM1_SMCR_ADDR                                       (0x4000E008u)
#define TIM1_SMCR_RESET                                      (0x00000000u)
        /* TIM_ETP field */
        #define TIM_ETP                                      (0x00008000u)
        #define TIM_ETP_MASK                                 (0x00008000u)
        #define TIM_ETP_BIT                                  (15)
        #define TIM_ETP_BITS                                 (1)
        /* TIM_ECE field */
        #define TIM_ECE                                      (0x00004000u)
        #define TIM_ECE_MASK                                 (0x00004000u)
        #define TIM_ECE_BIT                                  (14)
        #define TIM_ECE_BITS                                 (1)
        /* TIM_ETPS field */
        #define TIM_ETPS                                     (0x00003000u)
        #define TIM_ETPS_MASK                                (0x00003000u)
        #define TIM_ETPS_BIT                                 (12)
        #define TIM_ETPS_BITS                                (2)
        /* TIM_ETF field */
        #define TIM_ETF                                      (0x00000F00u)
        #define TIM_ETF_MASK                                 (0x00000F00u)
        #define TIM_ETF_BIT                                  (8)
        #define TIM_ETF_BITS                                 (4)
        /* TIM_MSM field */
        #define TIM_MSM                                      (0x00000080u)
        #define TIM_MSM_MASK                                 (0x00000080u)
        #define TIM_MSM_BIT                                  (7)
        #define TIM_MSM_BITS                                 (1)
        /* TIM_TS field */
        #define TIM_TS                                       (0x00000070u)
        #define TIM_TS_MASK                                  (0x00000070u)
        #define TIM_TS_BIT                                   (4)
        #define TIM_TS_BITS                                  (3)
        /* TIM_SMS field */
        #define TIM_SMS                                      (0x00000007u)
        #define TIM_SMS_MASK                                 (0x00000007u)
        #define TIM_SMS_BIT                                  (0)
        #define TIM_SMS_BITS                                 (3)

