contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define TMR1_DIER                                            *((volatile uint32_t *)0x4000E00Cu)
#define TMR1_DIER_REG                                        *((volatile uint32_t *)0x4000E00Cu)
#define TMR1_DIER_ADDR                                       (0x4000E00Cu)
#define TMR1_DIER_RESET                                      (0x00000000u)
        /* TIE field */
        #define TMR1_DIER_TIE                                (0x00000040u)
        #define TMR1_DIER_TIE_MASK                           (0x00000040u)
        #define TMR1_DIER_TIE_BIT                            (6)
        #define TMR1_DIER_TIE_BITS                           (1)
        /* CC4IE field */
        #define TMR1_DIER_CC4IE                              (0x00000010u)
        #define TMR1_DIER_CC4IE_MASK                         (0x00000010u)
        #define TMR1_DIER_CC4IE_BIT                          (4)
        #define TMR1_DIER_CC4IE_BITS                         (1)
        /* CC3IE field */
        #define TMR1_DIER_CC3IE                              (0x00000008u)
        #define TMR1_DIER_CC3IE_MASK                         (0x00000008u)
        #define TMR1_DIER_CC3IE_BIT                          (3)
        #define TMR1_DIER_CC3IE_BITS                         (1)
        /* CC2IE field */
        #define TMR1_DIER_CC2IE                              (0x00000004u)
        #define TMR1_DIER_CC2IE_MASK                         (0x00000004u)
        #define TMR1_DIER_CC2IE_BIT                          (2)
        #define TMR1_DIER_CC2IE_BITS                         (1)
        /* CC1IE field */
        #define TMR1_DIER_CC1IE                              (0x00000002u)
        #define TMR1_DIER_CC1IE_MASK                         (0x00000002u)
        #define TMR1_DIER_CC1IE_BIT                          (1)
        #define TMR1_DIER_CC1IE_BITS                         (1)
        /* UIE field */
        #define TMR1_DIER_UIE                                (0x00000001u)
        #define TMR1_DIER_UIE_MASK                           (0x00000001u)
        #define TMR1_DIER_UIE_BIT                            (0)
        #define TMR1_DIER_UIE_BITS                           (1)

#define TMR1_SR                                              *((volatile uint32_t *)0x4000E010u)
#define TMR1_SR_REG                                          *((volatile uint32_t *)0x4000E010u)
#define TMR1_SR_ADDR                                         (0x4000E010u)
#define TMR1_SR_RESET                                        (0x00000000u)
        /* CC4OF field */
        #define TMR1_SR_CC4OF                                (0x00001000u)
        #define TMR1_SR_CC4OF_MASK                           (0x00001000u)
        #define TMR1_SR_CC4OF_BIT                            (12)
        #define TMR1_SR_CC4OF_BITS                           (1)
        /* CC3OF field */
        #define TMR1_SR_CC3OF                                (0x00000800u)
        #define TMR1_SR_CC3OF_MASK                           (0x00000800u)
        #define TMR1_SR_CC3OF_BIT                            (11)
        #define TMR1_SR_CC3OF_BITS                           (1)
        /* CC2OF field */
        #define TMR1_SR_CC2OF                                (0x00000400u)
        #define TMR1_SR_CC2OF_MASK                           (0x00000400u)
        #define TMR1_SR_CC2OF_BIT                            (10)
        #define TMR1_SR_CC2OF_BITS                           (1)
        /* CC1OF field */
        #define TMR1_SR_CC1OF                                (0x00000200u)
        #define TMR1_SR_CC1OF_MASK                           (0x00000200u)
        #define TMR1_SR_CC1OF_BIT                            (9)
        #define TMR1_SR_CC1OF_BITS                           (1)
        /* TIF field */
        #define TMR1_SR_TIF                                  (0x00000040u)
        #define TMR1_SR_TIF_MASK                             (0x00000040u)
        #define TMR1_SR_TIF_BIT                              (6)
        #define TMR1_SR_TIF_BITS                             (1)
        /* CC4IF field */
        #define TMR1_SR_CC4IF                                (0x00000010u)
        #define TMR1_SR_CC4IF_MASK                           (0x00000010u)
        #define TMR1_SR_CC4IF_BIT                            (4)
        #define TMR1_SR_CC4IF_BITS                           (1)
        /* CC3IF field */
        #define TMR1_SR_CC3IF                                (0x00000008u)
        #define TMR1_SR_CC3IF_MASK                           (0x00000008u)
        #define TMR1_SR_CC3IF_BIT                            (3)
        #define TMR1_SR_CC3IF_BITS                           (1)
        /* CC2IF field */
        #define TMR1_SR_CC2IF                                (0x00000004u)
        #define TMR1_SR_CC2IF_MASK                           (0x00000004u)
        #define TMR1_SR_CC2IF_BIT                            (2)
        #define TMR1_SR_CC2IF_BITS                           (1)
        /* CC1IF field */
        #define TMR1_SR_CC1IF                                (0x00000002u)
        #define TMR1_SR_CC1IF_MASK                           (0x00000002u)
        #define TMR1_SR_CC1IF_BIT                            (1)
        #define TMR1_SR_CC1IF_BITS                           (1)
        /* UIF field */
        #define TMR1_SR_UIF                                  (0x00000001u)
        #define TMR1_SR_UIF_MASK                             (0x00000001u)
        #define TMR1_SR_UIF_BIT                              (0)
        #define TMR1_SR_UIF_BITS                             (1)

#define TIM1_EGR                                             *((volatile uint32_t *)0x4000E014u)
#define TIM1_EGR_REG                                         *((volatile uint32_t *)0x4000E014u)
#define TIM1_EGR_ADDR                                        (0x4000E014u)
#define TIM1_EGR_RESET                                       (0x00000000u)
        /* TIM_TG field */
        #define TIM_TG                                       (0x00000040u)
        #define TIM_TG_MASK                                  (0x00000040u)
        #define TIM_TG_BIT                                   (6)
        #define TIM_TG_BITS                                  (1)
        /* TIM_CC4G field */
        #define TIM_CC4G                                     (0x00000010u)
        #define TIM_CC4G_MASK                                (0x00000010u)
        #define TIM_CC4G_BIT                                 (4)
        #define TIM_CC4G_BITS                                (1)
        /* TIM_CC3G field */
        #define TIM_CC3G                                     (0x00000008u)
        #define TIM_CC3G_MASK                                (0x00000008u)
        #define TIM_CC3G_BIT                                 (3)
        #define TIM_CC3G_BITS                                (1)
        /* TIM_CC2G field */
        #define TIM_CC2G                                     (0x00000004u)
        #define TIM_CC2G_MASK                                (0x00000004u)
        #define TIM_CC2G_BIT                                 (2)
        #define TIM_CC2G_BITS                                (1)
        /* TIM_CC1G field */
        #define TIM_CC1G                                     (0x00000002u)
        #define TIM_CC1G_MASK                                (0x00000002u)
        #define TIM_CC1G_BIT                                 (1)
        #define TIM_CC1G_BITS                                (1)
        /* TIM_UG field */
        #define TIM_UG                                       (0x00000001u)
        #define TIM_UG_MASK                                  (0x00000001u)
        #define TIM_UG_BIT                                   (0)
        #define TIM_UG_BITS                                  (1)

