contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define TIM1_PSC                                             *((volatile uint32_t *)0x4000E028u)
#define TIM1_PSC_REG                                         *((volatile uint32_t *)0x4000E028u)
#define TIM1_PSC_ADDR                                        (0x4000E028u)
#define TIM1_PSC_RESET                                       (0x00000000u)
        /* TIM_PSC field */
        #define TIM_PSC                                      (0x0000000Fu)
        #define TIM_PSC_MASK                                 (0x0000000Fu)
        #define TIM_PSC_BIT                                  (0)
        #define TIM_PSC_BITS                                 (4)

#define TIM1_ARR                                             *((volatile uint32_t *)0x4000E02Cu)
#define TIM1_ARR_REG                                         *((volatile uint32_t *)0x4000E02Cu)
#define TIM1_ARR_ADDR                                        (0x4000E02Cu)
#define TIM1_ARR_RESET                                       (0x0000FFFFu)
        /* TIM_ARR field */
        #define TIM_ARR                                      (0x0000FFFFu)
        #define TIM_ARR_MASK                                 (0x0000FFFFu)
        #define TIM_ARR_BIT                                  (0)
        #define TIM_ARR_BITS                                 (16)

#define TIM1_CCR1                                            *((volatile uint32_t *)0x4000E034u)
#define TIM1_CCR1_REG                                        *((volatile uint32_t *)0x4000E034u)
#define TIM1_CCR1_ADDR                                       (0x4000E034u)
#define TIM1_CCR1_RESET                                      (0x00000000u)
        /* TIM_CCR field */
        #define TIM_CCR                                      (0x0000FFFFu)
        #define TIM_CCR_MASK                                 (0x0000FFFFu)
        #define TIM_CCR_BIT                                  (0)
        #define TIM_CCR_BITS                                 (16)

#define TIM1_CCR2                                            *((volatile uint32_t *)0x4000E038u)
#define TIM1_CCR2_REG                                        *((volatile uint32_t *)0x4000E038u)
#define TIM1_CCR2_ADDR                                       (0x4000E038u)
#define TIM1_CCR2_RESET                                      (0x00000000u)
        /* TIM_CCR field */
        #define TIM_CCR                                      (0x0000FFFFu)
        #define TIM_CCR_MASK                                 (0x0000FFFFu)
        #define TIM_CCR_BIT                                  (0)
        #define TIM_CCR_BITS                                 (16)

#define TIM1_CCR3                                            *((volatile uint32_t *)0x4000E03Cu)
#define TIM1_CCR3_REG                                        *((volatile uint32_t *)0x4000E03Cu)
#define TIM1_CCR3_ADDR                                       (0x4000E03Cu)
#define TIM1_CCR3_RESET                                      (0x00000000u)
        /* TIM_CCR field */
        #define TIM_CCR                                      (0x0000FFFFu)
        #define TIM_CCR_MASK                                 (0x0000FFFFu)
        #define TIM_CCR_BIT                                  (0)
        #define TIM_CCR_BITS                                 (16)

#define TIM1_CCR4                                            *((volatile uint32_t *)0x4000E040u)
#define TIM1_CCR4_REG                                        *((volatile uint32_t *)0x4000E040u)
#define TIM1_CCR4_ADDR                                       (0x4000E040u)
#define TIM1_CCR4_RESET                                      (0x00000000u)
        /* TIM_CCR field */
        #define TIM_CCR                                      (0x0000FFFFu)
        #define TIM_CCR_MASK                                 (0x0000FFFFu)
        #define TIM_CCR_BIT                                  (0)
        #define TIM_CCR_BITS                                 (16)

#define TIM1_OR                                              *((volatile uint32_t *)0x4000E050u)
#define TIM1_OR_REG                                          *((volatile uint32_t *)0x4000E050u)
#define TIM1_OR_ADDR                                         (0x4000E050u)
#define TIM1_OR_RESET                                        (0x00000000u)
        /* TIM_ORRSVD field */
        #define TIM_ORRSVD                                   (0x00000008u)
        #define TIM_ORRSVD_MASK                              (0x00000008u)
        #define TIM_ORRSVD_BIT                               (3)
        #define TIM_ORRSVD_BITS                              (1)
        /* TIM_CLKMSKEN field */
        #define TIM_CLKMSKEN                                 (0x00000004u)
        #define TIM_CLKMSKEN_MASK                            (0x00000004u)
        #define TIM_CLKMSKEN_BIT                             (2)
        #define TIM_CLKMSKEN_BITS                            (1)
        /* TIM1_EXTRIGSEL field */
        #define TIM1_EXTRIGSEL                               (0x00000003u)
        #define TIM1_EXTRIGSEL_MASK                          (0x00000003u)
        #define TIM1_EXTRIGSEL_BIT                           (0)
        #define TIM1_EXTRIGSEL_BITS                          (2)

/* TIM2 block */
#define BLOCK_TIM2_BASE                                      (0x4000F000u)
#define BLOCK_TIM2_END                                       (0x4000F050u)
#define BLOCK_TIM2_SIZE                                      (BLOCK_TIM2_END - BLOCK_TIM2_BASE + 1)

#define TIM2_CR1                                             *((volatile uint32_t *)0x4000F000u)
#define TIM2_CR1_REG                                         *((volatile uint32_t *)0x4000F000u)
#define TIM2_CR1_ADDR                                        (0x4000F000u)
#define TIM2_CR1_RESET                                       (0x00000000u)
        /* TIM_ARBE field */
        #define TIM_ARBE                                     (0x00000080u)
        #define TIM_ARBE_MASK                                (0x00000080u)
        #define TIM_ARBE_BIT                                 (7)
        #define TIM_ARBE_BITS                                (1)
        /* TIM_CMS field */
        #define TIM_CMS                                      (0x00000060u)
        #define TIM_CMS_MASK                                 (0x00000060u)
        #define TIM_CMS_BIT                                  (5)
        #define TIM_CMS_BITS                                 (2)
        /* TIM_DIR field */
        #define TIM_DIR                                      (0x00000010u)
        #define TIM_DIR_MASK                                 (0x00000010u)
        #define TIM_DIR_BIT                                  (4)
        #define TIM_DIR_BITS                                 (1)
        /* TIM_OPM field */
        #define TIM_OPM                                      (0x00000008u)
        #define TIM_OPM_MASK                                 (0x00000008u)
        #define TIM_OPM_BIT                                  (3)
        #define TIM_OPM_BITS                                 (1)
        /* TIM_URS field */
        #define TIM_URS                                      (0x00000004u)
        #define TIM_URS_MASK                                 (0x00000004u)
        #define TIM_URS_BIT                                  (2)
        #define TIM_URS_BITS                                 (1)
        /* TIM_UDIS field */
        #define TIM_UDIS                                     (0x00000002u)
        #define TIM_UDIS_MASK                                (0x00000002u)
        #define TIM_UDIS_BIT                                 (1)
        #define TIM_UDIS_BITS                                (1)
        /* TIM_CEN field */
        #define TIM_CEN                                      (0x00000001u)
        #define TIM_CEN_MASK                                 (0x00000001u)
        #define TIM_CEN_BIT                                  (0)
        #define TIM_CEN_BITS                                 (1)

