contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define TIM2_CR2                                             *((volatile uint32_t *)0x4000F004u)
#define TIM2_CR2_REG                                         *((volatile uint32_t *)0x4000F004u)
#define TIM2_CR2_ADDR                                        (0x4000F004u)
#define TIM2_CR2_RESET                                       (0x00000000u)
        /* TIM_TI1S field */
        #define TIM_TI1S                                     (0x00000080u)
        #define TIM_TI1S_MASK                                (0x00000080u)
        #define TIM_TI1S_BIT                                 (7)
        #define TIM_TI1S_BITS                                (1)
        /* TIM_MMS field */
        #define TIM_MMS                                      (0x00000070u)
        #define TIM_MMS_MASK                                 (0x00000070u)
        #define TIM_MMS_BIT                                  (4)
        #define TIM_MMS_BITS                                 (3)

#define TIM2_SMCR                                            *((volatile uint32_t *)0x4000F008u)
#define TIM2_SMCR_REG                                        *((volatile uint32_t *)0x4000F008u)
#define TIM2_SMCR_ADDR                                       (0x4000F008u)
#define TIM2_SMCR_RESET                                      (0x00000000u)
        /* TIM_ETP field */
        #define TIM_ETP                                      (0x00008000u)
        #define TIM_ETP_MASK                                 (0x00008000u)
        #define TIM_ETP_BIT                                  (15)
        #define TIM_ETP_BITS                                 (1)
        /* TIM_ECE field */
        #define TIM_ECE                                      (0x00004000u)
        #define TIM_ECE_MASK                                 (0x00004000u)
        #define TIM_ECE_BIT                                  (14)
        #define TIM_ECE_BITS                                 (1)
        /* TIM_ETPS field */
        #define TIM_ETPS                                     (0x00003000u)
        #define TIM_ETPS_MASK                                (0x00003000u)
        #define TIM_ETPS_BIT                                 (12)
        #define TIM_ETPS_BITS                                (2)
        /* TIM_ETF field */
        #define TIM_ETF                                      (0x00000F00u)
        #define TIM_ETF_MASK                                 (0x00000F00u)
        #define TIM_ETF_BIT                                  (8)
        #define TIM_ETF_BITS                                 (4)
        /* TIM_MSM field */
        #define TIM_MSM                                      (0x00000080u)
        #define TIM_MSM_MASK                                 (0x00000080u)
        #define TIM_MSM_BIT                                  (7)
        #define TIM_MSM_BITS                                 (1)
        /* TIM_TS field */
        #define TIM_TS                                       (0x00000070u)
        #define TIM_TS_MASK                                  (0x00000070u)
        #define TIM_TS_BIT                                   (4)
        #define TIM_TS_BITS                                  (3)
        /* TIM_SMS field */
        #define TIM_SMS                                      (0x00000007u)
        #define TIM_SMS_MASK                                 (0x00000007u)
        #define TIM_SMS_BIT                                  (0)
        #define TIM_SMS_BITS                                 (3)

#define TMR2_DIER                                            *((volatile uint32_t *)0x4000F00Cu)
#define TMR2_DIER_REG                                        *((volatile uint32_t *)0x4000F00Cu)
#define TMR2_DIER_ADDR                                       (0x4000F00Cu)
#define TMR2_DIER_RESET                                      (0x00000000u)
        /* TIE field */
        #define TMR2_DIER_TIE                                (0x00000040u)
        #define TMR2_DIER_TIE_MASK                           (0x00000040u)
        #define TMR2_DIER_TIE_BIT                            (6)
        #define TMR2_DIER_TIE_BITS                           (1)
        /* CC4IE field */
        #define TMR2_DIER_CC4IE                              (0x00000010u)
        #define TMR2_DIER_CC4IE_MASK                         (0x00000010u)
        #define TMR2_DIER_CC4IE_BIT                          (4)
        #define TMR2_DIER_CC4IE_BITS                         (1)
        /* CC3IE field */
        #define TMR2_DIER_CC3IE                              (0x00000008u)
        #define TMR2_DIER_CC3IE_MASK                         (0x00000008u)
        #define TMR2_DIER_CC3IE_BIT                          (3)
        #define TMR2_DIER_CC3IE_BITS                         (1)
        /* CC2IE field */
        #define TMR2_DIER_CC2IE                              (0x00000004u)
        #define TMR2_DIER_CC2IE_MASK                         (0x00000004u)
        #define TMR2_DIER_CC2IE_BIT                          (2)
        #define TMR2_DIER_CC2IE_BITS                         (1)
        /* CC1IE field */
        #define TMR2_DIER_CC1IE                              (0x00000002u)
        #define TMR2_DIER_CC1IE_MASK                         (0x00000002u)
        #define TMR2_DIER_CC1IE_BIT                          (1)
        #define TMR2_DIER_CC1IE_BITS                         (1)
        /* UIE field */
        #define TMR2_DIER_UIE                                (0x00000001u)
        #define TMR2_DIER_UIE_MASK                           (0x00000001u)
        #define TMR2_DIER_UIE_BIT                            (0)
        #define TMR2_DIER_UIE_BITS                           (1)

#define TMR2_SR                                              *((volatile uint32_t *)0x4000F010u)
#define TMR2_SR_REG                                          *((volatile uint32_t *)0x4000F010u)
#define TMR2_SR_ADDR                                         (0x4000F010u)
#define TMR2_SR_RESET                                        (0x00000000u)
        /* CC4OF field */
        #define TMR2_SR_CC4OF                                (0x00001000u)
        #define TMR2_SR_CC4OF_MASK                           (0x00001000u)
        #define TMR2_SR_CC4OF_BIT                            (12)
        #define TMR2_SR_CC4OF_BITS                           (1)
        /* CC3OF field */
        #define TMR2_SR_CC3OF                                (0x00000800u)
        #define TMR2_SR_CC3OF_MASK                           (0x00000800u)
        #define TMR2_SR_CC3OF_BIT                            (11)
        #define TMR2_SR_CC3OF_BITS                           (1)
        /* CC2OF field */
        #define TMR2_SR_CC2OF                                (0x00000400u)
        #define TMR2_SR_CC2OF_MASK                           (0x00000400u)
        #define TMR2_SR_CC2OF_BIT                            (10)
        #define TMR2_SR_CC2OF_BITS                           (1)
        /* CC1OF field */
        #define TMR2_SR_CC1OF                                (0x00000200u)
        #define TMR2_SR_CC1OF_MASK                           (0x00000200u)
        #define TMR2_SR_CC1OF_BIT                            (9)
        #define TMR2_SR_CC1OF_BITS                           (1)
        /* TIF field */
        #define TMR2_SR_TIF                                  (0x00000040u)
        #define TMR2_SR_TIF_MASK                             (0x00000040u)
        #define TMR2_SR_TIF_BIT                              (6)
        #define TMR2_SR_TIF_BITS                             (1)
        /* CC4IF field */
        #define TMR2_SR_CC4IF                                (0x00000010u)
        #define TMR2_SR_CC4IF_MASK                           (0x00000010u)
        #define TMR2_SR_CC4IF_BIT                            (4)
        #define TMR2_SR_CC4IF_BITS                           (1)
        /* CC3IF field */
        #define TMR2_SR_CC3IF                                (0x00000008u)
        #define TMR2_SR_CC3IF_MASK                           (0x00000008u)
        #define TMR2_SR_CC3IF_BIT                            (3)
        #define TMR2_SR_CC3IF_BITS                           (1)
        /* CC2IF field */
        #define TMR2_SR_CC2IF                                (0x00000004u)
        #define TMR2_SR_CC2IF_MASK                           (0x00000004u)
        #define TMR2_SR_CC2IF_BIT                            (2)
        #define TMR2_SR_CC2IF_BITS                           (1)
        /* CC1IF field */
        #define TMR2_SR_CC1IF                                (0x00000002u)
        #define TMR2_SR_CC1IF_MASK                           (0x00000002u)
        #define TMR2_SR_CC1IF_BIT                            (1)
        #define TMR2_SR_CC1IF_BITS                           (1)
        /* UIF field */
        #define TMR2_SR_UIF                                  (0x00000001u)
        #define TMR2_SR_UIF_MASK                             (0x00000001u)
        #define TMR2_SR_UIF_BIT                              (0)
        #define TMR2_SR_UIF_BITS                             (1)

#define TIM2_EGR                                             *((volatile uint32_t *)0x4000F014u)
#define TIM2_EGR_REG                                         *((volatile uint32_t *)0x4000F014u)
#define TIM2_EGR_ADDR                                        (0x4000F014u)
#define TIM2_EGR_RESET                                       (0x00000000u)
        /* TIM_TG field */
        #define TIM_TG                                       (0x00000040u)
        #define TIM_TG_MASK                                  (0x00000040u)
        #define TIM_TG_BIT                                   (6)
        #define TIM_TG_BITS                                  (1)
        /* TIM_CC4G field */
        #define TIM_CC4G                                     (0x00000010u)
        #define TIM_CC4G_MASK                                (0x00000010u)
        #define TIM_CC4G_BIT                                 (4)
        #define TIM_CC4G_BITS                                (1)
        /* TIM_CC3G field */
        #define TIM_CC3G                                     (0x00000008u)
        #define TIM_CC3G_MASK                                (0x00000008u)
        #define TIM_CC3G_BIT                                 (3)
        #define TIM_CC3G_BITS                                (1)
        /* TIM_CC2G field */
        #define TIM_CC2G                                     (0x00000004u)
        #define TIM_CC2G_MASK                                (0x00000004u)
        #define TIM_CC2G_BIT                                 (2)
        #define TIM_CC2G_BITS                                (1)
        /* TIM_CC1G field */
        #define TIM_CC1G                                     (0x00000002u)
        #define TIM_CC1G_MASK                                (0x00000002u)
        #define TIM_CC1G_BIT                                 (1)
        #define TIM_CC1G_BITS                                (1)
        /* TIM_UG field */
        #define TIM_UG                                       (0x00000001u)
        #define TIM_UG_MASK                                  (0x00000001u)
        #define TIM_UG_BIT                                   (0)
        #define TIM_UG_BITS                                  (1)

#define TIM2_CCMR1                                           *((volatile uint32_t *)0x4000F018u)
#define TIM2_CCMR1_REG                                       *((volatile uint32_t *)0x4000F018u)
#define TIM2_CCMR1_ADDR                                      (0x4000F018u)
#define TIM2_CCMR1_RESET                                     (0x00000000u)
        /* TIM_IC2F field */
        #define TIM_IC2F                                     (0x0000F000u)
        #define TIM_IC2F_MASK                                (0x0000F000u)
        #define TIM_IC2F_BIT                                 (12)
        #define TIM_IC2F_BITS                                (4)
        /* TIM_IC2PSC field */
        #define TIM_IC2PSC                                   (0x00000C00u)
        #define TIM_IC2PSC_MASK                              (0x00000C00u)
        #define TIM_IC2PSC_BIT                               (10)
        #define TIM_IC2PSC_BITS                              (2)
        /* TIM_IC1F field */
        #define TIM_IC1F                                     (0x000000F0u)
        #define TIM_IC1F_MASK                                (0x000000F0u)
        #define TIM_IC1F_BIT                                 (4)
        #define TIM_IC1F_BITS                                (4)
        /* TIM_IC1PSC field */
        #define TIM_IC1PSC                                   (0x0000000Cu)
        #define TIM_IC1PSC_MASK                              (0x0000000Cu)
        #define TIM_IC1PSC_BIT                               (2)
        #define TIM_IC1PSC_BITS                              (2)
        /* TIM_OC2CE field */
        #define TIM_OC2CE                                    (0x00008000u)
        #define TIM_OC2CE_MASK                               (0x00008000u)
        #define TIM_OC2CE_BIT                                (15)
        #define TIM_OC2CE_BITS                               (1)
        /* TIM_OC2M field */
        #define TIM_OC2M                                     (0x00007000u)
        #define TIM_OC2M_MASK                                (0x00007000u)
        #define TIM_OC2M_BIT                                 (12)
        #define TIM_OC2M_BITS                                (3)
        /* TIM_OC2BE field */
        #define TIM_OC2BE                                    (0x00000800u)
        #define TIM_OC2BE_MASK                               (0x00000800u)
        #define TIM_OC2BE_BIT                                (11)
        #define TIM_OC2BE_BITS                               (1)
        /* TIM_OC2FE field */
        #define TIM_OC2FE                                    (0x00000400u)
        #define TIM_OC2FE_MASK                               (0x00000400u)
        #define TIM_OC2FE_BIT                                (10)
        #define TIM_OC2FE_BITS                               (1)
        /* TIM_CC2S field */
        #define TIM_CC2S                                     (0x00000300u)
        #define TIM_CC2S_MASK                                (0x00000300u)
        #define TIM_CC2S_BIT                                 (8)
        #define TIM_CC2S_BITS                                (2)
        /* TIM_OC1CE field */
        #define TIM_OC1CE                                    (0x00000080u)
        #define TIM_OC1CE_MASK                               (0x00000080u)
        #define TIM_OC1CE_BIT                                (7)
        #define TIM_OC1CE_BITS                               (1)
        /* TIM_OC1M field */
        #define TIM_OC1M                                     (0x00000070u)
        #define TIM_OC1M_MASK                                (0x00000070u)
        #define TIM_OC1M_BIT                                 (4)
        #define TIM_OC1M_BITS                                (3)
        /* TIM_OC1PE field */
        #define TIM_OC1PE                                    (0x00000008u)
        #define TIM_OC1PE_MASK                               (0x00000008u)
        #define TIM_OC1PE_BIT                                (3)
        #define TIM_OC1PE_BITS                               (1)
        /* TIM_OC1FE field */
        #define TIM_OC1FE                                    (0x00000004u)
        #define TIM_OC1FE_MASK                               (0x00000004u)
        #define TIM_OC1FE_BIT                                (2)
        #define TIM_OC1FE_BITS                               (1)
        /* TIM_CC1S field */
        #define TIM_CC1S                                     (0x00000003u)
        #define TIM_CC1S_MASK                                (0x00000003u)
        #define TIM_CC1S_BIT                                 (0)
        #define TIM_CC1S_BITS                                (2)

#define TIM2_CCMR2                                           *((volatile uint32_t *)0x4000F01Cu)
#define TIM2_CCMR2_REG                                       *((volatile uint32_t *)0x4000F01Cu)
#define TIM2_CCMR2_ADDR                                      (0x4000F01Cu)
#define TIM2_CCMR2_RESET                                     (0x00000000u)
        /* TIM_IC4F field */
        #define TIM_IC4F                                     (0x0000F000u)
        #define TIM_IC4F_MASK                                (0x0000F000u)
        #define TIM_IC4F_BIT                                 (12)
        #define TIM_IC4F_BITS                                (4)
        /* TIM_IC4PSC field */
        #define TIM_IC4PSC                                   (0x00000C00u)
        #define TIM_IC4PSC_MASK                              (0x00000C00u)
        #define TIM_IC4PSC_BIT                               (10)
        #define TIM_IC4PSC_BITS                              (2)
        /* TIM_IC3F field */
        #define TIM_IC3F                                     (0x000000F0u)
        #define TIM_IC3F_MASK                                (0x000000F0u)
        #define TIM_IC3F_BIT                                 (4)
        #define TIM_IC3F_BITS                                (4)
        /* TIM_IC3PSC field */
        #define TIM_IC3PSC                                   (0x0000000Cu)
        #define TIM_IC3PSC_MASK                              (0x0000000Cu)
        #define TIM_IC3PSC_BIT                               (2)
        #define TIM_IC3PSC_BITS                              (2)
        /* TIM_OC4CE field */
        #define TIM_OC4CE                                    (0x00008000u)
        #define TIM_OC4CE_MASK                               (0x00008000u)
        #define TIM_OC4CE_BIT                                (15)
        #define TIM_OC4CE_BITS                               (1)
        /* TIM_OC4M field */
        #define TIM_OC4M                                     (0x00007000u)
        #define TIM_OC4M_MASK                                (0x00007000u)
        #define TIM_OC4M_BIT                                 (12)
        #define TIM_OC4M_BITS                                (3)
        /* TIM_OC4BE field */
        #define TIM_OC4BE                                    (0x00000800u)
        #define TIM_OC4BE_MASK                               (0x00000800u)
        #define TIM_OC4BE_BIT                                (11)
        #define TIM_OC4BE_BITS                               (1)
        /* TIM_OC4FE field */
        #define TIM_OC4FE                                    (0x00000400u)
        #define TIM_OC4FE_MASK                               (0x00000400u)
        #define TIM_OC4FE_BIT                                (10)
        #define TIM_OC4FE_BITS                               (1)
        /* TIM_CC4S field */
        #define TIM_CC4S                                     (0x00000300u)
        #define TIM_CC4S_MASK                                (0x00000300u)
        #define TIM_CC4S_BIT                                 (8)
        #define TIM_CC4S_BITS                                (2)
        /* TIM_OC3CE field */
        #define TIM_OC3CE                                    (0x00000080u)
        #define TIM_OC3CE_MASK                               (0x00000080u)
        #define TIM_OC3CE_BIT                                (7)
        #define TIM_OC3CE_BITS                               (1)
        /* TIM_OC3M field */
        #define TIM_OC3M                                     (0x00000070u)
        #define TIM_OC3M_MASK                                (0x00000070u)
        #define TIM_OC3M_BIT                                 (4)
        #define TIM_OC3M_BITS                                (3)
        /* TIM_OC3BE field */
        #define TIM_OC3BE                                    (0x00000008u)
        #define TIM_OC3BE_MASK                               (0x00000008u)
        #define TIM_OC3BE_BIT                                (3)
        #define TIM_OC3BE_BITS                               (1)
        /* TIM_OC3FE field */
        #define TIM_OC3FE                                    (0x00000004u)
        #define TIM_OC3FE_MASK                               (0x00000004u)
        #define TIM_OC3FE_BIT                                (2)
        #define TIM_OC3FE_BITS                               (1)
        /* TIM_CC3S field */
        #define TIM_CC3S                                     (0x00000003u)
        #define TIM_CC3S_MASK                                (0x00000003u)
        #define TIM_CC3S_BIT                                 (0)
        #define TIM_CC3S_BITS                                (2)

#define TIM2_CCER                                            *((volatile uint32_t *)0x4000F020u)
#define TIM2_CCER_REG                                        *((volatile uint32_t *)0x4000F020u)
#define TIM2_CCER_ADDR                                       (0x4000F020u)
#define TIM2_CCER_RESET                                      (0x00000000u)
        /* TIM_CC4P field */
        #define TIM_CC4P                                     (0x00002000u)
        #define TIM_CC4P_MASK                                (0x00002000u)
        #define TIM_CC4P_BIT                                 (13)
        #define TIM_CC4P_BITS                                (1)
        /* TIM_CC4E field */
        #define TIM_CC4E                                     (0x00001000u)
        #define TIM_CC4E_MASK                                (0x00001000u)
        #define TIM_CC4E_BIT                                 (12)
        #define TIM_CC4E_BITS                                (1)
        /* TIM_CC3P field */
        #define TIM_CC3P                                     (0x00000200u)
        #define TIM_CC3P_MASK                                (0x00000200u)
        #define TIM_CC3P_BIT                                 (9)
        #define TIM_CC3P_BITS                                (1)
        /* TIM_CC3E field */
        #define TIM_CC3E                                     (0x00000100u)
        #define TIM_CC3E_MASK                                (0x00000100u)
        #define TIM_CC3E_BIT                                 (8)
        #define TIM_CC3E_BITS                                (1)
        /* TIM_CC2P field */
        #define TIM_CC2P                                     (0x00000020u)
        #define TIM_CC2P_MASK                                (0x00000020u)
        #define TIM_CC2P_BIT                                 (5)
        #define TIM_CC2P_BITS                                (1)
        /* TIM_CC2E field */
        #define TIM_CC2E                                     (0x00000010u)
        #define TIM_CC2E_MASK                                (0x00000010u)
        #define TIM_CC2E_BIT                                 (4)
        #define TIM_CC2E_BITS                                (1)
        /* TIM_CC1P field */
        #define TIM_CC1P                                     (0x00000002u)
        #define TIM_CC1P_MASK                                (0x00000002u)
        #define TIM_CC1P_BIT                                 (1)
        #define TIM_CC1P_BITS                                (1)
        /* TIM_CC1E field */
        #define TIM_CC1E                                     (0x00000001u)
        #define TIM_CC1E_MASK                                (0x00000001u)
        #define TIM_CC1E_BIT                                 (0)
        #define TIM_CC1E_BITS                                (1)

