contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define TIM2_CNT                                             *((volatile uint32_t *)0x4000F024u)
#define TIM2_CNT_REG                                         *((volatile uint32_t *)0x4000F024u)
#define TIM2_CNT_ADDR                                        (0x4000F024u)
#define TIM2_CNT_RESET                                       (0x00000000u)
        /* TIM_CNT field */
        #define TIM_CNT                                      (0x0000FFFFu)
        #define TIM_CNT_MASK                                 (0x0000FFFFu)
        #define TIM_CNT_BIT                                  (0)
        #define TIM_CNT_BITS                                 (16)

#define TIM2_PSC                                             *((volatile uint32_t *)0x4000F028u)
#define TIM2_PSC_REG                                         *((volatile uint32_t *)0x4000F028u)
#define TIM2_PSC_ADDR                                        (0x4000F028u)
#define TIM2_PSC_RESET                                       (0x00000000u)
        /* TIM_PSC field */
        #define TIM_PSC                                      (0x0000000Fu)
        #define TIM_PSC_MASK                                 (0x0000000Fu)
        #define TIM_PSC_BIT                                  (0)
        #define TIM_PSC_BITS                                 (4)

#define TIM2_ARR                                             *((volatile uint32_t *)0x4000F02Cu)
#define TIM2_ARR_REG                                         *((volatile uint32_t *)0x4000F02Cu)
#define TIM2_ARR_ADDR                                        (0x4000F02Cu)
#define TIM2_ARR_RESET                                       (0x0000FFFFu)
        /* TIM_ARR field */
        #define TIM_ARR                                      (0x0000FFFFu)
        #define TIM_ARR_MASK                                 (0x0000FFFFu)
        #define TIM_ARR_BIT                                  (0)
        #define TIM_ARR_BITS                                 (16)

#define TIM2_CCR1                                            *((volatile uint32_t *)0x4000F034u)
#define TIM2_CCR1_REG                                        *((volatile uint32_t *)0x4000F034u)
#define TIM2_CCR1_ADDR                                       (0x4000F034u)
#define TIM2_CCR1_RESET                                      (0x00000000u)
        /* TIM_CCR field */
        #define TIM_CCR                                      (0x0000FFFFu)
        #define TIM_CCR_MASK                                 (0x0000FFFFu)
        #define TIM_CCR_BIT                                  (0)
        #define TIM_CCR_BITS                                 (16)

#define TIM2_CCR2                                            *((volatile uint32_t *)0x4000F038u)
#define TIM2_CCR2_REG                                        *((volatile uint32_t *)0x4000F038u)
#define TIM2_CCR2_ADDR                                       (0x4000F038u)
#define TIM2_CCR2_RESET                                      (0x00000000u)
        /* TIM_CCR field */
        #define TIM_CCR                                      (0x0000FFFFu)
        #define TIM_CCR_MASK                                 (0x0000FFFFu)
        #define TIM_CCR_BIT                                  (0)
        #define TIM_CCR_BITS                                 (16)

#define TIM2_CCR3                                            *((volatile uint32_t *)0x4000F03Cu)
#define TIM2_CCR3_REG                                        *((volatile uint32_t *)0x4000F03Cu)
#define TIM2_CCR3_ADDR                                       (0x4000F03Cu)
#define TIM2_CCR3_RESET                                      (0x00000000u)
        /* TIM_CCR field */
        #define TIM_CCR                                      (0x0000FFFFu)
        #define TIM_CCR_MASK                                 (0x0000FFFFu)
        #define TIM_CCR_BIT                                  (0)
        #define TIM_CCR_BITS                                 (16)

#define TIM2_CCR4                                            *((volatile uint32_t *)0x4000F040u)
#define TIM2_CCR4_REG                                        *((volatile uint32_t *)0x4000F040u)
#define TIM2_CCR4_ADDR                                       (0x4000F040u)
#define TIM2_CCR4_RESET                                      (0x00000000u)
        /* TIM_CCR field */
        #define TIM_CCR                                      (0x0000FFFFu)
        #define TIM_CCR_MASK                                 (0x0000FFFFu)
        #define TIM_CCR_BIT                                  (0)
        #define TIM_CCR_BITS                                 (16)

#define TIM2_OR                                              *((volatile uint32_t *)0x4000F050u)
#define TIM2_OR_REG                                          *((volatile uint32_t *)0x4000F050u)
#define TIM2_OR_ADDR                                         (0x4000F050u)
#define TIM2_OR_RESET                                        (0x00000000u)
        /* TIM_REMAPC4 field */
        #define TIM_REMAPC4                                  (0x00000080u)
        #define TIM_REMAPC4_MASK                             (0x00000080u)
        #define TIM_REMAPC4_BIT                              (7)
        #define TIM_REMAPC4_BITS                             (1)
        /* TIM_REMAPC3 field */
        #define TIM_REMAPC3                                  (0x00000040u)
        #define TIM_REMAPC3_MASK                             (0x00000040u)
        #define TIM_REMAPC3_BIT                              (6)
        #define TIM_REMAPC3_BITS                             (1)
        /* TIM_REMAPC2 field */
        #define TIM_REMAPC2                                  (0x00000020u)
        #define TIM_REMAPC2_MASK                             (0x00000020u)
        #define TIM_REMAPC2_BIT                              (5)
        #define TIM_REMAPC2_BITS                             (1)
        /* TIM_REMAPC1 field */
        #define TIM_REMAPC1                                  (0x00000010u)
        #define TIM_REMAPC1_MASK                             (0x00000010u)
        #define TIM_REMAPC1_BIT                              (4)
        #define TIM_REMAPC1_BITS                             (1)
        /* TIM_ORRSVD field */
        #define TIM_ORRSVD                                   (0x00000008u)
        #define TIM_ORRSVD_MASK                              (0x00000008u)
        #define TIM_ORRSVD_BIT                               (3)
        #define TIM_ORRSVD_BITS                              (1)
        /* TIM_CLKMSKEN field */
        #define TIM_CLKMSKEN                                 (0x00000004u)
        #define TIM_CLKMSKEN_MASK                            (0x00000004u)
        #define TIM_CLKMSKEN_BIT                             (2)
        #define TIM_CLKMSKEN_BITS                            (1)
        /* TIM1_EXTRIGSEL field */
        #define TIM1_EXTRIGSEL                               (0x00000003u)
        #define TIM1_EXTRIGSEL_MASK                          (0x00000003u)
        #define TIM1_EXTRIGSEL_BIT                           (0)
        #define TIM1_EXTRIGSEL_BITS                          (2)

/* EXT_RAM block */
#define DATA_EXT_RAM_BASE                                    (0x60000000u)
#define DATA_EXT_RAM_END                                     (0x9FFFFFFFu)
#define DATA_EXT_RAM_SIZE                                    (DATA_EXT_RAM_END - DATA_EXT_RAM_BASE + 1)

/* EXT_DEVICE block */
#define DATA_EXT_DEVICE_BASE                                 (0xA0000000u)
#define DATA_EXT_DEVICE_END                                  (0xDFFFFFFFu)
#define DATA_EXT_DEVICE_SIZE                                 (DATA_EXT_DEVICE_END - DATA_EXT_DEVICE_BASE + 1)

