contiki-os/contiki/cpu/arm/stm32l152/regs.h
/* ITM block */
#define DATA_ITM_BASE                                        (0xE0000000u)
#define DATA_ITM_END                                         (0xE0000FFFu)
#define DATA_ITM_SIZE                                        (DATA_ITM_END - DATA_ITM_BASE + 1)

#define ITM_SP0                                              *((volatile uint32_t *)0xE0000000u)
#define ITM_SP0_REG                                          *((volatile uint32_t *)0xE0000000u)
#define ITM_SP0_ADDR                                         (0xE0000000u)
#define ITM_SP0_RESET                                        (0x00000000u)
        /* FIFOREADY field */
        #define ITM_SP0_FIFOREADY                            (0x00000001u)
        #define ITM_SP0_FIFOREADY_MASK                       (0x00000001u)
        #define ITM_SP0_FIFOREADY_BIT                        (0)
        #define ITM_SP0_FIFOREADY_BITS                       (1)
        /* STIMULUS field */
        #define ITM_SP0_STIMULUS                             (0xFFFFFFFFu)
        #define ITM_SP0_STIMULUS_MASK                        (0xFFFFFFFFu)
        #define ITM_SP0_STIMULUS_BIT                         (0)
        #define ITM_SP0_STIMULUS_BITS                        (32)

#define ITM_SP1                                              *((volatile uint32_t *)0xE0000004u)
#define ITM_SP1_REG                                          *((volatile uint32_t *)0xE0000004u)
#define ITM_SP1_ADDR                                         (0xE0000004u)
#define ITM_SP1_RESET                                        (0x00000000u)
        /* FIFOREADY field */
        #define ITM_SP1_FIFOREADY                            (0x00000001u)
        #define ITM_SP1_FIFOREADY_MASK                       (0x00000001u)
        #define ITM_SP1_FIFOREADY_BIT                        (0)
        #define ITM_SP1_FIFOREADY_BITS                       (1)
        /* STIMULUS field */
        #define ITM_SP1_STIMULUS                             (0xFFFFFFFFu)
        #define ITM_SP1_STIMULUS_MASK                        (0xFFFFFFFFu)
        #define ITM_SP1_STIMULUS_BIT                         (0)
        #define ITM_SP1_STIMULUS_BITS                        (32)

#define ITM_SP2                                              *((volatile uint32_t *)0xE0000008u)
#define ITM_SP2_REG                                          *((volatile uint32_t *)0xE0000008u)
#define ITM_SP2_ADDR                                         (0xE0000008u)
#define ITM_SP2_RESET                                        (0x00000000u)
        /* FIFOREADY field */
        #define ITM_SP2_FIFOREADY                            (0x00000001u)
        #define ITM_SP2_FIFOREADY_MASK                       (0x00000001u)
        #define ITM_SP2_FIFOREADY_BIT                        (0)
        #define ITM_SP2_FIFOREADY_BITS                       (1)
        /* STIMULUS field */
        #define ITM_SP2_STIMULUS                             (0xFFFFFFFFu)
        #define ITM_SP2_STIMULUS_MASK                        (0xFFFFFFFFu)
        #define ITM_SP2_STIMULUS_BIT                         (0)
        #define ITM_SP2_STIMULUS_BITS                        (32)

#define ITM_SP3                                              *((volatile uint32_t *)0xE000000Cu)
#define ITM_SP3_REG                                          *((volatile uint32_t *)0xE000000Cu)
#define ITM_SP3_ADDR                                         (0xE000000Cu)
#define ITM_SP3_RESET                                        (0x00000000u)
        /* FIFOREADY field */
        #define ITM_SP3_FIFOREADY                            (0x00000001u)
        #define ITM_SP3_FIFOREADY_MASK                       (0x00000001u)
        #define ITM_SP3_FIFOREADY_BIT                        (0)
        #define ITM_SP3_FIFOREADY_BITS                       (1)
        /* STIMULUS field */
        #define ITM_SP3_STIMULUS                             (0xFFFFFFFFu)
        #define ITM_SP3_STIMULUS_MASK                        (0xFFFFFFFFu)
        #define ITM_SP3_STIMULUS_BIT                         (0)
        #define ITM_SP3_STIMULUS_BITS                        (32)

#define ITM_SP4                                              *((volatile uint32_t *)0xE0000010u)
#define ITM_SP4_REG                                          *((volatile uint32_t *)0xE0000010u)
#define ITM_SP4_ADDR                                         (0xE0000010u)
#define ITM_SP4_RESET                                        (0x00000000u)
        /* FIFOREADY field */
        #define ITM_SP4_FIFOREADY                            (0x00000001u)
        #define ITM_SP4_FIFOREADY_MASK                       (0x00000001u)
        #define ITM_SP4_FIFOREADY_BIT                        (0)
        #define ITM_SP4_FIFOREADY_BITS                       (1)
        /* STIMULUS field */
        #define ITM_SP4_STIMULUS                             (0xFFFFFFFFu)
        #define ITM_SP4_STIMULUS_MASK                        (0xFFFFFFFFu)
        #define ITM_SP4_STIMULUS_BIT                         (0)
        #define ITM_SP4_STIMULUS_BITS                        (32)

#define ITM_SP5                                              *((volatile uint32_t *)0xE0000014u)
#define ITM_SP5_REG                                          *((volatile uint32_t *)0xE0000014u)
#define ITM_SP5_ADDR                                         (0xE0000014u)
#define ITM_SP5_RESET                                        (0x00000000u)
        /* FIFOREADY field */
        #define ITM_SP5_FIFOREADY                            (0x00000001u)
        #define ITM_SP5_FIFOREADY_MASK                       (0x00000001u)
        #define ITM_SP5_FIFOREADY_BIT                        (0)
        #define ITM_SP5_FIFOREADY_BITS                       (1)
        /* STIMULUS field */
        #define ITM_SP5_STIMULUS                             (0xFFFFFFFFu)
        #define ITM_SP5_STIMULUS_MASK                        (0xFFFFFFFFu)
        #define ITM_SP5_STIMULUS_BIT                         (0)
        #define ITM_SP5_STIMULUS_BITS                        (32)

#define ITM_SP6                                              *((volatile uint32_t *)0xE0000018u)
#define ITM_SP6_REG                                          *((volatile uint32_t *)0xE0000018u)
#define ITM_SP6_ADDR                                         (0xE0000018u)
#define ITM_SP6_RESET                                        (0x00000000u)
        /* FIFOREADY field */
        #define ITM_SP6_FIFOREADY                            (0x00000001u)
        #define ITM_SP6_FIFOREADY_MASK                       (0x00000001u)
        #define ITM_SP6_FIFOREADY_BIT                        (0)
        #define ITM_SP6_FIFOREADY_BITS                       (1)
        /* STIMULUS field */
        #define ITM_SP6_STIMULUS                             (0xFFFFFFFFu)
        #define ITM_SP6_STIMULUS_MASK                        (0xFFFFFFFFu)
        #define ITM_SP6_STIMULUS_BIT                         (0)
        #define ITM_SP6_STIMULUS_BITS                        (32)

#define ITM_SP7                                              *((volatile uint32_t *)0xE000001Cu)
#define ITM_SP7_REG                                          *((volatile uint32_t *)0xE000001Cu)
#define ITM_SP7_ADDR                                         (0xE000001Cu)
#define ITM_SP7_RESET                                        (0x00000000u)
        /* FIFOREADY field */
        #define ITM_SP7_FIFOREADY                            (0x00000001u)
        #define ITM_SP7_FIFOREADY_MASK                       (0x00000001u)
        #define ITM_SP7_FIFOREADY_BIT                        (0)
        #define ITM_SP7_FIFOREADY_BITS                       (1)
        /* STIMULUS field */
        #define ITM_SP7_STIMULUS                             (0xFFFFFFFFu)
        #define ITM_SP7_STIMULUS_MASK                        (0xFFFFFFFFu)
        #define ITM_SP7_STIMULUS_BIT                         (0)
        #define ITM_SP7_STIMULUS_BITS                        (32)

#define ITM_SP8                                              *((volatile uint32_t *)0xE0000020u)
#define ITM_SP8_REG                                          *((volatile uint32_t *)0xE0000020u)
#define ITM_SP8_ADDR                                         (0xE0000020u)
#define ITM_SP8_RESET                                        (0x00000000u)
        /* FIFOREADY field */
        #define ITM_SP8_FIFOREADY                            (0x00000001u)
        #define ITM_SP8_FIFOREADY_MASK                       (0x00000001u)
        #define ITM_SP8_FIFOREADY_BIT                        (0)
        #define ITM_SP8_FIFOREADY_BITS                       (1)
        /* STIMULUS field */
        #define ITM_SP8_STIMULUS                             (0xFFFFFFFFu)
        #define ITM_SP8_STIMULUS_MASK                        (0xFFFFFFFFu)
        #define ITM_SP8_STIMULUS_BIT                         (0)
        #define ITM_SP8_STIMULUS_BITS                        (32)

#define ITM_SP9                                              *((volatile uint32_t *)0xE0000024u)
#define ITM_SP9_REG                                          *((volatile uint32_t *)0xE0000024u)
#define ITM_SP9_ADDR                                         (0xE0000024u)
#define ITM_SP9_RESET                                        (0x00000000u)
        /* FIFOREADY field */
        #define ITM_SP9_FIFOREADY                            (0x00000001u)
        #define ITM_SP9_FIFOREADY_MASK                       (0x00000001u)
        #define ITM_SP9_FIFOREADY_BIT                        (0)
        #define ITM_SP9_FIFOREADY_BITS                       (1)
        /* STIMULUS field */
        #define ITM_SP9_STIMULUS                             (0xFFFFFFFFu)
        #define ITM_SP9_STIMULUS_MASK                        (0xFFFFFFFFu)
        #define ITM_SP9_STIMULUS_BIT                         (0)
        #define ITM_SP9_STIMULUS_BITS                        (32)

#define ITM_SP10                                             *((volatile uint32_t *)0xE0000028u)
#define ITM_SP10_REG                                         *((volatile uint32_t *)0xE0000028u)
#define ITM_SP10_ADDR                                        (0xE0000028u)
#define ITM_SP10_RESET                                       (0x00000000u)
        /* FIFOREADY field */
        #define ITM_SP10_FIFOREADY                           (0x00000001u)
        #define ITM_SP10_FIFOREADY_MASK                      (0x00000001u)
        #define ITM_SP10_FIFOREADY_BIT                       (0)
        #define ITM_SP10_FIFOREADY_BITS                      (1)
        /* STIMULUS field */
        #define ITM_SP10_STIMULUS                            (0xFFFFFFFFu)
        #define ITM_SP10_STIMULUS_MASK                       (0xFFFFFFFFu)
        #define ITM_SP10_STIMULUS_BIT                        (0)
        #define ITM_SP10_STIMULUS_BITS                       (32)

