contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define ITM_SP11                                             *((volatile uint32_t *)0xE000002Cu)
#define ITM_SP11_REG                                         *((volatile uint32_t *)0xE000002Cu)
#define ITM_SP11_ADDR                                        (0xE000002Cu)
#define ITM_SP11_RESET                                       (0x00000000u)
        /* FIFOREADY field */
        #define ITM_SP11_FIFOREADY                           (0x00000001u)
        #define ITM_SP11_FIFOREADY_MASK                      (0x00000001u)
        #define ITM_SP11_FIFOREADY_BIT                       (0)
        #define ITM_SP11_FIFOREADY_BITS                      (1)
        /* STIMULUS field */
        #define ITM_SP11_STIMULUS                            (0xFFFFFFFFu)
        #define ITM_SP11_STIMULUS_MASK                       (0xFFFFFFFFu)
        #define ITM_SP11_STIMULUS_BIT                        (0)
        #define ITM_SP11_STIMULUS_BITS                       (32)

#define ITM_SP12                                             *((volatile uint32_t *)0xE0000030u)
#define ITM_SP12_REG                                         *((volatile uint32_t *)0xE0000030u)
#define ITM_SP12_ADDR                                        (0xE0000030u)
#define ITM_SP12_RESET                                       (0x00000000u)
        /* FIFOREADY field */
        #define ITM_SP12_FIFOREADY                           (0x00000001u)
        #define ITM_SP12_FIFOREADY_MASK                      (0x00000001u)
        #define ITM_SP12_FIFOREADY_BIT                       (0)
        #define ITM_SP12_FIFOREADY_BITS                      (1)
        /* STIMULUS field */
        #define ITM_SP12_STIMULUS                            (0xFFFFFFFFu)
        #define ITM_SP12_STIMULUS_MASK                       (0xFFFFFFFFu)
        #define ITM_SP12_STIMULUS_BIT                        (0)
        #define ITM_SP12_STIMULUS_BITS                       (32)

#define ITM_SP13                                             *((volatile uint32_t *)0xE0000034u)
#define ITM_SP13_REG                                         *((volatile uint32_t *)0xE0000034u)
#define ITM_SP13_ADDR                                        (0xE0000034u)
#define ITM_SP13_RESET                                       (0x00000000u)
        /* FIFOREADY field */
        #define ITM_SP13_FIFOREADY                           (0x00000001u)
        #define ITM_SP13_FIFOREADY_MASK                      (0x00000001u)
        #define ITM_SP13_FIFOREADY_BIT                       (0)
        #define ITM_SP13_FIFOREADY_BITS                      (1)
        /* STIMULUS field */
        #define ITM_SP13_STIMULUS                            (0xFFFFFFFFu)
        #define ITM_SP13_STIMULUS_MASK                       (0xFFFFFFFFu)
        #define ITM_SP13_STIMULUS_BIT                        (0)
        #define ITM_SP13_STIMULUS_BITS                       (32)

#define ITM_SP14                                             *((volatile uint32_t *)0xE0000038u)
#define ITM_SP14_REG                                         *((volatile uint32_t *)0xE0000038u)
#define ITM_SP14_ADDR                                        (0xE0000038u)
#define ITM_SP14_RESET                                       (0x00000000u)
        /* FIFOREADY field */
        #define ITM_SP14_FIFOREADY                           (0x00000001u)
        #define ITM_SP14_FIFOREADY_MASK                      (0x00000001u)
        #define ITM_SP14_FIFOREADY_BIT                       (0)
        #define ITM_SP14_FIFOREADY_BITS                      (1)
        /* STIMULUS field */
        #define ITM_SP14_STIMULUS                            (0xFFFFFFFFu)
        #define ITM_SP14_STIMULUS_MASK                       (0xFFFFFFFFu)
        #define ITM_SP14_STIMULUS_BIT                        (0)
        #define ITM_SP14_STIMULUS_BITS                       (32)

#define ITM_SP15                                             *((volatile uint32_t *)0xE000003Cu)
#define ITM_SP15_REG                                         *((volatile uint32_t *)0xE000003Cu)
#define ITM_SP15_ADDR                                        (0xE000003Cu)
#define ITM_SP15_RESET                                       (0x00000000u)
        /* FIFOREADY field */
        #define ITM_SP15_FIFOREADY                           (0x00000001u)
        #define ITM_SP15_FIFOREADY_MASK                      (0x00000001u)
        #define ITM_SP15_FIFOREADY_BIT                       (0)
        #define ITM_SP15_FIFOREADY_BITS                      (1)
        /* STIMULUS field */
        #define ITM_SP15_STIMULUS                            (0xFFFFFFFFu)
        #define ITM_SP15_STIMULUS_MASK                       (0xFFFFFFFFu)
        #define ITM_SP15_STIMULUS_BIT                        (0)
        #define ITM_SP15_STIMULUS_BITS                       (32)

#define ITM_SP16                                             *((volatile uint32_t *)0xE0000040u)
#define ITM_SP16_REG                                         *((volatile uint32_t *)0xE0000040u)
#define ITM_SP16_ADDR                                        (0xE0000040u)
#define ITM_SP16_RESET                                       (0x00000000u)
        /* FIFOREADY field */
        #define ITM_SP16_FIFOREADY                           (0x00000001u)
        #define ITM_SP16_FIFOREADY_MASK                      (0x00000001u)
        #define ITM_SP16_FIFOREADY_BIT                       (0)
        #define ITM_SP16_FIFOREADY_BITS                      (1)
        /* STIMULUS field */
        #define ITM_SP16_STIMULUS                            (0xFFFFFFFFu)
        #define ITM_SP16_STIMULUS_MASK                       (0xFFFFFFFFu)
        #define ITM_SP16_STIMULUS_BIT                        (0)
        #define ITM_SP16_STIMULUS_BITS                       (32)

#define ITM_SP17                                             *((volatile uint32_t *)0xE0000044u)
#define ITM_SP17_REG                                         *((volatile uint32_t *)0xE0000044u)
#define ITM_SP17_ADDR                                        (0xE0000044u)
#define ITM_SP17_RESET                                       (0x00000000u)
        /* FIFOREADY field */
        #define ITM_SP17_FIFOREADY                           (0x00000001u)
        #define ITM_SP17_FIFOREADY_MASK                      (0x00000001u)
        #define ITM_SP17_FIFOREADY_BIT                       (0)
        #define ITM_SP17_FIFOREADY_BITS                      (1)
        /* STIMULUS field */
        #define ITM_SP17_STIMULUS                            (0xFFFFFFFFu)
        #define ITM_SP17_STIMULUS_MASK                       (0xFFFFFFFFu)
        #define ITM_SP17_STIMULUS_BIT                        (0)
        #define ITM_SP17_STIMULUS_BITS                       (32)

