contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define ITM_SP26                                             *((volatile uint32_t *)0xE0000068u)
#define ITM_SP26_REG                                         *((volatile uint32_t *)0xE0000068u)
#define ITM_SP26_ADDR                                        (0xE0000068u)
#define ITM_SP26_RESET                                       (0x00000000u)
        /* FIFOREADY field */
        #define ITM_SP26_FIFOREADY                           (0x00000001u)
        #define ITM_SP26_FIFOREADY_MASK                      (0x00000001u)
        #define ITM_SP26_FIFOREADY_BIT                       (0)
        #define ITM_SP26_FIFOREADY_BITS                      (1)
        /* STIMULUS field */
        #define ITM_SP26_STIMULUS                            (0xFFFFFFFFu)
        #define ITM_SP26_STIMULUS_MASK                       (0xFFFFFFFFu)
        #define ITM_SP26_STIMULUS_BIT                        (0)
        #define ITM_SP26_STIMULUS_BITS                       (32)

#define ITM_SP27                                             *((volatile uint32_t *)0xE000006Cu)
#define ITM_SP27_REG                                         *((volatile uint32_t *)0xE000006Cu)
#define ITM_SP27_ADDR                                        (0xE000006Cu)
#define ITM_SP27_RESET                                       (0x00000000u)
        /* FIFOREADY field */
        #define ITM_SP27_FIFOREADY                           (0x00000001u)
        #define ITM_SP27_FIFOREADY_MASK                      (0x00000001u)
        #define ITM_SP27_FIFOREADY_BIT                       (0)
        #define ITM_SP27_FIFOREADY_BITS                      (1)
        /* STIMULUS field */
        #define ITM_SP27_STIMULUS                            (0xFFFFFFFFu)
        #define ITM_SP27_STIMULUS_MASK                       (0xFFFFFFFFu)
        #define ITM_SP27_STIMULUS_BIT                        (0)
        #define ITM_SP27_STIMULUS_BITS                       (32)

#define ITM_SP28                                             *((volatile uint32_t *)0xE0000070u)
#define ITM_SP28_REG                                         *((volatile uint32_t *)0xE0000070u)
#define ITM_SP28_ADDR                                        (0xE0000070u)
#define ITM_SP28_RESET                                       (0x00000000u)
        /* FIFOREADY field */
        #define ITM_SP28_FIFOREADY                           (0x00000001u)
        #define ITM_SP28_FIFOREADY_MASK                      (0x00000001u)
        #define ITM_SP28_FIFOREADY_BIT                       (0)
        #define ITM_SP28_FIFOREADY_BITS                      (1)
        /* STIMULUS field */
        #define ITM_SP28_STIMULUS                            (0xFFFFFFFFu)
        #define ITM_SP28_STIMULUS_MASK                       (0xFFFFFFFFu)
        #define ITM_SP28_STIMULUS_BIT                        (0)
        #define ITM_SP28_STIMULUS_BITS                       (32)

#define ITM_SP29                                             *((volatile uint32_t *)0xE0000074u)
#define ITM_SP29_REG                                         *((volatile uint32_t *)0xE0000074u)
#define ITM_SP29_ADDR                                        (0xE0000074u)
#define ITM_SP29_RESET                                       (0x00000000u)
        /* FIFOREADY field */
        #define ITM_SP29_FIFOREADY                           (0x00000001u)
        #define ITM_SP29_FIFOREADY_MASK                      (0x00000001u)
        #define ITM_SP29_FIFOREADY_BIT                       (0)
        #define ITM_SP29_FIFOREADY_BITS                      (1)
        /* STIMULUS field */
        #define ITM_SP29_STIMULUS                            (0xFFFFFFFFu)
        #define ITM_SP29_STIMULUS_MASK                       (0xFFFFFFFFu)
        #define ITM_SP29_STIMULUS_BIT                        (0)
        #define ITM_SP29_STIMULUS_BITS                       (32)

#define ITM_SP30                                             *((volatile uint32_t *)0xE0000078u)
#define ITM_SP30_REG                                         *((volatile uint32_t *)0xE0000078u)
#define ITM_SP30_ADDR                                        (0xE0000078u)
#define ITM_SP30_RESET                                       (0x00000000u)
        /* FIFOREADY field */
        #define ITM_SP30_FIFOREADY                           (0x00000001u)
        #define ITM_SP30_FIFOREADY_MASK                      (0x00000001u)
        #define ITM_SP30_FIFOREADY_BIT                       (0)
        #define ITM_SP30_FIFOREADY_BITS                      (1)
        /* STIMULUS field */
        #define ITM_SP30_STIMULUS                            (0xFFFFFFFFu)
        #define ITM_SP30_STIMULUS_MASK                       (0xFFFFFFFFu)
        #define ITM_SP30_STIMULUS_BIT                        (0)
        #define ITM_SP30_STIMULUS_BITS                       (32)

#define ITM_SP31                                             *((volatile uint32_t *)0xE000007Cu)
#define ITM_SP31_REG                                         *((volatile uint32_t *)0xE000007Cu)
#define ITM_SP31_ADDR                                        (0xE000007Cu)
#define ITM_SP31_RESET                                       (0x00000000u)
        /* FIFOREADY field */
        #define ITM_SP31_FIFOREADY                           (0x00000001u)
        #define ITM_SP31_FIFOREADY_MASK                      (0x00000001u)
        #define ITM_SP31_FIFOREADY_BIT                       (0)
        #define ITM_SP31_FIFOREADY_BITS                      (1)
        /* STIMULUS field */
        #define ITM_SP31_STIMULUS                            (0xFFFFFFFFu)
        #define ITM_SP31_STIMULUS_MASK                       (0xFFFFFFFFu)
        #define ITM_SP31_STIMULUS_BIT                        (0)
        #define ITM_SP31_STIMULUS_BITS                       (32)

#define ITM_TER                                              *((volatile uint32_t *)0xE0000E00u)
#define ITM_TER_REG                                          *((volatile uint32_t *)0xE0000E00u)
#define ITM_TER_ADDR                                         (0xE0000E00u)
#define ITM_TER_RESET                                        (0x00000000u)
        /* STIMENA field */
        #define ITM_TER_STIMENA                              (0xFFFFFFFFu)
        #define ITM_TER_STIMENA_MASK                         (0xFFFFFFFFu)
        #define ITM_TER_STIMENA_BIT                          (0)
        #define ITM_TER_STIMENA_BITS                         (32)

