contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define ITM_TPR                                              *((volatile uint32_t *)0xE0000E40u)
#define ITM_TPR_REG                                          *((volatile uint32_t *)0xE0000E40u)
#define ITM_TPR_ADDR                                         (0xE0000E40u)
#define ITM_TPR_RESET                                        (0x00000000u)
        /* PRIVMASK field */
        #define ITM_TPR_PRIVMASK                             (0x0000000Fu)
        #define ITM_TPR_PRIVMASK_MASK                        (0x0000000Fu)
        #define ITM_TPR_PRIVMASK_BIT                         (0)
        #define ITM_TPR_PRIVMASK_BITS                        (4)

#define ITM_TCR                                              *((volatile uint32_t *)0xE0000E80u)
#define ITM_TCR_REG                                          *((volatile uint32_t *)0xE0000E80u)
#define ITM_TCR_ADDR                                         (0xE0000E80u)
#define ITM_TCR_RESET                                        (0x00000000u)
        /* BUSY field */
        #define ITM_TCR_BUSY                                 (0x00800000u)
        #define ITM_TCR_BUSY_MASK                            (0x00800000u)
        #define ITM_TCR_BUSY_BIT                             (23)
        #define ITM_TCR_BUSY_BITS                            (1)
        /* ATBID field */
        #define ITM_TCR_ATBID                                (0x007F0000u)
        #define ITM_TCR_ATBID_MASK                           (0x007F0000u)
        #define ITM_TCR_ATBID_BIT                            (16)
        #define ITM_TCR_ATBID_BITS                           (7)
        /* TSPRESCALE field */
        #define ITM_TCR_TSPRESCALE                           (0x00000300u)
        #define ITM_TCR_TSPRESCALE_MASK                      (0x00000300u)
        #define ITM_TCR_TSPRESCALE_BIT                       (8)
        #define ITM_TCR_TSPRESCALE_BITS                      (2)
        /* SWOENA field */
        #define ITM_TCR_SWOENA                               (0x00000010u)
        #define ITM_TCR_SWOENA_MASK                          (0x00000010u)
        #define ITM_TCR_SWOENA_BIT                           (4)
        #define ITM_TCR_SWOENA_BITS                          (1)
        /* DWTENA field */
        #define ITM_TCR_DWTENA                               (0x00000008u)
        #define ITM_TCR_DWTENA_MASK                          (0x00000008u)
        #define ITM_TCR_DWTENA_BIT                           (3)
        #define ITM_TCR_DWTENA_BITS                          (1)
        /* SYNCENA field */
        #define ITM_TCR_SYNCENA                              (0x00000004u)
        #define ITM_TCR_SYNCENA_MASK                         (0x00000004u)
        #define ITM_TCR_SYNCENA_BIT                          (2)
        #define ITM_TCR_SYNCENA_BITS                         (1)
        /* TSENA field */
        #define ITM_TCR_TSENA                                (0x00000002u)
        #define ITM_TCR_TSENA_MASK                           (0x00000002u)
        #define ITM_TCR_TSENA_BIT                            (1)
        #define ITM_TCR_TSENA_BITS                           (1)
        /* ITMEN field */
        #define ITM_TCR_ITMEN                                (0x00000001u)
        #define ITM_TCR_ITMEN_MASK                           (0x00000001u)
        #define ITM_TCR_ITMEN_BIT                            (0)
        #define ITM_TCR_ITMEN_BITS                           (1)

#define ITM_IW                                               *((volatile uint32_t *)0xE0000EF8u)
#define ITM_IW_REG                                           *((volatile uint32_t *)0xE0000EF8u)
#define ITM_IW_ADDR                                          (0xE0000EF8u)
#define ITM_IW_RESET                                         (0x00000000u)
        /* ATVALIDM field */
        #define ITM_IW_ATVALIDM                              (0x00000001u)
        #define ITM_IW_ATVALIDM_MASK                         (0x00000001u)
        #define ITM_IW_ATVALIDM_BIT                          (0)
        #define ITM_IW_ATVALIDM_BITS                         (1)

#define ITM_IR                                               *((volatile uint32_t *)0xE0000EFCu)
#define ITM_IR_REG                                           *((volatile uint32_t *)0xE0000EFCu)
#define ITM_IR_ADDR                                          (0xE0000EFCu)
#define ITM_IR_RESET                                         (0x00000000u)
        /* ATREADYM field */
        #define ITM_IR_ATREADYM                              (0x00000001u)
        #define ITM_IR_ATREADYM_MASK                         (0x00000001u)
        #define ITM_IR_ATREADYM_BIT                          (0)
        #define ITM_IR_ATREADYM_BITS                         (1)

#define ITM_IMC                                              *((volatile uint32_t *)0xE0000F00u)
#define ITM_IMC_REG                                          *((volatile uint32_t *)0xE0000F00u)
#define ITM_IMC_ADDR                                         (0xE0000F00u)
#define ITM_IMC_RESET                                        (0x00000000u)
        /* INTEGRATION field */
        #define ITM_IMC_INTEGRATION                          (0x00000001u)
        #define ITM_IMC_INTEGRATION_MASK                     (0x00000001u)
        #define ITM_IMC_INTEGRATION_BIT                      (0)
        #define ITM_IMC_INTEGRATION_BITS                     (1)

#define ITM_LA                                               *((volatile uint32_t *)0xE0000FB0u)
#define ITM_LA_REG                                           *((volatile uint32_t *)0xE0000FB0u)
#define ITM_LA_ADDR                                          (0xE0000FB0u)
#define ITM_LA_RESET                                         (0x00000000u)
        /* LOCKACC field */
        #define ITM_LA_LOCKACC                               (0xFFFFFFFFu)
        #define ITM_LA_LOCKACC_MASK                          (0xFFFFFFFFu)
        #define ITM_LA_LOCKACC_BIT                           (0)
        #define ITM_LA_LOCKACC_BITS                          (32)

