contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define ITM_LS                                               *((volatile uint32_t *)0xE0000FB4u)
#define ITM_LS_REG                                           *((volatile uint32_t *)0xE0000FB4u)
#define ITM_LS_ADDR                                          (0xE0000FB4u)
#define ITM_LS_RESET                                         (0x00000000u)
        /* BYTEACC field */
        #define ITM_LS_BYTEACC                               (0x00000004u)
        #define ITM_LS_BYTEACC_MASK                          (0x00000004u)
        #define ITM_LS_BYTEACC_BIT                           (2)
        #define ITM_LS_BYTEACC_BITS                          (1)
        /* ACCESS field */
        #define ITM_LS_ACCESS                                (0x00000002u)
        #define ITM_LS_ACCESS_MASK                           (0x00000002u)
        #define ITM_LS_ACCESS_BIT                            (1)
        #define ITM_LS_ACCESS_BITS                           (1)
        /* PRESENT field */
        #define ITM_LS_PRESENT                               (0x00000001u)
        #define ITM_LS_PRESENT_MASK                          (0x00000001u)
        #define ITM_LS_PRESENT_BIT                           (0)
        #define ITM_LS_PRESENT_BITS                          (1)

#define ITM_PERIPHID4                                        *((volatile uint32_t *)0xE0000FD0u)
#define ITM_PERIPHID4_REG                                    *((volatile uint32_t *)0xE0000FD0u)
#define ITM_PERIPHID4_ADDR                                   (0xE0000FD0u)
#define ITM_PERIPHID4_RESET                                  (0x00000004u)
        /* PERIPHID field */
        #define ITM_PERIPHID4_PERIPHID                       (0xFFFFFFFFu)
        #define ITM_PERIPHID4_PERIPHID_MASK                  (0xFFFFFFFFu)
        #define ITM_PERIPHID4_PERIPHID_BIT                   (0)
        #define ITM_PERIPHID4_PERIPHID_BITS                  (32)

#define ITM_PERIPHID5                                        *((volatile uint32_t *)0xE0000FD4u)
#define ITM_PERIPHID5_REG                                    *((volatile uint32_t *)0xE0000FD4u)
#define ITM_PERIPHID5_ADDR                                   (0xE0000FD4u)
#define ITM_PERIPHID5_RESET                                  (0x00000000u)
        /* PERIPHID field */
        #define ITM_PERIPHID5_PERIPHID                       (0xFFFFFFFFu)
        #define ITM_PERIPHID5_PERIPHID_MASK                  (0xFFFFFFFFu)
        #define ITM_PERIPHID5_PERIPHID_BIT                   (0)
        #define ITM_PERIPHID5_PERIPHID_BITS                  (32)

#define ITM_PERIPHID6                                        *((volatile uint32_t *)0xE0000FD8u)
#define ITM_PERIPHID6_REG                                    *((volatile uint32_t *)0xE0000FD8u)
#define ITM_PERIPHID6_ADDR                                   (0xE0000FD8u)
#define ITM_PERIPHID6_RESET                                  (0x00000000u)
        /* PERIPHID field */
        #define ITM_PERIPHID6_PERIPHID                       (0xFFFFFFFFu)
        #define ITM_PERIPHID6_PERIPHID_MASK                  (0xFFFFFFFFu)
        #define ITM_PERIPHID6_PERIPHID_BIT                   (0)
        #define ITM_PERIPHID6_PERIPHID_BITS                  (32)

#define ITM_PERIPHID7                                        *((volatile uint32_t *)0xE0000FDCu)
#define ITM_PERIPHID7_REG                                    *((volatile uint32_t *)0xE0000FDCu)
#define ITM_PERIPHID7_ADDR                                   (0xE0000FDCu)
#define ITM_PERIPHID7_RESET                                  (0x00000000u)
        /* PERIPHID field */
        #define ITM_PERIPHID7_PERIPHID                       (0xFFFFFFFFu)
        #define ITM_PERIPHID7_PERIPHID_MASK                  (0xFFFFFFFFu)
        #define ITM_PERIPHID7_PERIPHID_BIT                   (0)
        #define ITM_PERIPHID7_PERIPHID_BITS                  (32)

#define ITM_PERIPHID0                                        *((volatile uint32_t *)0xE0000FE0u)
#define ITM_PERIPHID0_REG                                    *((volatile uint32_t *)0xE0000FE0u)
#define ITM_PERIPHID0_ADDR                                   (0xE0000FE0u)
#define ITM_PERIPHID0_RESET                                  (0x00000001u)
        /* PERIPHID field */
        #define ITM_PERIPHID0_PERIPHID                       (0xFFFFFFFFu)
        #define ITM_PERIPHID0_PERIPHID_MASK                  (0xFFFFFFFFu)
        #define ITM_PERIPHID0_PERIPHID_BIT                   (0)
        #define ITM_PERIPHID0_PERIPHID_BITS                  (32)

#define ITM_PERIPHID1                                        *((volatile uint32_t *)0xE0000FE4u)
#define ITM_PERIPHID1_REG                                    *((volatile uint32_t *)0xE0000FE4u)
#define ITM_PERIPHID1_ADDR                                   (0xE0000FE4u)
#define ITM_PERIPHID1_RESET                                  (0x000000B0u)
        /* PERIPHID field */
        #define ITM_PERIPHID1_PERIPHID                       (0xFFFFFFFFu)
        #define ITM_PERIPHID1_PERIPHID_MASK                  (0xFFFFFFFFu)
        #define ITM_PERIPHID1_PERIPHID_BIT                   (0)
        #define ITM_PERIPHID1_PERIPHID_BITS                  (32)

#define ITM_PERIPHID2                                        *((volatile uint32_t *)0xE0000FE8u)
#define ITM_PERIPHID2_REG                                    *((volatile uint32_t *)0xE0000FE8u)
#define ITM_PERIPHID2_ADDR                                   (0xE0000FE8u)
#define ITM_PERIPHID2_RESET                                  (0x0000001Bu)
        /* PERIPHID field */
        #define ITM_PERIPHID2_PERIPHID                       (0xFFFFFFFFu)
        #define ITM_PERIPHID2_PERIPHID_MASK                  (0xFFFFFFFFu)
        #define ITM_PERIPHID2_PERIPHID_BIT                   (0)
        #define ITM_PERIPHID2_PERIPHID_BITS                  (32)

#define ITM_PERIPHID3                                        *((volatile uint32_t *)0xE0000FECu)
#define ITM_PERIPHID3_REG                                    *((volatile uint32_t *)0xE0000FECu)
#define ITM_PERIPHID3_ADDR                                   (0xE0000FECu)
#define ITM_PERIPHID3_RESET                                  (0x00000000u)
        /* PERIPHID field */
        #define ITM_PERIPHID3_PERIPHID                       (0xFFFFFFFFu)
        #define ITM_PERIPHID3_PERIPHID_MASK                  (0xFFFFFFFFu)
        #define ITM_PERIPHID3_PERIPHID_BIT                   (0)
        #define ITM_PERIPHID3_PERIPHID_BITS                  (32)

#define ITM_CELLID0                                          *((volatile uint32_t *)0xE0000FF0u)
#define ITM_CELLID0_REG                                      *((volatile uint32_t *)0xE0000FF0u)
#define ITM_CELLID0_ADDR                                     (0xE0000FF0u)
#define ITM_CELLID0_RESET                                    (0x0000000Du)
        /* PERIPHID field */
        #define ITM_CELLID0_PERIPHID                         (0xFFFFFFFFu)
        #define ITM_CELLID0_PERIPHID_MASK                    (0xFFFFFFFFu)
        #define ITM_CELLID0_PERIPHID_BIT                     (0)
        #define ITM_CELLID0_PERIPHID_BITS                    (32)

#define ITM_CELLID1                                          *((volatile uint32_t *)0xE0000FF4u)
#define ITM_CELLID1_REG                                      *((volatile uint32_t *)0xE0000FF4u)
#define ITM_CELLID1_ADDR                                     (0xE0000FF4u)
#define ITM_CELLID1_RESET                                    (0x000000E0u)
        /* PERIPHID field */
        #define ITM_CELLID1_PERIPHID                         (0xFFFFFFFFu)
        #define ITM_CELLID1_PERIPHID_MASK                    (0xFFFFFFFFu)
        #define ITM_CELLID1_PERIPHID_BIT                     (0)
        #define ITM_CELLID1_PERIPHID_BITS                    (32)

