contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define ITM_CELLID2                                          *((volatile uint32_t *)0xE0000FF8u)
#define ITM_CELLID2_REG                                      *((volatile uint32_t *)0xE0000FF8u)
#define ITM_CELLID2_ADDR                                     (0xE0000FF8u)
#define ITM_CELLID2_RESET                                    (0x00000005u)
        /* PERIPHID field */
        #define ITM_CELLID2_PERIPHID                         (0xFFFFFFFFu)
        #define ITM_CELLID2_PERIPHID_MASK                    (0xFFFFFFFFu)
        #define ITM_CELLID2_PERIPHID_BIT                     (0)
        #define ITM_CELLID2_PERIPHID_BITS                    (32)

#define ITM_CELLID3                                          *((volatile uint32_t *)0xE0000FFCu)
#define ITM_CELLID3_REG                                      *((volatile uint32_t *)0xE0000FFCu)
#define ITM_CELLID3_ADDR                                     (0xE0000FFCu)
#define ITM_CELLID3_RESET                                    (0x000000B1u)
        /* PERIPHID field */
        #define ITM_CELLID3_PERIPHID                         (0xFFFFFFFFu)
        #define ITM_CELLID3_PERIPHID_MASK                    (0xFFFFFFFFu)
        #define ITM_CELLID3_PERIPHID_BIT                     (0)
        #define ITM_CELLID3_PERIPHID_BITS                    (32)

/* DWT block */
#define DATA_DWT_BASE                                        (0xE0001000u)
#define DATA_DWT_END                                         (0xE0001FFFu)
#define DATA_DWT_SIZE                                        (DATA_DWT_END - DATA_DWT_BASE + 1)

#define DWT_CTRL                                             *((volatile uint32_t *)0xE0001000u)
#define DWT_CTRL_REG                                         *((volatile uint32_t *)0xE0001000u)
#define DWT_CTRL_ADDR                                        (0xE0001000u)
#define DWT_CTRL_RESET                                       (0x40000000u)
        /* NUMCOMP field */
        #define DWT_CTRL_NUMCOMP                             (0xF0000000u)
        #define DWT_CTRL_NUMCOMP_MASK                        (0xF0000000u)
        #define DWT_CTRL_NUMCOMP_BIT                         (28)
        #define DWT_CTRL_NUMCOMP_BITS                        (4)
        /* CYCEVTENA field */
        #define DWT_CTRL_CYCEVTENA                           (0x00400000u)
        #define DWT_CTRL_CYCEVTENA_MASK                      (0x00400000u)
        #define DWT_CTRL_CYCEVTENA_BIT                       (22)
        #define DWT_CTRL_CYCEVTENA_BITS                      (1)
        /* FOLDEVTENA field */
        #define DWT_CTRL_FOLDEVTENA                          (0x00200000u)
        #define DWT_CTRL_FOLDEVTENA_MASK                     (0x00200000u)
        #define DWT_CTRL_FOLDEVTENA_BIT                      (21)
        #define DWT_CTRL_FOLDEVTENA_BITS                     (1)
        /* LSUEVTENA field */
        #define DWT_CTRL_LSUEVTENA                           (0x00100000u)
        #define DWT_CTRL_LSUEVTENA_MASK                      (0x00100000u)
        #define DWT_CTRL_LSUEVTENA_BIT                       (20)
        #define DWT_CTRL_LSUEVTENA_BITS                      (1)
        /* SLEEPEVTENA field */
        #define DWT_CTRL_SLEEPEVTENA                         (0x00080000u)
        #define DWT_CTRL_SLEEPEVTENA_MASK                    (0x00080000u)
        #define DWT_CTRL_SLEEPEVTENA_BIT                     (19)
        #define DWT_CTRL_SLEEPEVTENA_BITS                    (1)
        /* EXCEVTENA field */
        #define DWT_CTRL_EXCEVTENA                           (0x00040000u)
        #define DWT_CTRL_EXCEVTENA_MASK                      (0x00040000u)
        #define DWT_CTRL_EXCEVTENA_BIT                       (18)
        #define DWT_CTRL_EXCEVTENA_BITS                      (1)
        /* CPIEVTENA field */
        #define DWT_CTRL_CPIEVTENA                           (0x00020000u)
        #define DWT_CTRL_CPIEVTENA_MASK                      (0x00020000u)
        #define DWT_CTRL_CPIEVTENA_BIT                       (17)
        #define DWT_CTRL_CPIEVTENA_BITS                      (1)
        /* EXCTRCENA field */
        #define DWT_CTRL_EXCTRCENA                           (0x00010000u)
        #define DWT_CTRL_EXCTRCENA_MASK                      (0x00010000u)
        #define DWT_CTRL_EXCTRCENA_BIT                       (16)
        #define DWT_CTRL_EXCTRCENA_BITS                      (1)
        /* PCSAMPLEENA field */
        #define DWT_CTRL_PCSAMPLEENA                         (0x00001000u)
        #define DWT_CTRL_PCSAMPLEENA_MASK                    (0x00001000u)
        #define DWT_CTRL_PCSAMPLEENA_BIT                     (12)
        #define DWT_CTRL_PCSAMPLEENA_BITS                    (1)
        /* SYNCTAP field */
        #define DWT_CTRL_SYNCTAP                             (0x00000C00u)
        #define DWT_CTRL_SYNCTAP_MASK                        (0x00000C00u)
        #define DWT_CTRL_SYNCTAP_BIT                         (10)
        #define DWT_CTRL_SYNCTAP_BITS                        (2)
        /* CYCTAP field */
        #define DWT_CTRL_CYCTAP                              (0x00000200u)
        #define DWT_CTRL_CYCTAP_MASK                         (0x00000200u)
        #define DWT_CTRL_CYCTAP_BIT                          (9)
        #define DWT_CTRL_CYCTAP_BITS                         (1)
        /* POSTCNT field */
        #define DWT_CTRL_POSTCNT                             (0x000001E0u)
        #define DWT_CTRL_POSTCNT_MASK                        (0x000001E0u)
        #define DWT_CTRL_POSTCNT_BIT                         (5)
        #define DWT_CTRL_POSTCNT_BITS                        (4)
        /* POSTPRESET field */
        #define DWT_CTRL_POSTPRESET                          (0x0000001Eu)
        #define DWT_CTRL_POSTPRESET_MASK                     (0x0000001Eu)
        #define DWT_CTRL_POSTPRESET_BIT                      (1)
        #define DWT_CTRL_POSTPRESET_BITS                     (4)
        /* CYCCNTENA field */
        #define DWT_CTRL_CYCCNTENA                           (0x00000001u)
        #define DWT_CTRL_CYCCNTENA_MASK                      (0x00000001u)
        #define DWT_CTRL_CYCCNTENA_BIT                       (0)
        #define DWT_CTRL_CYCCNTENA_BITS                      (1)

