contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define DWT_CYCCNT                                           *((volatile uint32_t *)0xE0001004u)
#define DWT_CYCCNT_REG                                       *((volatile uint32_t *)0xE0001004u)
#define DWT_CYCCNT_ADDR                                      (0xE0001004u)
#define DWT_CYCCNT_RESET                                     (0x00000000u)
        /* CYCCNT field */
        #define DWT_CYCCNT_CYCCNT                            (0xFFFFFFFFu)
        #define DWT_CYCCNT_CYCCNT_MASK                       (0xFFFFFFFFu)
        #define DWT_CYCCNT_CYCCNT_BIT                        (0)
        #define DWT_CYCCNT_CYCCNT_BITS                       (32)

#define DWT_CPICNT                                           *((volatile uint32_t *)0xE0001008u)
#define DWT_CPICNT_REG                                       *((volatile uint32_t *)0xE0001008u)
#define DWT_CPICNT_ADDR                                      (0xE0001008u)
#define DWT_CPICNT_RESET                                     (0x00000000u)
        /* CPICNT field */
        #define DWT_CPICNT_CPICNT                            (0x000000FFu)
        #define DWT_CPICNT_CPICNT_MASK                       (0x000000FFu)
        #define DWT_CPICNT_CPICNT_BIT                        (0)
        #define DWT_CPICNT_CPICNT_BITS                       (8)

#define DWT_EXCCNT                                           *((volatile uint32_t *)0xE000100Cu)
#define DWT_EXCCNT_REG                                       *((volatile uint32_t *)0xE000100Cu)
#define DWT_EXCCNT_ADDR                                      (0xE000100Cu)
#define DWT_EXCCNT_RESET                                     (0x00000000u)
        /* EXCCNT field */
        #define DWT_EXCCNT_EXCCNT                            (0x000000FFu)
        #define DWT_EXCCNT_EXCCNT_MASK                       (0x000000FFu)
        #define DWT_EXCCNT_EXCCNT_BIT                        (0)
        #define DWT_EXCCNT_EXCCNT_BITS                       (8)

#define DWT_SLEEPCNT                                         *((volatile uint32_t *)0xE0001010u)
#define DWT_SLEEPCNT_REG                                     *((volatile uint32_t *)0xE0001010u)
#define DWT_SLEEPCNT_ADDR                                    (0xE0001010u)
#define DWT_SLEEPCNT_RESET                                   (0x00000000u)
        /* SLEEPCNT field */
        #define DWT_SLEEPCNT_SLEEPCNT                        (0x000000FFu)
        #define DWT_SLEEPCNT_SLEEPCNT_MASK                   (0x000000FFu)
        #define DWT_SLEEPCNT_SLEEPCNT_BIT                    (0)
        #define DWT_SLEEPCNT_SLEEPCNT_BITS                   (8)

#define DWT_LSUCNT                                           *((volatile uint32_t *)0xE0001014u)
#define DWT_LSUCNT_REG                                       *((volatile uint32_t *)0xE0001014u)
#define DWT_LSUCNT_ADDR                                      (0xE0001014u)
#define DWT_LSUCNT_RESET                                     (0x00000000u)
        /* CPICNT field */
        #define DWT_LSUCNT_CPICNT                            (0x000000FFu)
        #define DWT_LSUCNT_CPICNT_MASK                       (0x000000FFu)
        #define DWT_LSUCNT_CPICNT_BIT                        (0)
        #define DWT_LSUCNT_CPICNT_BITS                       (8)

#define DWT_FOLDCNT                                          *((volatile uint32_t *)0xE0001018u)
#define DWT_FOLDCNT_REG                                      *((volatile uint32_t *)0xE0001018u)
#define DWT_FOLDCNT_ADDR                                     (0xE0001018u)
#define DWT_FOLDCNT_RESET                                    (0x00000000u)
        /* CPICNT field */
        #define DWT_FOLDCNT_CPICNT                           (0x000000FFu)
        #define DWT_FOLDCNT_CPICNT_MASK                      (0x000000FFu)
        #define DWT_FOLDCNT_CPICNT_BIT                       (0)
        #define DWT_FOLDCNT_CPICNT_BITS                      (8)

#define DWT_PCSR                                             *((volatile uint32_t *)0xE000101Cu)
#define DWT_PCSR_REG                                         *((volatile uint32_t *)0xE000101Cu)
#define DWT_PCSR_ADDR                                        (0xE000101Cu)
#define DWT_PCSR_RESET                                       (0x00000000u)
        /* EIASAMPLE field */
        #define DWT_PCSR_EIASAMPLE                           (0xFFFFFFFFu)
        #define DWT_PCSR_EIASAMPLE_MASK                      (0xFFFFFFFFu)
        #define DWT_PCSR_EIASAMPLE_BIT                       (0)
        #define DWT_PCSR_EIASAMPLE_BITS                      (32)

#define DWT_COMP0                                            *((volatile uint32_t *)0xE0001020u)
#define DWT_COMP0_REG                                        *((volatile uint32_t *)0xE0001020u)
#define DWT_COMP0_ADDR                                       (0xE0001020u)
#define DWT_COMP0_RESET                                      (0x00000000u)
        /* COMP0 field */
        #define DWT_COMP0_COMP0                              (0xFFFFFFFFu)
        #define DWT_COMP0_COMP0_MASK                         (0xFFFFFFFFu)
        #define DWT_COMP0_COMP0_BIT                          (0)
        #define DWT_COMP0_COMP0_BITS                         (32)

#define DWT_MASK0                                            *((volatile uint32_t *)0xE0001024u)
#define DWT_MASK0_REG                                        *((volatile uint32_t *)0xE0001024u)
#define DWT_MASK0_ADDR                                       (0xE0001024u)
#define DWT_MASK0_RESET                                      (0x00000000u)
        /* MASK0 field */
        #define DWT_MASK0_MASK0                              (0x0000001Fu)
        #define DWT_MASK0_MASK0_MASK                         (0x0000001Fu)
        #define DWT_MASK0_MASK0_BIT                          (0)
        #define DWT_MASK0_MASK0_BITS                         (5)

#define DWT_FUNCTION0                                        *((volatile uint32_t *)0xE0001028u)
#define DWT_FUNCTION0_REG                                    *((volatile uint32_t *)0xE0001028u)
#define DWT_FUNCTION0_ADDR                                   (0xE0001028u)
#define DWT_FUNCTION0_RESET                                  (0x00000000u)
        /* MATCHED field */
        #define DWT_FUNCTION0_MATCHED                        (0x01000000u)
        #define DWT_FUNCTION0_MATCHED_MASK                   (0x01000000u)
        #define DWT_FUNCTION0_MATCHED_BIT                    (24)
        #define DWT_FUNCTION0_MATCHED_BITS                   (1)
        /* CYCMATCH field */
        #define DWT_FUNCTION0_CYCMATCH                       (0x00000080u)
        #define DWT_FUNCTION0_CYCMATCH_MASK                  (0x00000080u)
        #define DWT_FUNCTION0_CYCMATCH_BIT                   (7)
        #define DWT_FUNCTION0_CYCMATCH_BITS                  (1)
        /* EMITRANGE field */
        #define DWT_FUNCTION0_EMITRANGE                      (0x00000020u)
        #define DWT_FUNCTION0_EMITRANGE_MASK                 (0x00000020u)
        #define DWT_FUNCTION0_EMITRANGE_BIT                  (5)
        #define DWT_FUNCTION0_EMITRANGE_BITS                 (1)
        /* FUNCTION field */
        #define DWT_FUNCTION0_FUNCTION                       (0x0000000Fu)
        #define DWT_FUNCTION0_FUNCTION_MASK                  (0x0000000Fu)
        #define DWT_FUNCTION0_FUNCTION_BIT                   (0)
        #define DWT_FUNCTION0_FUNCTION_BITS                  (4)

