contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define DWT_COMP1                                            *((volatile uint32_t *)0xE0001030u)
#define DWT_COMP1_REG                                        *((volatile uint32_t *)0xE0001030u)
#define DWT_COMP1_ADDR                                       (0xE0001030u)
#define DWT_COMP1_RESET                                      (0x00000000u)
        /* COMP1 field */
        #define DWT_COMP1_COMP1                              (0xFFFFFFFFu)
        #define DWT_COMP1_COMP1_MASK                         (0xFFFFFFFFu)
        #define DWT_COMP1_COMP1_BIT                          (0)
        #define DWT_COMP1_COMP1_BITS                         (32)

#define DWT_MASK1                                            *((volatile uint32_t *)0xE0001034u)
#define DWT_MASK1_REG                                        *((volatile uint32_t *)0xE0001034u)
#define DWT_MASK1_ADDR                                       (0xE0001034u)
#define DWT_MASK1_RESET                                      (0x00000000u)
        /* MASK1 field */
        #define DWT_MASK1_MASK1                              (0x0000001Fu)
        #define DWT_MASK1_MASK1_MASK                         (0x0000001Fu)
        #define DWT_MASK1_MASK1_BIT                          (0)
        #define DWT_MASK1_MASK1_BITS                         (5)

#define DWT_FUNCTION1                                        *((volatile uint32_t *)0xE0001038u)
#define DWT_FUNCTION1_REG                                    *((volatile uint32_t *)0xE0001038u)
#define DWT_FUNCTION1_ADDR                                   (0xE0001038u)
#define DWT_FUNCTION1_RESET                                  (0x00000200u)
        /* MATCHED field */
        #define DWT_FUNCTION1_MATCHED                        (0x01000000u)
        #define DWT_FUNCTION1_MATCHED_MASK                   (0x01000000u)
        #define DWT_FUNCTION1_MATCHED_BIT                    (24)
        #define DWT_FUNCTION1_MATCHED_BITS                   (1)
        /* DATAVADDR1 field */
        #define DWT_FUNCTION1_DATAVADDR1                     (0x000F0000u)
        #define DWT_FUNCTION1_DATAVADDR1_MASK                (0x000F0000u)
        #define DWT_FUNCTION1_DATAVADDR1_BIT                 (16)
        #define DWT_FUNCTION1_DATAVADDR1_BITS                (4)
        /* DATAVADDR0 field */
        #define DWT_FUNCTION1_DATAVADDR0                     (0x0000F000u)
        #define DWT_FUNCTION1_DATAVADDR0_MASK                (0x0000F000u)
        #define DWT_FUNCTION1_DATAVADDR0_BIT                 (12)
        #define DWT_FUNCTION1_DATAVADDR0_BITS                (4)
        /* DATAVSIZE field */
        #define DWT_FUNCTION1_DATAVSIZE                      (0x00000C00u)
        #define DWT_FUNCTION1_DATAVSIZE_MASK                 (0x00000C00u)
        #define DWT_FUNCTION1_DATAVSIZE_BIT                  (10)
        #define DWT_FUNCTION1_DATAVSIZE_BITS                 (2)
        /* LNK1ENA field */
        #define DWT_FUNCTION1_LNK1ENA                        (0x00000200u)
        #define DWT_FUNCTION1_LNK1ENA_MASK                   (0x00000200u)
        #define DWT_FUNCTION1_LNK1ENA_BIT                    (9)
        #define DWT_FUNCTION1_LNK1ENA_BITS                   (1)
        /* DATAVMATCH field */
        #define DWT_FUNCTION1_DATAVMATCH                     (0x00000100u)
        #define DWT_FUNCTION1_DATAVMATCH_MASK                (0x00000100u)
        #define DWT_FUNCTION1_DATAVMATCH_BIT                 (8)
        #define DWT_FUNCTION1_DATAVMATCH_BITS                (1)
        /* EMITRANGE field */
        #define DWT_FUNCTION1_EMITRANGE                      (0x00000020u)
        #define DWT_FUNCTION1_EMITRANGE_MASK                 (0x00000020u)
        #define DWT_FUNCTION1_EMITRANGE_BIT                  (5)
        #define DWT_FUNCTION1_EMITRANGE_BITS                 (1)
        /* FUNCTION field */
        #define DWT_FUNCTION1_FUNCTION                       (0x0000000Fu)
        #define DWT_FUNCTION1_FUNCTION_MASK                  (0x0000000Fu)
        #define DWT_FUNCTION1_FUNCTION_BIT                   (0)
        #define DWT_FUNCTION1_FUNCTION_BITS                  (4)

#define DWT_COMP2                                            *((volatile uint32_t *)0xE0001040u)
#define DWT_COMP2_REG                                        *((volatile uint32_t *)0xE0001040u)
#define DWT_COMP2_ADDR                                       (0xE0001040u)
#define DWT_COMP2_RESET                                      (0x00000000u)
        /* COMP2 field */
        #define DWT_COMP2_COMP2                              (0xFFFFFFFFu)
        #define DWT_COMP2_COMP2_MASK                         (0xFFFFFFFFu)
        #define DWT_COMP2_COMP2_BIT                          (0)
        #define DWT_COMP2_COMP2_BITS                         (32)

#define DWT_MASK2                                            *((volatile uint32_t *)0xE0001044u)
#define DWT_MASK2_REG                                        *((volatile uint32_t *)0xE0001044u)
#define DWT_MASK2_ADDR                                       (0xE0001044u)
#define DWT_MASK2_RESET                                      (0x00000000u)
        /* MASK2 field */
        #define DWT_MASK2_MASK2                              (0x0000001Fu)
        #define DWT_MASK2_MASK2_MASK                         (0x0000001Fu)
        #define DWT_MASK2_MASK2_BIT                          (0)
        #define DWT_MASK2_MASK2_BITS                         (5)

#define DWT_FUNCTION2                                        *((volatile uint32_t *)0xE0001048u)
#define DWT_FUNCTION2_REG                                    *((volatile uint32_t *)0xE0001048u)
#define DWT_FUNCTION2_ADDR                                   (0xE0001048u)
#define DWT_FUNCTION2_RESET                                  (0x00000000u)
        /* MATCHED field */
        #define DWT_FUNCTION2_MATCHED                        (0x01000000u)
        #define DWT_FUNCTION2_MATCHED_MASK                   (0x01000000u)
        #define DWT_FUNCTION2_MATCHED_BIT                    (24)
        #define DWT_FUNCTION2_MATCHED_BITS                   (1)
        /* EMITRANGE field */
        #define DWT_FUNCTION2_EMITRANGE                      (0x00000020u)
        #define DWT_FUNCTION2_EMITRANGE_MASK                 (0x00000020u)
        #define DWT_FUNCTION2_EMITRANGE_BIT                  (5)
        #define DWT_FUNCTION2_EMITRANGE_BITS                 (1)
        /* FUNCTION field */
        #define DWT_FUNCTION2_FUNCTION                       (0x0000000Fu)
        #define DWT_FUNCTION2_FUNCTION_MASK                  (0x0000000Fu)
        #define DWT_FUNCTION2_FUNCTION_BIT                   (0)
        #define DWT_FUNCTION2_FUNCTION_BITS                  (4)

#define DWT_COMP3                                            *((volatile uint32_t *)0xE0001050u)
#define DWT_COMP3_REG                                        *((volatile uint32_t *)0xE0001050u)
#define DWT_COMP3_ADDR                                       (0xE0001050u)
#define DWT_COMP3_RESET                                      (0x00000000u)
        /* COMP3 field */
        #define DWT_COMP3_COMP3                              (0xFFFFFFFFu)
        #define DWT_COMP3_COMP3_MASK                         (0xFFFFFFFFu)
        #define DWT_COMP3_COMP3_BIT                          (0)
        #define DWT_COMP3_COMP3_BITS                         (32)

#define DWT_MASK3                                            *((volatile uint32_t *)0xE0001054u)
#define DWT_MASK3_REG                                        *((volatile uint32_t *)0xE0001054u)
#define DWT_MASK3_ADDR                                       (0xE0001054u)
#define DWT_MASK3_RESET                                      (0x00000000u)
        /* MASK3 field */
        #define DWT_MASK3_MASK3                              (0x0000001Fu)
        #define DWT_MASK3_MASK3_MASK                         (0x0000001Fu)
        #define DWT_MASK3_MASK3_BIT                          (0)
        #define DWT_MASK3_MASK3_BITS                         (5)

#define DWT_FUNCTION3                                        *((volatile uint32_t *)0xE0001058u)
#define DWT_FUNCTION3_REG                                    *((volatile uint32_t *)0xE0001058u)
#define DWT_FUNCTION3_ADDR                                   (0xE0001058u)
#define DWT_FUNCTION3_RESET                                  (0x00000000u)
        /* MATCHED field */
        #define DWT_FUNCTION3_MATCHED                        (0x01000000u)
        #define DWT_FUNCTION3_MATCHED_MASK                   (0x01000000u)
        #define DWT_FUNCTION3_MATCHED_BIT                    (24)
        #define DWT_FUNCTION3_MATCHED_BITS                   (1)
        /* EMITRANGE field */
        #define DWT_FUNCTION3_EMITRANGE                      (0x00000020u)
        #define DWT_FUNCTION3_EMITRANGE_MASK                 (0x00000020u)
        #define DWT_FUNCTION3_EMITRANGE_BIT                  (5)
        #define DWT_FUNCTION3_EMITRANGE_BITS                 (1)
        /* FUNCTION field */
        #define DWT_FUNCTION3_FUNCTION                       (0x0000000Fu)
        #define DWT_FUNCTION3_FUNCTION_MASK                  (0x0000000Fu)
        #define DWT_FUNCTION3_FUNCTION_BIT                   (0)
        #define DWT_FUNCTION3_FUNCTION_BITS                  (4)

#define DWT_PERIPHID4                                        *((volatile uint32_t *)0xE0001FD0u)
#define DWT_PERIPHID4_REG                                    *((volatile uint32_t *)0xE0001FD0u)
#define DWT_PERIPHID4_ADDR                                   (0xE0001FD0u)
#define DWT_PERIPHID4_RESET                                  (0x00000004u)
        /* PERIPHID field */
        #define DWT_PERIPHID4_PERIPHID                       (0xFFFFFFFFu)
        #define DWT_PERIPHID4_PERIPHID_MASK                  (0xFFFFFFFFu)
        #define DWT_PERIPHID4_PERIPHID_BIT                   (0)
        #define DWT_PERIPHID4_PERIPHID_BITS                  (32)

#define DWT_PERIPHID5                                        *((volatile uint32_t *)0xE0001FD4u)
#define DWT_PERIPHID5_REG                                    *((volatile uint32_t *)0xE0001FD4u)
#define DWT_PERIPHID5_ADDR                                   (0xE0001FD4u)
#define DWT_PERIPHID5_RESET                                  (0x00000000u)
        /* PERIPHID field */
        #define DWT_PERIPHID5_PERIPHID                       (0xFFFFFFFFu)
        #define DWT_PERIPHID5_PERIPHID_MASK                  (0xFFFFFFFFu)
        #define DWT_PERIPHID5_PERIPHID_BIT                   (0)
        #define DWT_PERIPHID5_PERIPHID_BITS                  (32)

#define DWT_PERIPHID6                                        *((volatile uint32_t *)0xE0001FD8u)
#define DWT_PERIPHID6_REG                                    *((volatile uint32_t *)0xE0001FD8u)
#define DWT_PERIPHID6_ADDR                                   (0xE0001FD8u)
#define DWT_PERIPHID6_RESET                                  (0x00000000u)
        /* PERIPHID field */
        #define DWT_PERIPHID6_PERIPHID                       (0xFFFFFFFFu)
        #define DWT_PERIPHID6_PERIPHID_MASK                  (0xFFFFFFFFu)
        #define DWT_PERIPHID6_PERIPHID_BIT                   (0)
        #define DWT_PERIPHID6_PERIPHID_BITS                  (32)

#define DWT_PERIPHID7                                        *((volatile uint32_t *)0xE0001FDCu)
#define DWT_PERIPHID7_REG                                    *((volatile uint32_t *)0xE0001FDCu)
#define DWT_PERIPHID7_ADDR                                   (0xE0001FDCu)
#define DWT_PERIPHID7_RESET                                  (0x00000000u)
        /* PERIPHID field */
        #define DWT_PERIPHID7_PERIPHID                       (0xFFFFFFFFu)
        #define DWT_PERIPHID7_PERIPHID_MASK                  (0xFFFFFFFFu)
        #define DWT_PERIPHID7_PERIPHID_BIT                   (0)
        #define DWT_PERIPHID7_PERIPHID_BITS                  (32)

#define DWT_PERIPHID0                                        *((volatile uint32_t *)0xE0001FE0u)
#define DWT_PERIPHID0_REG                                    *((volatile uint32_t *)0xE0001FE0u)
#define DWT_PERIPHID0_ADDR                                   (0xE0001FE0u)
#define DWT_PERIPHID0_RESET                                  (0x00000002u)
        /* PERIPHID field */
        #define DWT_PERIPHID0_PERIPHID                       (0xFFFFFFFFu)
        #define DWT_PERIPHID0_PERIPHID_MASK                  (0xFFFFFFFFu)
        #define DWT_PERIPHID0_PERIPHID_BIT                   (0)
        #define DWT_PERIPHID0_PERIPHID_BITS                  (32)

#define DWT_PERIPHID1                                        *((volatile uint32_t *)0xE0001FE4u)
#define DWT_PERIPHID1_REG                                    *((volatile uint32_t *)0xE0001FE4u)
#define DWT_PERIPHID1_ADDR                                   (0xE0001FE4u)
#define DWT_PERIPHID1_RESET                                  (0x00000000u)
        /* PERIPHID field */
        #define DWT_PERIPHID1_PERIPHID                       (0xFFFFFFFFu)
        #define DWT_PERIPHID1_PERIPHID_MASK                  (0xFFFFFFFFu)
        #define DWT_PERIPHID1_PERIPHID_BIT                   (0)
        #define DWT_PERIPHID1_PERIPHID_BITS                  (32)

