contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define DWT_PERIPHID2                                        *((volatile uint32_t *)0xE0001FE8u)
#define DWT_PERIPHID2_REG                                    *((volatile uint32_t *)0xE0001FE8u)
#define DWT_PERIPHID2_ADDR                                   (0xE0001FE8u)
#define DWT_PERIPHID2_RESET                                  (0x0000001Bu)
        /* PERIPHID field */
        #define DWT_PERIPHID2_PERIPHID                       (0xFFFFFFFFu)
        #define DWT_PERIPHID2_PERIPHID_MASK                  (0xFFFFFFFFu)
        #define DWT_PERIPHID2_PERIPHID_BIT                   (0)
        #define DWT_PERIPHID2_PERIPHID_BITS                  (32)

#define DWT_PERIPHID3                                        *((volatile uint32_t *)0xE0001FECu)
#define DWT_PERIPHID3_REG                                    *((volatile uint32_t *)0xE0001FECu)
#define DWT_PERIPHID3_ADDR                                   (0xE0001FECu)
#define DWT_PERIPHID3_RESET                                  (0x00000000u)
        /* PERIPHID field */
        #define DWT_PERIPHID3_PERIPHID                       (0xFFFFFFFFu)
        #define DWT_PERIPHID3_PERIPHID_MASK                  (0xFFFFFFFFu)
        #define DWT_PERIPHID3_PERIPHID_BIT                   (0)
        #define DWT_PERIPHID3_PERIPHID_BITS                  (32)

#define DWT_CELLID0                                          *((volatile uint32_t *)0xE0001FF0u)
#define DWT_CELLID0_REG                                      *((volatile uint32_t *)0xE0001FF0u)
#define DWT_CELLID0_ADDR                                     (0xE0001FF0u)
#define DWT_CELLID0_RESET                                    (0x0000000Du)
        /* CELLID field */
        #define DWT_CELLID0_CELLID                           (0xFFFFFFFFu)
        #define DWT_CELLID0_CELLID_MASK                      (0xFFFFFFFFu)
        #define DWT_CELLID0_CELLID_BIT                       (0)
        #define DWT_CELLID0_CELLID_BITS                      (32)

#define DWT_CELLID1                                          *((volatile uint32_t *)0xE0001FF4u)
#define DWT_CELLID1_REG                                      *((volatile uint32_t *)0xE0001FF4u)
#define DWT_CELLID1_ADDR                                     (0xE0001FF4u)
#define DWT_CELLID1_RESET                                    (0x000000E0u)
        /* CELLID field */
        #define DWT_CELLID1_CELLID                           (0xFFFFFFFFu)
        #define DWT_CELLID1_CELLID_MASK                      (0xFFFFFFFFu)
        #define DWT_CELLID1_CELLID_BIT                       (0)
        #define DWT_CELLID1_CELLID_BITS                      (32)

#define DWT_CELLID2                                          *((volatile uint32_t *)0xE0001FF8u)
#define DWT_CELLID2_REG                                      *((volatile uint32_t *)0xE0001FF8u)
#define DWT_CELLID2_ADDR                                     (0xE0001FF8u)
#define DWT_CELLID2_RESET                                    (0x00000005u)
        /* CELLID field */
        #define DWT_CELLID2_CELLID                           (0xFFFFFFFFu)
        #define DWT_CELLID2_CELLID_MASK                      (0xFFFFFFFFu)
        #define DWT_CELLID2_CELLID_BIT                       (0)
        #define DWT_CELLID2_CELLID_BITS                      (32)

#define DWT_CELLID3                                          *((volatile uint32_t *)0xE0001FFCu)
#define DWT_CELLID3_REG                                      *((volatile uint32_t *)0xE0001FFCu)
#define DWT_CELLID3_ADDR                                     (0xE0001FFCu)
#define DWT_CELLID3_RESET                                    (0x000000B1u)
        /* CELLID field */
        #define DWT_CELLID3_CELLID                           (0xFFFFFFFFu)
        #define DWT_CELLID3_CELLID_MASK                      (0xFFFFFFFFu)
        #define DWT_CELLID3_CELLID_BIT                       (0)
        #define DWT_CELLID3_CELLID_BITS                      (32)

/* FPB block */
#define DATA_FPB_BASE                                        (0xE0002000u)
#define DATA_FPB_END                                         (0xE0002FFFu)
#define DATA_FPB_SIZE                                        (DATA_FPB_END - DATA_FPB_BASE + 1)

#define FPB_CTRL                                             *((volatile uint32_t *)0xE0002000u)
#define FPB_CTRL_REG                                         *((volatile uint32_t *)0xE0002000u)
#define FPB_CTRL_ADDR                                        (0xE0002000u)
#define FPB_CTRL_RESET                                       (0x00000000u)
        /* NUM_LIT field */
        #define FPB_CTRL_NUM_LIT                             (0x00000F00u)
        #define FPB_CTRL_NUM_LIT_MASK                        (0x00000F00u)
        #define FPB_CTRL_NUM_LIT_BIT                         (8)
        #define FPB_CTRL_NUM_LIT_BITS                        (4)
        /* NUM_CODE field */
        #define FPB_CTRL_NUM_CODE                            (0x000000F0u)
        #define FPB_CTRL_NUM_CODE_MASK                       (0x000000F0u)
        #define FPB_CTRL_NUM_CODE_BIT                        (4)
        #define FPB_CTRL_NUM_CODE_BITS                       (4)
        /* KEY field */
        #define FPB_CTRL_KEY                                 (0x00000002u)
        #define FPB_CTRL_KEY_MASK                            (0x00000002u)
        #define FPB_CTRL_KEY_BIT                             (1)
        #define FPB_CTRL_KEY_BITS                            (1)
        /* enable field */
        #define FPB_CTRL_enable                              (0x00000001u)
        #define FPB_CTRL_enable_MASK                         (0x00000001u)
        #define FPB_CTRL_enable_BIT                          (0)
        #define FPB_CTRL_enable_BITS                         (1)

#define FPB_REMAP                                            *((volatile uint32_t *)0xE0002004u)
#define FPB_REMAP_REG                                        *((volatile uint32_t *)0xE0002004u)
#define FPB_REMAP_ADDR                                       (0xE0002004u)
#define FPB_REMAP_RESET                                      (0x20000000u)
        /* REMAP field */
        #define FPB_REMAP_REMAP                              (0x1FFFFFE0u)
        #define FPB_REMAP_REMAP_MASK                         (0x1FFFFFE0u)
        #define FPB_REMAP_REMAP_BIT                          (5)
        #define FPB_REMAP_REMAP_BITS                         (24)

#define FPB_COMP0                                            *((volatile uint32_t *)0xE0002008u)
#define FPB_COMP0_REG                                        *((volatile uint32_t *)0xE0002008u)
#define FPB_COMP0_ADDR                                       (0xE0002008u)
#define FPB_COMP0_RESET                                      (0x00000000u)
        /* REPLACE field */
        #define FPB_COMP0_REPLACE                            (0xC0000000u)
        #define FPB_COMP0_REPLACE_MASK                       (0xC0000000u)
        #define FPB_COMP0_REPLACE_BIT                        (30)
        #define FPB_COMP0_REPLACE_BITS                       (2)
        /* COMP field */
        #define FPB_COMP0_COMP                               (0x1FFFFFFCu)
        #define FPB_COMP0_COMP_MASK                          (0x1FFFFFFCu)
        #define FPB_COMP0_COMP_BIT                           (2)
        #define FPB_COMP0_COMP_BITS                          (27)
        /* enable field */
        #define FPB_COMP0_enable                             (0x00000001u)
        #define FPB_COMP0_enable_MASK                        (0x00000001u)
        #define FPB_COMP0_enable_BIT                         (0)
        #define FPB_COMP0_enable_BITS                        (1)

#define FPB_COMP1                                            *((volatile uint32_t *)0xE000200Cu)
#define FPB_COMP1_REG                                        *((volatile uint32_t *)0xE000200Cu)
#define FPB_COMP1_ADDR                                       (0xE000200Cu)
#define FPB_COMP1_RESET                                      (0x00000000u)
        /* REPLACE field */
        #define FPB_COMP1_REPLACE                            (0xC0000000u)
        #define FPB_COMP1_REPLACE_MASK                       (0xC0000000u)
        #define FPB_COMP1_REPLACE_BIT                        (30)
        #define FPB_COMP1_REPLACE_BITS                       (2)
        /* COMP field */
        #define FPB_COMP1_COMP                               (0x1FFFFFFCu)
        #define FPB_COMP1_COMP_MASK                          (0x1FFFFFFCu)
        #define FPB_COMP1_COMP_BIT                           (2)
        #define FPB_COMP1_COMP_BITS                          (27)
        /* enable field */
        #define FPB_COMP1_enable                             (0x00000001u)
        #define FPB_COMP1_enable_MASK                        (0x00000001u)
        #define FPB_COMP1_enable_BIT                         (0)
        #define FPB_COMP1_enable_BITS                        (1)

