contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define FPB_COMP2                                            *((volatile uint32_t *)0xE0002010u)
#define FPB_COMP2_REG                                        *((volatile uint32_t *)0xE0002010u)
#define FPB_COMP2_ADDR                                       (0xE0002010u)
#define FPB_COMP2_RESET                                      (0x00000000u)
        /* REPLACE field */
        #define FPB_COMP2_REPLACE                            (0xC0000000u)
        #define FPB_COMP2_REPLACE_MASK                       (0xC0000000u)
        #define FPB_COMP2_REPLACE_BIT                        (30)
        #define FPB_COMP2_REPLACE_BITS                       (2)
        /* COMP field */
        #define FPB_COMP2_COMP                               (0x1FFFFFFCu)
        #define FPB_COMP2_COMP_MASK                          (0x1FFFFFFCu)
        #define FPB_COMP2_COMP_BIT                           (2)
        #define FPB_COMP2_COMP_BITS                          (27)
        /* enable field */
        #define FPB_COMP2_enable                             (0x00000001u)
        #define FPB_COMP2_enable_MASK                        (0x00000001u)
        #define FPB_COMP2_enable_BIT                         (0)
        #define FPB_COMP2_enable_BITS                        (1)

#define FPB_COMP3                                            *((volatile uint32_t *)0xE0002014u)
#define FPB_COMP3_REG                                        *((volatile uint32_t *)0xE0002014u)
#define FPB_COMP3_ADDR                                       (0xE0002014u)
#define FPB_COMP3_RESET                                      (0x00000000u)
        /* REPLACE field */
        #define FPB_COMP3_REPLACE                            (0xC0000000u)
        #define FPB_COMP3_REPLACE_MASK                       (0xC0000000u)
        #define FPB_COMP3_REPLACE_BIT                        (30)
        #define FPB_COMP3_REPLACE_BITS                       (2)
        /* COMP field */
        #define FPB_COMP3_COMP                               (0x1FFFFFFCu)
        #define FPB_COMP3_COMP_MASK                          (0x1FFFFFFCu)
        #define FPB_COMP3_COMP_BIT                           (2)
        #define FPB_COMP3_COMP_BITS                          (27)
        /* enable field */
        #define FPB_COMP3_enable                             (0x00000001u)
        #define FPB_COMP3_enable_MASK                        (0x00000001u)
        #define FPB_COMP3_enable_BIT                         (0)
        #define FPB_COMP3_enable_BITS                        (1)

#define FPB_COMP4                                            *((volatile uint32_t *)0xE0002018u)
#define FPB_COMP4_REG                                        *((volatile uint32_t *)0xE0002018u)
#define FPB_COMP4_ADDR                                       (0xE0002018u)
#define FPB_COMP4_RESET                                      (0x00000000u)
        /* REPLACE field */
        #define FPB_COMP4_REPLACE                            (0xC0000000u)
        #define FPB_COMP4_REPLACE_MASK                       (0xC0000000u)
        #define FPB_COMP4_REPLACE_BIT                        (30)
        #define FPB_COMP4_REPLACE_BITS                       (2)
        /* COMP field */
        #define FPB_COMP4_COMP                               (0x1FFFFFFCu)
        #define FPB_COMP4_COMP_MASK                          (0x1FFFFFFCu)
        #define FPB_COMP4_COMP_BIT                           (2)
        #define FPB_COMP4_COMP_BITS                          (27)
        /* enable field */
        #define FPB_COMP4_enable                             (0x00000001u)
        #define FPB_COMP4_enable_MASK                        (0x00000001u)
        #define FPB_COMP4_enable_BIT                         (0)
        #define FPB_COMP4_enable_BITS                        (1)

#define FPB_COMP5                                            *((volatile uint32_t *)0xE000201Cu)
#define FPB_COMP5_REG                                        *((volatile uint32_t *)0xE000201Cu)
#define FPB_COMP5_ADDR                                       (0xE000201Cu)
#define FPB_COMP5_RESET                                      (0x00000000u)
        /* REPLACE field */
        #define FPB_COMP5_REPLACE                            (0xC0000000u)
        #define FPB_COMP5_REPLACE_MASK                       (0xC0000000u)
        #define FPB_COMP5_REPLACE_BIT                        (30)
        #define FPB_COMP5_REPLACE_BITS                       (2)
        /* COMP field */
        #define FPB_COMP5_COMP                               (0x1FFFFFFCu)
        #define FPB_COMP5_COMP_MASK                          (0x1FFFFFFCu)
        #define FPB_COMP5_COMP_BIT                           (2)
        #define FPB_COMP5_COMP_BITS                          (27)
        /* enable field */
        #define FPB_COMP5_enable                             (0x00000001u)
        #define FPB_COMP5_enable_MASK                        (0x00000001u)
        #define FPB_COMP5_enable_BIT                         (0)
        #define FPB_COMP5_enable_BITS                        (1)

#define FPB_COMP6                                            *((volatile uint32_t *)0xE0002020u)
#define FPB_COMP6_REG                                        *((volatile uint32_t *)0xE0002020u)
#define FPB_COMP6_ADDR                                       (0xE0002020u)
#define FPB_COMP6_RESET                                      (0x00000000u)
        /* REPLACE field */
        #define FPB_COMP6_REPLACE                            (0xC0000000u)
        #define FPB_COMP6_REPLACE_MASK                       (0xC0000000u)
        #define FPB_COMP6_REPLACE_BIT                        (30)
        #define FPB_COMP6_REPLACE_BITS                       (2)
        /* COMP field */
        #define FPB_COMP6_COMP                               (0x1FFFFFFCu)
        #define FPB_COMP6_COMP_MASK                          (0x1FFFFFFCu)
        #define FPB_COMP6_COMP_BIT                           (2)
        #define FPB_COMP6_COMP_BITS                          (27)
        /* enable field */
        #define FPB_COMP6_enable                             (0x00000001u)
        #define FPB_COMP6_enable_MASK                        (0x00000001u)
        #define FPB_COMP6_enable_BIT                         (0)
        #define FPB_COMP6_enable_BITS                        (1)

#define FPB_COMP7                                            *((volatile uint32_t *)0xE0002024u)
#define FPB_COMP7_REG                                        *((volatile uint32_t *)0xE0002024u)
#define FPB_COMP7_ADDR                                       (0xE0002024u)
#define FPB_COMP7_RESET                                      (0x00000000u)
        /* REPLACE field */
        #define FPB_COMP7_REPLACE                            (0xC0000000u)
        #define FPB_COMP7_REPLACE_MASK                       (0xC0000000u)
        #define FPB_COMP7_REPLACE_BIT                        (30)
        #define FPB_COMP7_REPLACE_BITS                       (2)
        /* COMP field */
        #define FPB_COMP7_COMP                               (0x1FFFFFFCu)
        #define FPB_COMP7_COMP_MASK                          (0x1FFFFFFCu)
        #define FPB_COMP7_COMP_BIT                           (2)
        #define FPB_COMP7_COMP_BITS                          (27)
        /* enable field */
        #define FPB_COMP7_enable                             (0x00000001u)
        #define FPB_COMP7_enable_MASK                        (0x00000001u)
        #define FPB_COMP7_enable_BIT                         (0)
        #define FPB_COMP7_enable_BITS                        (1)

#define FPB_PERIPHID4                                        *((volatile uint32_t *)0xE0002FD0u)
#define FPB_PERIPHID4_REG                                    *((volatile uint32_t *)0xE0002FD0u)
#define FPB_PERIPHID4_ADDR                                   (0xE0002FD0u)
#define FPB_PERIPHID4_RESET                                  (0x00000004u)
        /* PERIPHID field */
        #define FPB_PERIPHID4_PERIPHID                       (0xFFFFFFFFu)
        #define FPB_PERIPHID4_PERIPHID_MASK                  (0xFFFFFFFFu)
        #define FPB_PERIPHID4_PERIPHID_BIT                   (0)
        #define FPB_PERIPHID4_PERIPHID_BITS                  (32)

#define FPB_PERIPHID5                                        *((volatile uint32_t *)0xE0002FD4u)
#define FPB_PERIPHID5_REG                                    *((volatile uint32_t *)0xE0002FD4u)
#define FPB_PERIPHID5_ADDR                                   (0xE0002FD4u)
#define FPB_PERIPHID5_RESET                                  (0x00000000u)
        /* PERIPHID field */
        #define FPB_PERIPHID5_PERIPHID                       (0xFFFFFFFFu)
        #define FPB_PERIPHID5_PERIPHID_MASK                  (0xFFFFFFFFu)
        #define FPB_PERIPHID5_PERIPHID_BIT                   (0)
        #define FPB_PERIPHID5_PERIPHID_BITS                  (32)

#define FPB_PERIPHID6                                        *((volatile uint32_t *)0xE0002FD8u)
#define FPB_PERIPHID6_REG                                    *((volatile uint32_t *)0xE0002FD8u)
#define FPB_PERIPHID6_ADDR                                   (0xE0002FD8u)
#define FPB_PERIPHID6_RESET                                  (0x00000000u)
        /* PERIPHID field */
        #define FPB_PERIPHID6_PERIPHID                       (0xFFFFFFFFu)
        #define FPB_PERIPHID6_PERIPHID_MASK                  (0xFFFFFFFFu)
        #define FPB_PERIPHID6_PERIPHID_BIT                   (0)
        #define FPB_PERIPHID6_PERIPHID_BITS                  (32)

#define FPB_PERIPHID7                                        *((volatile uint32_t *)0xE0002FDCu)
#define FPB_PERIPHID7_REG                                    *((volatile uint32_t *)0xE0002FDCu)
#define FPB_PERIPHID7_ADDR                                   (0xE0002FDCu)
#define FPB_PERIPHID7_RESET                                  (0x00000000u)
        /* PERIPHID field */
        #define FPB_PERIPHID7_PERIPHID                       (0xFFFFFFFFu)
        #define FPB_PERIPHID7_PERIPHID_MASK                  (0xFFFFFFFFu)
        #define FPB_PERIPHID7_PERIPHID_BIT                   (0)
        #define FPB_PERIPHID7_PERIPHID_BITS                  (32)

#define FPB_PERIPHID0                                        *((volatile uint32_t *)0xE0002FE0u)
#define FPB_PERIPHID0_REG                                    *((volatile uint32_t *)0xE0002FE0u)
#define FPB_PERIPHID0_ADDR                                   (0xE0002FE0u)
#define FPB_PERIPHID0_RESET                                  (0x00000003u)
        /* PERIPHID field */
        #define FPB_PERIPHID0_PERIPHID                       (0xFFFFFFFFu)
        #define FPB_PERIPHID0_PERIPHID_MASK                  (0xFFFFFFFFu)
        #define FPB_PERIPHID0_PERIPHID_BIT                   (0)
        #define FPB_PERIPHID0_PERIPHID_BITS                  (32)

#define FPB_PERIPHID1                                        *((volatile uint32_t *)0xE0002FE4u)
#define FPB_PERIPHID1_REG                                    *((volatile uint32_t *)0xE0002FE4u)
#define FPB_PERIPHID1_ADDR                                   (0xE0002FE4u)
#define FPB_PERIPHID1_RESET                                  (0x000000B0u)
        /* PERIPHID field */
        #define FPB_PERIPHID1_PERIPHID                       (0xFFFFFFFFu)
        #define FPB_PERIPHID1_PERIPHID_MASK                  (0xFFFFFFFFu)
        #define FPB_PERIPHID1_PERIPHID_BIT                   (0)
        #define FPB_PERIPHID1_PERIPHID_BITS                  (32)

