contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define FPB_PERIPHID2                                        *((volatile uint32_t *)0xE0002FE8u)
#define FPB_PERIPHID2_REG                                    *((volatile uint32_t *)0xE0002FE8u)
#define FPB_PERIPHID2_ADDR                                   (0xE0002FE8u)
#define FPB_PERIPHID2_RESET                                  (0x0000000Bu)
        /* PERIPHID field */
        #define FPB_PERIPHID2_PERIPHID                       (0xFFFFFFFFu)
        #define FPB_PERIPHID2_PERIPHID_MASK                  (0xFFFFFFFFu)
        #define FPB_PERIPHID2_PERIPHID_BIT                   (0)
        #define FPB_PERIPHID2_PERIPHID_BITS                  (32)

#define FPB_PERIPHID3                                        *((volatile uint32_t *)0xE0002FECu)
#define FPB_PERIPHID3_REG                                    *((volatile uint32_t *)0xE0002FECu)
#define FPB_PERIPHID3_ADDR                                   (0xE0002FECu)
#define FPB_PERIPHID3_RESET                                  (0x00000000u)
        /* PERIPHID field */
        #define FPB_PERIPHID3_PERIPHID                       (0xFFFFFFFFu)
        #define FPB_PERIPHID3_PERIPHID_MASK                  (0xFFFFFFFFu)
        #define FPB_PERIPHID3_PERIPHID_BIT                   (0)
        #define FPB_PERIPHID3_PERIPHID_BITS                  (32)

#define FPB_CELLID0                                          *((volatile uint32_t *)0xE0002FF0u)
#define FPB_CELLID0_REG                                      *((volatile uint32_t *)0xE0002FF0u)
#define FPB_CELLID0_ADDR                                     (0xE0002FF0u)
#define FPB_CELLID0_RESET                                    (0x0000000Du)
        /* CELLID field */
        #define FPB_CELLID0_CELLID                           (0xFFFFFFFFu)
        #define FPB_CELLID0_CELLID_MASK                      (0xFFFFFFFFu)
        #define FPB_CELLID0_CELLID_BIT                       (0)
        #define FPB_CELLID0_CELLID_BITS                      (32)

#define FPB_CELLID1                                          *((volatile uint32_t *)0xE0002FF4u)
#define FPB_CELLID1_REG                                      *((volatile uint32_t *)0xE0002FF4u)
#define FPB_CELLID1_ADDR                                     (0xE0002FF4u)
#define FPB_CELLID1_RESET                                    (0x000000E0u)
        /* CELLID field */
        #define FPB_CELLID1_CELLID                           (0xFFFFFFFFu)
        #define FPB_CELLID1_CELLID_MASK                      (0xFFFFFFFFu)
        #define FPB_CELLID1_CELLID_BIT                       (0)
        #define FPB_CELLID1_CELLID_BITS                      (32)

#define FPB_CELLID2                                          *((volatile uint32_t *)0xE0002FF8u)
#define FPB_CELLID2_REG                                      *((volatile uint32_t *)0xE0002FF8u)
#define FPB_CELLID2_ADDR                                     (0xE0002FF8u)
#define FPB_CELLID2_RESET                                    (0x00000005u)
        /* CELLID field */
        #define FPB_CELLID2_CELLID                           (0xFFFFFFFFu)
        #define FPB_CELLID2_CELLID_MASK                      (0xFFFFFFFFu)
        #define FPB_CELLID2_CELLID_BIT                       (0)
        #define FPB_CELLID2_CELLID_BITS                      (32)

#define FPB_CELLID3                                          *((volatile uint32_t *)0xE0002FFCu)
#define FPB_CELLID3_REG                                      *((volatile uint32_t *)0xE0002FFCu)
#define FPB_CELLID3_ADDR                                     (0xE0002FFCu)
#define FPB_CELLID3_RESET                                    (0x000000B1u)
        /* CELLID field */
        #define FPB_CELLID3_CELLID                           (0xFFFFFFFFu)
        #define FPB_CELLID3_CELLID_MASK                      (0xFFFFFFFFu)
        #define FPB_CELLID3_CELLID_BIT                       (0)
        #define FPB_CELLID3_CELLID_BITS                      (32)

/* NVIC block */
#define BLOCK_NVIC_BASE                                      (0xE000E000u)
#define BLOCK_NVIC_END                                       (0xE000EFFFu)
#define BLOCK_NVIC_SIZE                                      (BLOCK_NVIC_END - BLOCK_NVIC_BASE + 1)

#define NVIC_MCR                                             *((volatile uint32_t *)0xE000E000u)
#define NVIC_MCR_REG                                         *((volatile uint32_t *)0xE000E000u)
#define NVIC_MCR_ADDR                                        (0xE000E000u)
#define NVIC_MCR_RESET                                       (0x00000000u)

#define NVIC_ICTR                                            *((volatile uint32_t *)0xE000E004u)
#define NVIC_ICTR_REG                                        *((volatile uint32_t *)0xE000E004u)
#define NVIC_ICTR_ADDR                                       (0xE000E004u)
#define NVIC_ICTR_RESET                                      (0x00000000u)
        /* INTLINESNUM field */
        #define NVIC_ICTR_INTLINESNUM                        (0x0000001Fu)
        #define NVIC_ICTR_INTLINESNUM_MASK                   (0x0000001Fu)
        #define NVIC_ICTR_INTLINESNUM_BIT                    (0)
        #define NVIC_ICTR_INTLINESNUM_BITS                   (5)

#define ST_CSR                                               *((volatile uint32_t *)0xE000E010u)
#define ST_CSR_REG                                           *((volatile uint32_t *)0xE000E010u)
#define ST_CSR_ADDR                                          (0xE000E010u)
#define ST_CSR_RESET                                         (0x00000000u)
        /* COUNTFLAG field */
        #define ST_CSR_COUNTFLAG                             (0x00010000u)
        #define ST_CSR_COUNTFLAG_MASK                        (0x00010000u)
        #define ST_CSR_COUNTFLAG_BIT                         (16)
        #define ST_CSR_COUNTFLAG_BITS                        (1)
        /* CLKSOURCE field */
        #define ST_CSR_CLKSOURCE                             (0x00000004u)
        #define ST_CSR_CLKSOURCE_MASK                        (0x00000004u)
        #define ST_CSR_CLKSOURCE_BIT                         (2)
        #define ST_CSR_CLKSOURCE_BITS                        (1)
        /* TICKINT field */
        #define ST_CSR_TICKINT                               (0x00000002u)
        #define ST_CSR_TICKINT_MASK                          (0x00000002u)
        #define ST_CSR_TICKINT_BIT                           (1)
        #define ST_CSR_TICKINT_BITS                          (1)
        /* ENABLE field */
        #define ST_CSR_ENABLE                                (0x00000001u)
        #define ST_CSR_ENABLE_MASK                           (0x00000001u)
        #define ST_CSR_ENABLE_BIT                            (0)
        #define ST_CSR_ENABLE_BITS                           (1)

#define ST_RVR                                               *((volatile uint32_t *)0xE000E014u)
#define ST_RVR_REG                                           *((volatile uint32_t *)0xE000E014u)
#define ST_RVR_ADDR                                          (0xE000E014u)
#define ST_RVR_RESET                                         (0x00000000u)
        /* RELOAD field */
        #define ST_RVR_RELOAD                                (0x00FFFFFFu)
        #define ST_RVR_RELOAD_MASK                           (0x00FFFFFFu)
        #define ST_RVR_RELOAD_BIT                            (0)
        #define ST_RVR_RELOAD_BITS                           (24)

