contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define NVIC_IPR_11to8                                       *((volatile uint32_t *)0xE000E408u)
#define NVIC_IPR_11to8_REG                                   *((volatile uint32_t *)0xE000E408u)
#define NVIC_IPR_11to8_ADDR                                  (0xE000E408u)
#define NVIC_IPR_11to8_RESET                                 (0x00000000u)
        /* PRI_11 field */
        #define NVIC_IPR_11to8_PRI_11                        (0xFF000000u)
        #define NVIC_IPR_11to8_PRI_11_MASK                   (0xFF000000u)
        #define NVIC_IPR_11to8_PRI_11_BIT                    (24)
        #define NVIC_IPR_11to8_PRI_11_BITS                   (8)
        /* PRI_10 field */
        #define NVIC_IPR_11to8_PRI_10                        (0x00FF0000u)
        #define NVIC_IPR_11to8_PRI_10_MASK                   (0x00FF0000u)
        #define NVIC_IPR_11to8_PRI_10_BIT                    (16)
        #define NVIC_IPR_11to8_PRI_10_BITS                   (8)
        /* PRI_9 field */
        #define NVIC_IPR_11to8_PRI_9                         (0x0000FF00u)
        #define NVIC_IPR_11to8_PRI_9_MASK                    (0x0000FF00u)
        #define NVIC_IPR_11to8_PRI_9_BIT                     (8)
        #define NVIC_IPR_11to8_PRI_9_BITS                    (8)
        /* PRI_8 field */
        #define NVIC_IPR_11to8_PRI_8                         (0x000000FFu)
        #define NVIC_IPR_11to8_PRI_8_MASK                    (0x000000FFu)
        #define NVIC_IPR_11to8_PRI_8_BIT                     (0)
        #define NVIC_IPR_11to8_PRI_8_BITS                    (8)

#define NVIC_IPR_15to12                                      *((volatile uint32_t *)0xE000E40Cu)
#define NVIC_IPR_15to12_REG                                  *((volatile uint32_t *)0xE000E40Cu)
#define NVIC_IPR_15to12_ADDR                                 (0xE000E40Cu)
#define NVIC_IPR_15to12_RESET                                (0x00000000u)
        /* PRI_15 field */
        #define NVIC_IPR_15to12_PRI_15                       (0xFF000000u)
        #define NVIC_IPR_15to12_PRI_15_MASK                  (0xFF000000u)
        #define NVIC_IPR_15to12_PRI_15_BIT                   (24)
        #define NVIC_IPR_15to12_PRI_15_BITS                  (8)
        /* PRI_14 field */
        #define NVIC_IPR_15to12_PRI_14                       (0x00FF0000u)
        #define NVIC_IPR_15to12_PRI_14_MASK                  (0x00FF0000u)
        #define NVIC_IPR_15to12_PRI_14_BIT                   (16)
        #define NVIC_IPR_15to12_PRI_14_BITS                  (8)
        /* PRI_13 field */
        #define NVIC_IPR_15to12_PRI_13                       (0x0000FF00u)
        #define NVIC_IPR_15to12_PRI_13_MASK                  (0x0000FF00u)
        #define NVIC_IPR_15to12_PRI_13_BIT                   (8)
        #define NVIC_IPR_15to12_PRI_13_BITS                  (8)
        /* PRI_12 field */
        #define NVIC_IPR_15to12_PRI_12                       (0x000000FFu)
        #define NVIC_IPR_15to12_PRI_12_MASK                  (0x000000FFu)
        #define NVIC_IPR_15to12_PRI_12_BIT                   (0)
        #define NVIC_IPR_15to12_PRI_12_BITS                  (8)

#define NVIC_IPR_19to16                                      *((volatile uint32_t *)0xE000E410u)
#define NVIC_IPR_19to16_REG                                  *((volatile uint32_t *)0xE000E410u)
#define NVIC_IPR_19to16_ADDR                                 (0xE000E410u)
#define NVIC_IPR_19to16_RESET                                (0x00000000u)
        /* PRI_19 field */
        #define NVIC_IPR_19to16_PRI_19                       (0xFF000000u)
        #define NVIC_IPR_19to16_PRI_19_MASK                  (0xFF000000u)
        #define NVIC_IPR_19to16_PRI_19_BIT                   (24)
        #define NVIC_IPR_19to16_PRI_19_BITS                  (8)
        /* PRI_18 field */
        #define NVIC_IPR_19to16_PRI_18                       (0x00FF0000u)
        #define NVIC_IPR_19to16_PRI_18_MASK                  (0x00FF0000u)
        #define NVIC_IPR_19to16_PRI_18_BIT                   (16)
        #define NVIC_IPR_19to16_PRI_18_BITS                  (8)
        /* PRI_17 field */
        #define NVIC_IPR_19to16_PRI_17                       (0x0000FF00u)
        #define NVIC_IPR_19to16_PRI_17_MASK                  (0x0000FF00u)
        #define NVIC_IPR_19to16_PRI_17_BIT                   (8)
        #define NVIC_IPR_19to16_PRI_17_BITS                  (8)
        /* PRI_16 field */
        #define NVIC_IPR_19to16_PRI_16                       (0x000000FFu)
        #define NVIC_IPR_19to16_PRI_16_MASK                  (0x000000FFu)
        #define NVIC_IPR_19to16_PRI_16_BIT                   (0)
        #define NVIC_IPR_19to16_PRI_16_BITS                  (8)

#define SCS_CPUID                                            *((volatile uint32_t *)0xE000ED00u)
#define SCS_CPUID_REG                                        *((volatile uint32_t *)0xE000ED00u)
#define SCS_CPUID_ADDR                                       (0xE000ED00u)
#define SCS_CPUID_RESET                                      (0x411FC231u)
        /* IMPLEMENTER field */
        #define SCS_CPUID_IMPLEMENTER                        (0xFF000000u)
        #define SCS_CPUID_IMPLEMENTER_MASK                   (0xFF000000u)
        #define SCS_CPUID_IMPLEMENTER_BIT                    (24)
        #define SCS_CPUID_IMPLEMENTER_BITS                   (8)
        /* VARIANT field */
        #define SCS_CPUID_VARIANT                            (0x00F00000u)
        #define SCS_CPUID_VARIANT_MASK                       (0x00F00000u)
        #define SCS_CPUID_VARIANT_BIT                        (20)
        #define SCS_CPUID_VARIANT_BITS                       (4)
        /* CONSTANT field */
        #define SCS_CPUID_CONSTANT                           (0x000F0000u)
        #define SCS_CPUID_CONSTANT_MASK                      (0x000F0000u)
        #define SCS_CPUID_CONSTANT_BIT                       (16)
        #define SCS_CPUID_CONSTANT_BITS                      (4)
        /* PARTNO field */
        #define SCS_CPUID_PARTNO                             (0x0000FFF0u)
        #define SCS_CPUID_PARTNO_MASK                        (0x0000FFF0u)
        #define SCS_CPUID_PARTNO_BIT                         (4)
        #define SCS_CPUID_PARTNO_BITS                        (12)
        /* REVISION field */
        #define SCS_CPUID_REVISION                           (0x0000000Fu)
        #define SCS_CPUID_REVISION_MASK                      (0x0000000Fu)
        #define SCS_CPUID_REVISION_BIT                       (0)
        #define SCS_CPUID_REVISION_BITS                      (4)

#define SCS_ICSR                                             *((volatile uint32_t *)0xE000ED04u)
#define SCS_ICSR_REG                                         *((volatile uint32_t *)0xE000ED04u)
#define SCS_ICSR_ADDR                                        (0xE000ED04u)
#define SCS_ICSR_RESET                                       (0x00000000u)
        /* NMIPENDSET field */
        #define SCS_ICSR_NMIPENDSET                          (0x80000000u)
        #define SCS_ICSR_NMIPENDSET_MASK                     (0x80000000u)
        #define SCS_ICSR_NMIPENDSET_BIT                      (31)
        #define SCS_ICSR_NMIPENDSET_BITS                     (1)
        /* PENDSVSET field */
        #define SCS_ICSR_PENDSVSET                           (0x10000000u)
        #define SCS_ICSR_PENDSVSET_MASK                      (0x10000000u)
        #define SCS_ICSR_PENDSVSET_BIT                       (28)
        #define SCS_ICSR_PENDSVSET_BITS                      (1)
        /* PENDSVCLR field */
        #define SCS_ICSR_PENDSVCLR                           (0x08000000u)
        #define SCS_ICSR_PENDSVCLR_MASK                      (0x08000000u)
        #define SCS_ICSR_PENDSVCLR_BIT                       (27)
        #define SCS_ICSR_PENDSVCLR_BITS                      (1)
        /* PENDSTSET field */
        #define SCS_ICSR_PENDSTSET                           (0x04000000u)
        #define SCS_ICSR_PENDSTSET_MASK                      (0x04000000u)
        #define SCS_ICSR_PENDSTSET_BIT                       (26)
        #define SCS_ICSR_PENDSTSET_BITS                      (1)
        /* PENDSTCLR field */
        #define SCS_ICSR_PENDSTCLR                           (0x02000000u)
        #define SCS_ICSR_PENDSTCLR_MASK                      (0x02000000u)
        #define SCS_ICSR_PENDSTCLR_BIT                       (25)
        #define SCS_ICSR_PENDSTCLR_BITS                      (1)
        /* ISRPREEMPT field */
        #define SCS_ICSR_ISRPREEMPT                          (0x00800000u)
        #define SCS_ICSR_ISRPREEMPT_MASK                     (0x00800000u)
        #define SCS_ICSR_ISRPREEMPT_BIT                      (23)
        #define SCS_ICSR_ISRPREEMPT_BITS                     (1)
        /* ISRPENDING field */
        #define SCS_ICSR_ISRPENDING                          (0x00400000u)
        #define SCS_ICSR_ISRPENDING_MASK                     (0x00400000u)
        #define SCS_ICSR_ISRPENDING_BIT                      (22)
        #define SCS_ICSR_ISRPENDING_BITS                     (1)
        /* VECTPENDING field */
        #define SCS_ICSR_VECTPENDING                         (0x001FF000u)
        #define SCS_ICSR_VECTPENDING_MASK                    (0x001FF000u)
        #define SCS_ICSR_VECTPENDING_BIT                     (12)
        #define SCS_ICSR_VECTPENDING_BITS                    (9)
        /* RETTOBASE field */
        #define SCS_ICSR_RETTOBASE                           (0x00000800u)
        #define SCS_ICSR_RETTOBASE_MASK                      (0x00000800u)
        #define SCS_ICSR_RETTOBASE_BIT                       (11)
        #define SCS_ICSR_RETTOBASE_BITS                      (1)
        /* VECACTIVE field */
        #define SCS_ICSR_VECACTIVE                           (0x000001FFu)
        #define SCS_ICSR_VECACTIVE_MASK                      (0x000001FFu)
        #define SCS_ICSR_VECACTIVE_BIT                       (0)
        #define SCS_ICSR_VECACTIVE_BITS                      (9)

