contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define SCS_VTOR                                             *((volatile uint32_t *)0xE000ED08u)
#define SCS_VTOR_REG                                         *((volatile uint32_t *)0xE000ED08u)
#define SCS_VTOR_ADDR                                        (0xE000ED08u)
#define SCS_VTOR_RESET                                       (0x00000000u)
        /* TBLBASE field */
        #define SCS_VTOR_TBLBASE                             (0x20000000u)
        #define SCS_VTOR_TBLBASE_MASK                        (0x20000000u)
        #define SCS_VTOR_TBLBASE_BIT                         (29)
        #define SCS_VTOR_TBLBASE_BITS                        (1)
        /* TBLOFF field */
        #define SCS_VTOR_TBLOFF                              (0x1FFFFF00u)
        #define SCS_VTOR_TBLOFF_MASK                         (0x1FFFFF00u)
        #define SCS_VTOR_TBLOFF_BIT                          (8)
        #define SCS_VTOR_TBLOFF_BITS                         (21)

#define SCS_AIRCR                                            *((volatile uint32_t *)0xE000ED0Cu)
#define SCS_AIRCR_REG                                        *((volatile uint32_t *)0xE000ED0Cu)
#define SCS_AIRCR_ADDR                                       (0xE000ED0Cu)
#define SCS_AIRCR_RESET                                      (0x00000000u)
        /* VECTKEYSTAT field */
        #define SCS_AIRCR_VECTKEYSTAT                        (0xFFFF0000u)
        #define SCS_AIRCR_VECTKEYSTAT_MASK                   (0xFFFF0000u)
        #define SCS_AIRCR_VECTKEYSTAT_BIT                    (16)
        #define SCS_AIRCR_VECTKEYSTAT_BITS                   (16)
        /* VECTKEY field */
        #define SCS_AIRCR_VECTKEY                            (0xFFFF0000u)
        #define SCS_AIRCR_VECTKEY_MASK                       (0xFFFF0000u)
        #define SCS_AIRCR_VECTKEY_BIT                        (16)
        #define SCS_AIRCR_VECTKEY_BITS                       (16)
        /* ENDIANESS field */
        #define SCS_AIRCR_ENDIANESS                          (0x00008000u)
        #define SCS_AIRCR_ENDIANESS_MASK                     (0x00008000u)
        #define SCS_AIRCR_ENDIANESS_BIT                      (15)
        #define SCS_AIRCR_ENDIANESS_BITS                     (1)
        /* PRIGROUP field */
        #define SCS_AIRCR_PRIGROUP                           (0x00000700u)
        #define SCS_AIRCR_PRIGROUP_MASK                      (0x00000700u)
        #define SCS_AIRCR_PRIGROUP_BIT                       (8)
        #define SCS_AIRCR_PRIGROUP_BITS                      (3)
        /* SYSRESETREQ field */
        #define SCS_AIRCR_SYSRESETREQ                        (0x00000004u)
        #define SCS_AIRCR_SYSRESETREQ_MASK                   (0x00000004u)
        #define SCS_AIRCR_SYSRESETREQ_BIT                    (2)
        #define SCS_AIRCR_SYSRESETREQ_BITS                   (1)
        /* VECTCLRACTIVE field */
        #define SCS_AIRCR_VECTCLRACTIVE                      (0x00000002u)
        #define SCS_AIRCR_VECTCLRACTIVE_MASK                 (0x00000002u)
        #define SCS_AIRCR_VECTCLRACTIVE_BIT                  (1)
        #define SCS_AIRCR_VECTCLRACTIVE_BITS                 (1)
        /* VECTRESET field */
        #define SCS_AIRCR_VECTRESET                          (0x00000001u)
        #define SCS_AIRCR_VECTRESET_MASK                     (0x00000001u)
        #define SCS_AIRCR_VECTRESET_BIT                      (0)
        #define SCS_AIRCR_VECTRESET_BITS                     (1)

#define SCS_SCR                                              *((volatile uint32_t *)0xE000ED10u)
#define SCS_SCR_REG                                          *((volatile uint32_t *)0xE000ED10u)
#define SCS_SCR_ADDR                                         (0xE000ED10u)
#define SCS_SCR_RESET                                        (0x00000000u)
        /* SEVONPEND field */
        #define SCS_SCR_SEVONPEND                            (0x00000010u)
        #define SCS_SCR_SEVONPEND_MASK                       (0x00000010u)
        #define SCS_SCR_SEVONPEND_BIT                        (4)
        #define SCS_SCR_SEVONPEND_BITS                       (1)
        /* SLEEPDEEP field */
        #define SCS_SCR_SLEEPDEEP                            (0x00000004u)
        #define SCS_SCR_SLEEPDEEP_MASK                       (0x00000004u)
        #define SCS_SCR_SLEEPDEEP_BIT                        (2)
        #define SCS_SCR_SLEEPDEEP_BITS                       (1)
        /* SLEEPONEXIT field */
        #define SCS_SCR_SLEEPONEXIT                          (0x00000002u)
        #define SCS_SCR_SLEEPONEXIT_MASK                     (0x00000002u)
        #define SCS_SCR_SLEEPONEXIT_BIT                      (1)
        #define SCS_SCR_SLEEPONEXIT_BITS                     (1)

#define SCS_CCR                                              *((volatile uint32_t *)0xE000ED14u)
#define SCS_CCR_REG                                          *((volatile uint32_t *)0xE000ED14u)
#define SCS_CCR_ADDR                                         (0xE000ED14u)
#define SCS_CCR_RESET                                        (0x00000000u)
        /* STKALIGN field */
        #define SCS_CCR_STKALIGN                             (0x00000200u)
        #define SCS_CCR_STKALIGN_MASK                        (0x00000200u)
        #define SCS_CCR_STKALIGN_BIT                         (9)
        #define SCS_CCR_STKALIGN_BITS                        (1)
        /* BFHFNMIGN field */
        #define SCS_CCR_BFHFNMIGN                            (0x00000100u)
        #define SCS_CCR_BFHFNMIGN_MASK                       (0x00000100u)
        #define SCS_CCR_BFHFNMIGN_BIT                        (8)
        #define SCS_CCR_BFHFNMIGN_BITS                       (1)
        /* DIV_0_TRP field */
        #define SCS_CCR_DIV_0_TRP                            (0x00000010u)
        #define SCS_CCR_DIV_0_TRP_MASK                       (0x00000010u)
        #define SCS_CCR_DIV_0_TRP_BIT                        (4)
        #define SCS_CCR_DIV_0_TRP_BITS                       (1)
        /* UNALIGN_TRP field */
        #define SCS_CCR_UNALIGN_TRP                          (0x00000008u)
        #define SCS_CCR_UNALIGN_TRP_MASK                     (0x00000008u)
        #define SCS_CCR_UNALIGN_TRP_BIT                      (3)
        #define SCS_CCR_UNALIGN_TRP_BITS                     (1)
        /* USERSETMPEND field */
        #define SCS_CCR_USERSETMPEND                         (0x00000002u)
        #define SCS_CCR_USERSETMPEND_MASK                    (0x00000002u)
        #define SCS_CCR_USERSETMPEND_BIT                     (1)
        #define SCS_CCR_USERSETMPEND_BITS                    (1)
        /* NONBASETHRDENA field */
        #define SCS_CCR_NONBASETHRDENA                       (0x00000001u)
        #define SCS_CCR_NONBASETHRDENA_MASK                  (0x00000001u)
        #define SCS_CCR_NONBASETHRDENA_BIT                   (0)
        #define SCS_CCR_NONBASETHRDENA_BITS                  (1)

#define SCS_SHPR_7to4                                        *((volatile uint32_t *)0xE000ED18u)
#define SCS_SHPR_7to4_REG                                    *((volatile uint32_t *)0xE000ED18u)
#define SCS_SHPR_7to4_ADDR                                   (0xE000ED18u)
#define SCS_SHPR_7to4_RESET                                  (0x00000000u)
        /* PRI_7 field */
        #define SCS_SHPR_7to4_PRI_7                          (0xFF000000u)
        #define SCS_SHPR_7to4_PRI_7_MASK                     (0xFF000000u)
        #define SCS_SHPR_7to4_PRI_7_BIT                      (24)
        #define SCS_SHPR_7to4_PRI_7_BITS                     (8)
        /* PRI_6 field */
        #define SCS_SHPR_7to4_PRI_6                          (0x00FF0000u)
        #define SCS_SHPR_7to4_PRI_6_MASK                     (0x00FF0000u)
        #define SCS_SHPR_7to4_PRI_6_BIT                      (16)
        #define SCS_SHPR_7to4_PRI_6_BITS                     (8)
        /* PRI_5 field */
        #define SCS_SHPR_7to4_PRI_5                          (0x0000FF00u)
        #define SCS_SHPR_7to4_PRI_5_MASK                     (0x0000FF00u)
        #define SCS_SHPR_7to4_PRI_5_BIT                      (8)
        #define SCS_SHPR_7to4_PRI_5_BITS                     (8)
        /* PRI_4 field */
        #define SCS_SHPR_7to4_PRI_4                          (0x000000FFu)
        #define SCS_SHPR_7to4_PRI_4_MASK                     (0x000000FFu)
        #define SCS_SHPR_7to4_PRI_4_BIT                      (0)
        #define SCS_SHPR_7to4_PRI_4_BITS                     (8)

#define SCS_SHPR_11to8                                       *((volatile uint32_t *)0xE000ED1Cu)
#define SCS_SHPR_11to8_REG                                   *((volatile uint32_t *)0xE000ED1Cu)
#define SCS_SHPR_11to8_ADDR                                  (0xE000ED1Cu)
#define SCS_SHPR_11to8_RESET                                 (0x00000000u)
        /* PRI_11 field */
        #define SCS_SHPR_11to8_PRI_11                        (0xFF000000u)
        #define SCS_SHPR_11to8_PRI_11_MASK                   (0xFF000000u)
        #define SCS_SHPR_11to8_PRI_11_BIT                    (24)
        #define SCS_SHPR_11to8_PRI_11_BITS                   (8)
        /* PRI_10 field */
        #define SCS_SHPR_11to8_PRI_10                        (0x00FF0000u)
        #define SCS_SHPR_11to8_PRI_10_MASK                   (0x00FF0000u)
        #define SCS_SHPR_11to8_PRI_10_BIT                    (16)
        #define SCS_SHPR_11to8_PRI_10_BITS                   (8)
        /* PRI_9 field */
        #define SCS_SHPR_11to8_PRI_9                         (0x0000FF00u)
        #define SCS_SHPR_11to8_PRI_9_MASK                    (0x0000FF00u)
        #define SCS_SHPR_11to8_PRI_9_BIT                     (8)
        #define SCS_SHPR_11to8_PRI_9_BITS                    (8)
        /* PRI_8 field */
        #define SCS_SHPR_11to8_PRI_8                         (0x000000FFu)
        #define SCS_SHPR_11to8_PRI_8_MASK                    (0x000000FFu)
        #define SCS_SHPR_11to8_PRI_8_BIT                     (0)
        #define SCS_SHPR_11to8_PRI_8_BITS                    (8)

#define SCS_SHPR_15to12                                      *((volatile uint32_t *)0xE000ED20u)
#define SCS_SHPR_15to12_REG                                  *((volatile uint32_t *)0xE000ED20u)
#define SCS_SHPR_15to12_ADDR                                 (0xE000ED20u)
#define SCS_SHPR_15to12_RESET                                (0x00000000u)
        /* PRI_15 field */
        #define SCS_SHPR_15to12_PRI_15                       (0xFF000000u)
        #define SCS_SHPR_15to12_PRI_15_MASK                  (0xFF000000u)
        #define SCS_SHPR_15to12_PRI_15_BIT                   (24)
        #define SCS_SHPR_15to12_PRI_15_BITS                  (8)
        /* PRI_14 field */
        #define SCS_SHPR_15to12_PRI_14                       (0x00FF0000u)
        #define SCS_SHPR_15to12_PRI_14_MASK                  (0x00FF0000u)
        #define SCS_SHPR_15to12_PRI_14_BIT                   (16)
        #define SCS_SHPR_15to12_PRI_14_BITS                  (8)
        /* PRI_13 field */
        #define SCS_SHPR_15to12_PRI_13                       (0x0000FF00u)
        #define SCS_SHPR_15to12_PRI_13_MASK                  (0x0000FF00u)
        #define SCS_SHPR_15to12_PRI_13_BIT                   (8)
        #define SCS_SHPR_15to12_PRI_13_BITS                  (8)
        /* PRI_12 field */
        #define SCS_SHPR_15to12_PRI_12                       (0x000000FFu)
        #define SCS_SHPR_15to12_PRI_12_MASK                  (0x000000FFu)
        #define SCS_SHPR_15to12_PRI_12_BIT                   (0)
        #define SCS_SHPR_15to12_PRI_12_BITS                  (8)

