contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define SCS_SHCSR                                            *((volatile uint32_t *)0xE000ED24u)
#define SCS_SHCSR_REG                                        *((volatile uint32_t *)0xE000ED24u)
#define SCS_SHCSR_ADDR                                       (0xE000ED24u)
#define SCS_SHCSR_RESET                                      (0x00000000u)
        /* USGFAULTENA field */
        #define SCS_SHCSR_USGFAULTENA                        (0x00040000u)
        #define SCS_SHCSR_USGFAULTENA_MASK                   (0x00040000u)
        #define SCS_SHCSR_USGFAULTENA_BIT                    (18)
        #define SCS_SHCSR_USGFAULTENA_BITS                   (1)
        /* BUSFAULTENA field */
        #define SCS_SHCSR_BUSFAULTENA                        (0x00020000u)
        #define SCS_SHCSR_BUSFAULTENA_MASK                   (0x00020000u)
        #define SCS_SHCSR_BUSFAULTENA_BIT                    (17)
        #define SCS_SHCSR_BUSFAULTENA_BITS                   (1)
        /* MEMFAULTENA field */
        #define SCS_SHCSR_MEMFAULTENA                        (0x00010000u)
        #define SCS_SHCSR_MEMFAULTENA_MASK                   (0x00010000u)
        #define SCS_SHCSR_MEMFAULTENA_BIT                    (16)
        #define SCS_SHCSR_MEMFAULTENA_BITS                   (1)
        /* SVCALLPENDED field */
        #define SCS_SHCSR_SVCALLPENDED                       (0x00008000u)
        #define SCS_SHCSR_SVCALLPENDED_MASK                  (0x00008000u)
        #define SCS_SHCSR_SVCALLPENDED_BIT                   (15)
        #define SCS_SHCSR_SVCALLPENDED_BITS                  (1)
        /* BUSFAULTPENDED field */
        #define SCS_SHCSR_BUSFAULTPENDED                     (0x00004000u)
        #define SCS_SHCSR_BUSFAULTPENDED_MASK                (0x00004000u)
        #define SCS_SHCSR_BUSFAULTPENDED_BIT                 (14)
        #define SCS_SHCSR_BUSFAULTPENDED_BITS                (1)
        /* MEMFAULTPENDED field */
        #define SCS_SHCSR_MEMFAULTPENDED                     (0x00002000u)
        #define SCS_SHCSR_MEMFAULTPENDED_MASK                (0x00002000u)
        #define SCS_SHCSR_MEMFAULTPENDED_BIT                 (13)
        #define SCS_SHCSR_MEMFAULTPENDED_BITS                (1)
        /* USGFAULTPENDED field */
        #define SCS_SHCSR_USGFAULTPENDED                     (0x00001000u)
        #define SCS_SHCSR_USGFAULTPENDED_MASK                (0x00001000u)
        #define SCS_SHCSR_USGFAULTPENDED_BIT                 (12)
        #define SCS_SHCSR_USGFAULTPENDED_BITS                (1)
        /* SYSTICKACT field */
        #define SCS_SHCSR_SYSTICKACT                         (0x00000800u)
        #define SCS_SHCSR_SYSTICKACT_MASK                    (0x00000800u)
        #define SCS_SHCSR_SYSTICKACT_BIT                     (11)
        #define SCS_SHCSR_SYSTICKACT_BITS                    (1)
        /* PENDSVACT field */
        #define SCS_SHCSR_PENDSVACT                          (0x00000400u)
        #define SCS_SHCSR_PENDSVACT_MASK                     (0x00000400u)
        #define SCS_SHCSR_PENDSVACT_BIT                      (10)
        #define SCS_SHCSR_PENDSVACT_BITS                     (1)
        /* MONITORACT field */
        #define SCS_SHCSR_MONITORACT                         (0x00000100u)
        #define SCS_SHCSR_MONITORACT_MASK                    (0x00000100u)
        #define SCS_SHCSR_MONITORACT_BIT                     (8)
        #define SCS_SHCSR_MONITORACT_BITS                    (1)
        /* SVCALLACT field */
        #define SCS_SHCSR_SVCALLACT                          (0x00000080u)
        #define SCS_SHCSR_SVCALLACT_MASK                     (0x00000080u)
        #define SCS_SHCSR_SVCALLACT_BIT                      (7)
        #define SCS_SHCSR_SVCALLACT_BITS                     (1)
        /* USGFAULTACT field */
        #define SCS_SHCSR_USGFAULTACT                        (0x00000008u)
        #define SCS_SHCSR_USGFAULTACT_MASK                   (0x00000008u)
        #define SCS_SHCSR_USGFAULTACT_BIT                    (3)
        #define SCS_SHCSR_USGFAULTACT_BITS                   (1)
        /* BUSFAULTACT field */
        #define SCS_SHCSR_BUSFAULTACT                        (0x00000002u)
        #define SCS_SHCSR_BUSFAULTACT_MASK                   (0x00000002u)
        #define SCS_SHCSR_BUSFAULTACT_BIT                    (1)
        #define SCS_SHCSR_BUSFAULTACT_BITS                   (1)
        /* MEMFAULTACT field */
        #define SCS_SHCSR_MEMFAULTACT                        (0x00000001u)
        #define SCS_SHCSR_MEMFAULTACT_MASK                   (0x00000001u)
        #define SCS_SHCSR_MEMFAULTACT_BIT                    (0)
        #define SCS_SHCSR_MEMFAULTACT_BITS                   (1)

#define SCS_CFSR                                             *((volatile uint32_t *)0xE000ED28u)
#define SCS_CFSR_REG                                         *((volatile uint32_t *)0xE000ED28u)
#define SCS_CFSR_ADDR                                        (0xE000ED28u)
#define SCS_CFSR_RESET                                       (0x00000000u)
        /* DIVBYZERO field */
        #define SCS_CFSR_DIVBYZERO                           (0x02000000u)
        #define SCS_CFSR_DIVBYZERO_MASK                      (0x02000000u)
        #define SCS_CFSR_DIVBYZERO_BIT                       (25)
        #define SCS_CFSR_DIVBYZERO_BITS                      (1)
        /* UNALIGNED field */
        #define SCS_CFSR_UNALIGNED                           (0x01000000u)
        #define SCS_CFSR_UNALIGNED_MASK                      (0x01000000u)
        #define SCS_CFSR_UNALIGNED_BIT                       (24)
        #define SCS_CFSR_UNALIGNED_BITS                      (1)
        /* NOCP field */
        #define SCS_CFSR_NOCP                                (0x00080000u)
        #define SCS_CFSR_NOCP_MASK                           (0x00080000u)
        #define SCS_CFSR_NOCP_BIT                            (19)
        #define SCS_CFSR_NOCP_BITS                           (1)
        /* INVPC field */
        #define SCS_CFSR_INVPC                               (0x00040000u)
        #define SCS_CFSR_INVPC_MASK                          (0x00040000u)
        #define SCS_CFSR_INVPC_BIT                           (18)
        #define SCS_CFSR_INVPC_BITS                          (1)
        /* INVSTATE field */
        #define SCS_CFSR_INVSTATE                            (0x00020000u)
        #define SCS_CFSR_INVSTATE_MASK                       (0x00020000u)
        #define SCS_CFSR_INVSTATE_BIT                        (17)
        #define SCS_CFSR_INVSTATE_BITS                       (1)
        /* UNDEFINSTR field */
        #define SCS_CFSR_UNDEFINSTR                          (0x00010000u)
        #define SCS_CFSR_UNDEFINSTR_MASK                     (0x00010000u)
        #define SCS_CFSR_UNDEFINSTR_BIT                      (16)
        #define SCS_CFSR_UNDEFINSTR_BITS                     (1)
        /* BFARVALID field */
        #define SCS_CFSR_BFARVALID                           (0x00008000u)
        #define SCS_CFSR_BFARVALID_MASK                      (0x00008000u)
        #define SCS_CFSR_BFARVALID_BIT                       (15)
        #define SCS_CFSR_BFARVALID_BITS                      (1)
        /* STKERR field */
        #define SCS_CFSR_STKERR                              (0x00001000u)
        #define SCS_CFSR_STKERR_MASK                         (0x00001000u)
        #define SCS_CFSR_STKERR_BIT                          (12)
        #define SCS_CFSR_STKERR_BITS                         (1)
        /* UNSTKERR field */
        #define SCS_CFSR_UNSTKERR                            (0x00000800u)
        #define SCS_CFSR_UNSTKERR_MASK                       (0x00000800u)
        #define SCS_CFSR_UNSTKERR_BIT                        (11)
        #define SCS_CFSR_UNSTKERR_BITS                       (1)
        /* IMPRECISERR field */
        #define SCS_CFSR_IMPRECISERR                         (0x00000400u)
        #define SCS_CFSR_IMPRECISERR_MASK                    (0x00000400u)
        #define SCS_CFSR_IMPRECISERR_BIT                     (10)
        #define SCS_CFSR_IMPRECISERR_BITS                    (1)
        /* PRECISERR field */
        #define SCS_CFSR_PRECISERR                           (0x00000200u)
        #define SCS_CFSR_PRECISERR_MASK                      (0x00000200u)
        #define SCS_CFSR_PRECISERR_BIT                       (9)
        #define SCS_CFSR_PRECISERR_BITS                      (1)
        /* IBUSERR field */
        #define SCS_CFSR_IBUSERR                             (0x00000100u)
        #define SCS_CFSR_IBUSERR_MASK                        (0x00000100u)
        #define SCS_CFSR_IBUSERR_BIT                         (8)
        #define SCS_CFSR_IBUSERR_BITS                        (1)
        /* MMARVALID field */
        #define SCS_CFSR_MMARVALID                           (0x00000080u)
        #define SCS_CFSR_MMARVALID_MASK                      (0x00000080u)
        #define SCS_CFSR_MMARVALID_BIT                       (7)
        #define SCS_CFSR_MMARVALID_BITS                      (1)
        /* MSTKERR field */
        #define SCS_CFSR_MSTKERR                             (0x00000010u)
        #define SCS_CFSR_MSTKERR_MASK                        (0x00000010u)
        #define SCS_CFSR_MSTKERR_BIT                         (4)
        #define SCS_CFSR_MSTKERR_BITS                        (1)
        /* MUNSTKERR field */
        #define SCS_CFSR_MUNSTKERR                           (0x00000008u)
        #define SCS_CFSR_MUNSTKERR_MASK                      (0x00000008u)
        #define SCS_CFSR_MUNSTKERR_BIT                       (3)
        #define SCS_CFSR_MUNSTKERR_BITS                      (1)
        /* DACCVIOL field */
        #define SCS_CFSR_DACCVIOL                            (0x00000002u)
        #define SCS_CFSR_DACCVIOL_MASK                       (0x00000002u)
        #define SCS_CFSR_DACCVIOL_BIT                        (1)
        #define SCS_CFSR_DACCVIOL_BITS                       (1)
        /* IACCVIOL field */
        #define SCS_CFSR_IACCVIOL                            (0x00000001u)
        #define SCS_CFSR_IACCVIOL_MASK                       (0x00000001u)
        #define SCS_CFSR_IACCVIOL_BIT                        (0)
        #define SCS_CFSR_IACCVIOL_BITS                       (1)

#define SCS_HFSR                                             *((volatile uint32_t *)0xE000ED2Cu)
#define SCS_HFSR_REG                                         *((volatile uint32_t *)0xE000ED2Cu)
#define SCS_HFSR_ADDR                                        (0xE000ED2Cu)
#define SCS_HFSR_RESET                                       (0x00000000u)
        /* DEBUGEVT field */
        #define SCS_HFSR_DEBUGEVT                            (0x80000000u)
        #define SCS_HFSR_DEBUGEVT_MASK                       (0x80000000u)
        #define SCS_HFSR_DEBUGEVT_BIT                        (31)
        #define SCS_HFSR_DEBUGEVT_BITS                       (1)
        /* FORCED field */
        #define SCS_HFSR_FORCED                              (0x40000000u)
        #define SCS_HFSR_FORCED_MASK                         (0x40000000u)
        #define SCS_HFSR_FORCED_BIT                          (30)
        #define SCS_HFSR_FORCED_BITS                         (1)
        /* VECTTBL field */
        #define SCS_HFSR_VECTTBL                             (0x00000002u)
        #define SCS_HFSR_VECTTBL_MASK                        (0x00000002u)
        #define SCS_HFSR_VECTTBL_BIT                         (1)
        #define SCS_HFSR_VECTTBL_BITS                        (1)

#define SCS_DFSR                                             *((volatile uint32_t *)0xE000ED30u)
#define SCS_DFSR_REG                                         *((volatile uint32_t *)0xE000ED30u)
#define SCS_DFSR_ADDR                                        (0xE000ED30u)
#define SCS_DFSR_RESET                                       (0x00000000u)
        /* EXTERNAL field */
        #define SCS_DFSR_EXTERNAL                            (0x00000010u)
        #define SCS_DFSR_EXTERNAL_MASK                       (0x00000010u)
        #define SCS_DFSR_EXTERNAL_BIT                        (4)
        #define SCS_DFSR_EXTERNAL_BITS                       (1)
        /* VCATCH field */
        #define SCS_DFSR_VCATCH                              (0x00000008u)
        #define SCS_DFSR_VCATCH_MASK                         (0x00000008u)
        #define SCS_DFSR_VCATCH_BIT                          (3)
        #define SCS_DFSR_VCATCH_BITS                         (1)
        /* DWTTRAP field */
        #define SCS_DFSR_DWTTRAP                             (0x00000004u)
        #define SCS_DFSR_DWTTRAP_MASK                        (0x00000004u)
        #define SCS_DFSR_DWTTRAP_BIT                         (2)
        #define SCS_DFSR_DWTTRAP_BITS                        (1)
        /* BKPT field */
        #define SCS_DFSR_BKPT                                (0x00000002u)
        #define SCS_DFSR_BKPT_MASK                           (0x00000002u)
        #define SCS_DFSR_BKPT_BIT                            (1)
        #define SCS_DFSR_BKPT_BITS                           (1)
        /* HALTED field */
        #define SCS_DFSR_HALTED                              (0x00000001u)
        #define SCS_DFSR_HALTED_MASK                         (0x00000001u)
        #define SCS_DFSR_HALTED_BIT                          (0)
        #define SCS_DFSR_HALTED_BITS                         (1)

#define SCS_MMAR                                             *((volatile uint32_t *)0xE000ED34u)
#define SCS_MMAR_REG                                         *((volatile uint32_t *)0xE000ED34u)
#define SCS_MMAR_ADDR                                        (0xE000ED34u)
#define SCS_MMAR_RESET                                       (0x00000000u)
        /* ADDRESS field */
        #define SCS_MMAR_ADDRESS                             (0xFFFFFFFFu)
        #define SCS_MMAR_ADDRESS_MASK                        (0xFFFFFFFFu)
        #define SCS_MMAR_ADDRESS_BIT                         (0)
        #define SCS_MMAR_ADDRESS_BITS                        (32)

