contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define SCS_ISAFR1                                           *((volatile uint32_t *)0xE000ED64u)
#define SCS_ISAFR1_REG                                       *((volatile uint32_t *)0xE000ED64u)
#define SCS_ISAFR1_ADDR                                      (0xE000ED64u)
#define SCS_ISAFR1_RESET                                     (0x02111000u)
        /* FEATURE field */
        #define SCS_ISAFR1_FEATURE                           (0xFFFFFFFFu)
        #define SCS_ISAFR1_FEATURE_MASK                      (0xFFFFFFFFu)
        #define SCS_ISAFR1_FEATURE_BIT                       (0)
        #define SCS_ISAFR1_FEATURE_BITS                      (32)

#define SCS_ISAFR2                                           *((volatile uint32_t *)0xE000ED68u)
#define SCS_ISAFR2_REG                                       *((volatile uint32_t *)0xE000ED68u)
#define SCS_ISAFR2_ADDR                                      (0xE000ED68u)
#define SCS_ISAFR2_RESET                                     (0x21112231u)
        /* FEATURE field */
        #define SCS_ISAFR2_FEATURE                           (0xFFFFFFFFu)
        #define SCS_ISAFR2_FEATURE_MASK                      (0xFFFFFFFFu)
        #define SCS_ISAFR2_FEATURE_BIT                       (0)
        #define SCS_ISAFR2_FEATURE_BITS                      (32)

#define SCS_ISAFR3                                           *((volatile uint32_t *)0xE000ED6Cu)
#define SCS_ISAFR3_REG                                       *((volatile uint32_t *)0xE000ED6Cu)
#define SCS_ISAFR3_ADDR                                      (0xE000ED6Cu)
#define SCS_ISAFR3_RESET                                     (0x11111110u)
        /* FEATURE field */
        #define SCS_ISAFR3_FEATURE                           (0xFFFFFFFFu)
        #define SCS_ISAFR3_FEATURE_MASK                      (0xFFFFFFFFu)
        #define SCS_ISAFR3_FEATURE_BIT                       (0)
        #define SCS_ISAFR3_FEATURE_BITS                      (32)

#define SCS_ISAFR4                                           *((volatile uint32_t *)0xE000ED70u)
#define SCS_ISAFR4_REG                                       *((volatile uint32_t *)0xE000ED70u)
#define SCS_ISAFR4_ADDR                                      (0xE000ED70u)
#define SCS_ISAFR4_RESET                                     (0x01310102u)
        /* FEATURE field */
        #define SCS_ISAFR4_FEATURE                           (0xFFFFFFFFu)
        #define SCS_ISAFR4_FEATURE_MASK                      (0xFFFFFFFFu)
        #define SCS_ISAFR4_FEATURE_BIT                       (0)
        #define SCS_ISAFR4_FEATURE_BITS                      (32)

#define MPU_TYPE                                             *((volatile uint32_t *)0xE000ED90u)
#define MPU_TYPE_REG                                         *((volatile uint32_t *)0xE000ED90u)
#define MPU_TYPE_ADDR                                        (0xE000ED90u)
#define MPU_TYPE_RESET                                       (0x00000800u)
        /* IREGION field */
        #define MPU_TYPE_IREGION                             (0x00FF0000u)
        #define MPU_TYPE_IREGION_MASK                        (0x00FF0000u)
        #define MPU_TYPE_IREGION_BIT                         (16)
        #define MPU_TYPE_IREGION_BITS                        (8)
        /* DREGION field */
        #define MPU_TYPE_DREGION                             (0x0000FF00u)
        #define MPU_TYPE_DREGION_MASK                        (0x0000FF00u)
        #define MPU_TYPE_DREGION_BIT                         (8)
        #define MPU_TYPE_DREGION_BITS                        (8)

#define MPU_CTRL                                             *((volatile uint32_t *)0xE000ED94u)
#define MPU_CTRL_REG                                         *((volatile uint32_t *)0xE000ED94u)
#define MPU_CTRL_ADDR                                        (0xE000ED94u)
#define MPU_CTRL_RESET                                       (0x00000000u)
        /* PRIVDEFENA field */
        #define MPU_CTRL_PRIVDEFENA                          (0x00000004u)
        #define MPU_CTRL_PRIVDEFENA_MASK                     (0x00000004u)
        #define MPU_CTRL_PRIVDEFENA_BIT                      (2)
        #define MPU_CTRL_PRIVDEFENA_BITS                     (1)
        /* HFNMIENA field */
        #define MPU_CTRL_HFNMIENA                            (0x00000002u)
        #define MPU_CTRL_HFNMIENA_MASK                       (0x00000002u)
        #define MPU_CTRL_HFNMIENA_BIT                        (1)
        #define MPU_CTRL_HFNMIENA_BITS                       (1)
        /* ENABLE field */
        #define MPU_CTRL_ENABLE                              (0x00000001u)
        #define MPU_CTRL_ENABLE_MASK                         (0x00000001u)
        #define MPU_CTRL_ENABLE_BIT                          (0)
        #define MPU_CTRL_ENABLE_BITS                         (1)

#define MPU_REGION                                           *((volatile uint32_t *)0xE000ED98u)
#define MPU_REGION_REG                                       *((volatile uint32_t *)0xE000ED98u)
#define MPU_REGION_ADDR                                      (0xE000ED98u)
#define MPU_REGION_RESET                                     (0x00000000u)
        /* REGION field */
        #define MPU_REGION_REGION                            (0x000000FFu)
        #define MPU_REGION_REGION_MASK                       (0x000000FFu)
        #define MPU_REGION_REGION_BIT                        (0)
        #define MPU_REGION_REGION_BITS                       (8)

#define MPU_BASE                                             *((volatile uint32_t *)0xE000ED9Cu)
#define MPU_BASE_REG                                         *((volatile uint32_t *)0xE000ED9Cu)
#define MPU_BASE_ADDR                                        (0xE000ED9Cu)
#define MPU_BASE_RESET                                       (0x00000000u)
        /* ADDRESS field */
        #define MPU_BASE_ADDRESS                             (0xFFFFFFE0u)
        #define MPU_BASE_ADDRESS_MASK                        (0xFFFFFFE0u)
        #define MPU_BASE_ADDRESS_BIT                         (5)
        #define MPU_BASE_ADDRESS_BITS                        (27)
        /* VALID field */
        #define MPU_BASE_VALID                               (0x00000010u)
        #define MPU_BASE_VALID_MASK                          (0x00000010u)
        #define MPU_BASE_VALID_BIT                           (4)
        #define MPU_BASE_VALID_BITS                          (1)
        /* REGION field */
        #define MPU_BASE_REGION                              (0x0000000Fu)
        #define MPU_BASE_REGION_MASK                         (0x0000000Fu)
        #define MPU_BASE_REGION_BIT                          (0)
        #define MPU_BASE_REGION_BITS                         (4)

