contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define MPU_ATTR                                             *((volatile uint32_t *)0xE000EDA0u)
#define MPU_ATTR_REG                                         *((volatile uint32_t *)0xE000EDA0u)
#define MPU_ATTR_ADDR                                        (0xE000EDA0u)
#define MPU_ATTR_RESET                                       (0x00000000u)
        /* XN field */
        #define MPU_ATTR_XN                                  (0x10000000u)
        #define MPU_ATTR_XN_MASK                             (0x10000000u)
        #define MPU_ATTR_XN_BIT                              (28)
        #define MPU_ATTR_XN_BITS                             (1)
        /* AP field */
        #define MPU_ATTR_AP                                  (0x07000000u)
        #define MPU_ATTR_AP_MASK                             (0x07000000u)
        #define MPU_ATTR_AP_BIT                              (24)
        #define MPU_ATTR_AP_BITS                             (3)
        /* TEX field */
        #define MPU_ATTR_TEX                                 (0x00380000u)
        #define MPU_ATTR_TEX_MASK                            (0x00380000u)
        #define MPU_ATTR_TEX_BIT                             (19)
        #define MPU_ATTR_TEX_BITS                            (3)
        /* S field */
        #define MPU_ATTR_S                                   (0x00040000u)
        #define MPU_ATTR_S_MASK                              (0x00040000u)
        #define MPU_ATTR_S_BIT                               (18)
        #define MPU_ATTR_S_BITS                              (1)
        /* C field */
        #define MPU_ATTR_C                                   (0x00020000u)
        #define MPU_ATTR_C_MASK                              (0x00020000u)
        #define MPU_ATTR_C_BIT                               (17)
        #define MPU_ATTR_C_BITS                              (1)
        /* B field */
        #define MPU_ATTR_B                                   (0x00010000u)
        #define MPU_ATTR_B_MASK                              (0x00010000u)
        #define MPU_ATTR_B_BIT                               (16)
        #define MPU_ATTR_B_BITS                              (1)
        /* SRD field */
        #define MPU_ATTR_SRD                                 (0x0000FF00u)
        #define MPU_ATTR_SRD_MASK                            (0x0000FF00u)
        #define MPU_ATTR_SRD_BIT                             (8)
        #define MPU_ATTR_SRD_BITS                            (8)
        /* SIZE field */
        #define MPU_ATTR_SIZE                                (0x0000003Eu)
        #define MPU_ATTR_SIZE_MASK                           (0x0000003Eu)
        #define MPU_ATTR_SIZE_BIT                            (1)
        #define MPU_ATTR_SIZE_BITS                           (5)
        /* ENABLE field */
        #define MPU_ATTR_ENABLE                              (0x00000001u)
        #define MPU_ATTR_ENABLE_MASK                         (0x00000001u)
        #define MPU_ATTR_ENABLE_BIT                          (0)
        #define MPU_ATTR_ENABLE_BITS                         (1)

#define MPU_BASE1                                            *((volatile uint32_t *)0xE000EDA4u)
#define MPU_BASE1_REG                                        *((volatile uint32_t *)0xE000EDA4u)
#define MPU_BASE1_ADDR                                       (0xE000EDA4u)
#define MPU_BASE1_RESET                                      (0x00000000u)
        /* ADDRESS field */
        #define MPU_BASE1_ADDRESS                            (0xFFFFFFE0u)
        #define MPU_BASE1_ADDRESS_MASK                       (0xFFFFFFE0u)
        #define MPU_BASE1_ADDRESS_BIT                        (5)
        #define MPU_BASE1_ADDRESS_BITS                       (27)
        /* VALID field */
        #define MPU_BASE1_VALID                              (0x00000010u)
        #define MPU_BASE1_VALID_MASK                         (0x00000010u)
        #define MPU_BASE1_VALID_BIT                          (4)
        #define MPU_BASE1_VALID_BITS                         (1)
        /* REGION field */
        #define MPU_BASE1_REGION                             (0x0000000Fu)
        #define MPU_BASE1_REGION_MASK                        (0x0000000Fu)
        #define MPU_BASE1_REGION_BIT                         (0)
        #define MPU_BASE1_REGION_BITS                        (4)

#define MPU_ATTR1                                            *((volatile uint32_t *)0xE000EDA8u)
#define MPU_ATTR1_REG                                        *((volatile uint32_t *)0xE000EDA8u)
#define MPU_ATTR1_ADDR                                       (0xE000EDA8u)
#define MPU_ATTR1_RESET                                      (0x00000000u)
        /* XN field */
        #define MPU_ATTR1_XN                                 (0x10000000u)
        #define MPU_ATTR1_XN_MASK                            (0x10000000u)
        #define MPU_ATTR1_XN_BIT                             (28)
        #define MPU_ATTR1_XN_BITS                            (1)
        /* AP field */
        #define MPU_ATTR1_AP                                 (0x07000000u)
        #define MPU_ATTR1_AP_MASK                            (0x07000000u)
        #define MPU_ATTR1_AP_BIT                             (24)
        #define MPU_ATTR1_AP_BITS                            (3)
        /* TEX field */
        #define MPU_ATTR1_TEX                                (0x00380000u)
        #define MPU_ATTR1_TEX_MASK                           (0x00380000u)
        #define MPU_ATTR1_TEX_BIT                            (19)
        #define MPU_ATTR1_TEX_BITS                           (3)
        /* S field */
        #define MPU_ATTR1_S                                  (0x00040000u)
        #define MPU_ATTR1_S_MASK                             (0x00040000u)
        #define MPU_ATTR1_S_BIT                              (18)
        #define MPU_ATTR1_S_BITS                             (1)
        /* C field */
        #define MPU_ATTR1_C                                  (0x00020000u)
        #define MPU_ATTR1_C_MASK                             (0x00020000u)
        #define MPU_ATTR1_C_BIT                              (17)
        #define MPU_ATTR1_C_BITS                             (1)
        /* B field */
        #define MPU_ATTR1_B                                  (0x00010000u)
        #define MPU_ATTR1_B_MASK                             (0x00010000u)
        #define MPU_ATTR1_B_BIT                              (16)
        #define MPU_ATTR1_B_BITS                             (1)
        /* SRD field */
        #define MPU_ATTR1_SRD                                (0x0000FF00u)
        #define MPU_ATTR1_SRD_MASK                           (0x0000FF00u)
        #define MPU_ATTR1_SRD_BIT                            (8)
        #define MPU_ATTR1_SRD_BITS                           (8)
        /* SIZE field */
        #define MPU_ATTR1_SIZE                               (0x0000003Eu)
        #define MPU_ATTR1_SIZE_MASK                          (0x0000003Eu)
        #define MPU_ATTR1_SIZE_BIT                           (1)
        #define MPU_ATTR1_SIZE_BITS                          (5)
        /* ENABLE field */
        #define MPU_ATTR1_ENABLE                             (0x00000001u)
        #define MPU_ATTR1_ENABLE_MASK                        (0x00000001u)
        #define MPU_ATTR1_ENABLE_BIT                         (0)
        #define MPU_ATTR1_ENABLE_BITS                        (1)

