contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define MPU_BASE2                                            *((volatile uint32_t *)0xE000EDACu)
#define MPU_BASE2_REG                                        *((volatile uint32_t *)0xE000EDACu)
#define MPU_BASE2_ADDR                                       (0xE000EDACu)
#define MPU_BASE2_RESET                                      (0x00000000u)
        /* ADDRESS field */
        #define MPU_BASE2_ADDRESS                            (0xFFFFFFE0u)
        #define MPU_BASE2_ADDRESS_MASK                       (0xFFFFFFE0u)
        #define MPU_BASE2_ADDRESS_BIT                        (5)
        #define MPU_BASE2_ADDRESS_BITS                       (27)
        /* VALID field */
        #define MPU_BASE2_VALID                              (0x00000010u)
        #define MPU_BASE2_VALID_MASK                         (0x00000010u)
        #define MPU_BASE2_VALID_BIT                          (4)
        #define MPU_BASE2_VALID_BITS                         (1)
        /* REGION field */
        #define MPU_BASE2_REGION                             (0x0000000Fu)
        #define MPU_BASE2_REGION_MASK                        (0x0000000Fu)
        #define MPU_BASE2_REGION_BIT                         (0)
        #define MPU_BASE2_REGION_BITS                        (4)

#define MPU_ATTR2                                            *((volatile uint32_t *)0xE000EDB0u)
#define MPU_ATTR2_REG                                        *((volatile uint32_t *)0xE000EDB0u)
#define MPU_ATTR2_ADDR                                       (0xE000EDB0u)
#define MPU_ATTR2_RESET                                      (0x00000000u)
        /* XN field */
        #define MPU_ATTR2_XN                                 (0x10000000u)
        #define MPU_ATTR2_XN_MASK                            (0x10000000u)
        #define MPU_ATTR2_XN_BIT                             (28)
        #define MPU_ATTR2_XN_BITS                            (1)
        /* AP field */
        #define MPU_ATTR2_AP                                 (0x1F000000u)
        #define MPU_ATTR2_AP_MASK                            (0x1F000000u)
        #define MPU_ATTR2_AP_BIT                             (24)
        #define MPU_ATTR2_AP_BITS                            (5)
        /* TEX field */
        #define MPU_ATTR2_TEX                                (0x00380000u)
        #define MPU_ATTR2_TEX_MASK                           (0x00380000u)
        #define MPU_ATTR2_TEX_BIT                            (19)
        #define MPU_ATTR2_TEX_BITS                           (3)
        /* S field */
        #define MPU_ATTR2_S                                  (0x00040000u)
        #define MPU_ATTR2_S_MASK                             (0x00040000u)
        #define MPU_ATTR2_S_BIT                              (18)
        #define MPU_ATTR2_S_BITS                             (1)
        /* C field */
        #define MPU_ATTR2_C                                  (0x00020000u)
        #define MPU_ATTR2_C_MASK                             (0x00020000u)
        #define MPU_ATTR2_C_BIT                              (17)
        #define MPU_ATTR2_C_BITS                             (1)
        /* B field */
        #define MPU_ATTR2_B                                  (0x00010000u)
        #define MPU_ATTR2_B_MASK                             (0x00010000u)
        #define MPU_ATTR2_B_BIT                              (16)
        #define MPU_ATTR2_B_BITS                             (1)
        /* SRD field */
        #define MPU_ATTR2_SRD                                (0x0000FF00u)
        #define MPU_ATTR2_SRD_MASK                           (0x0000FF00u)
        #define MPU_ATTR2_SRD_BIT                            (8)
        #define MPU_ATTR2_SRD_BITS                           (8)
        /* SIZE field */
        #define MPU_ATTR2_SIZE                               (0x0000003Eu)
        #define MPU_ATTR2_SIZE_MASK                          (0x0000003Eu)
        #define MPU_ATTR2_SIZE_BIT                           (1)
        #define MPU_ATTR2_SIZE_BITS                          (5)
        /* ENABLE field */
        #define MPU_ATTR2_ENABLE                             (0x00000003u)
        #define MPU_ATTR2_ENABLE_MASK                        (0x00000003u)
        #define MPU_ATTR2_ENABLE_BIT                         (0)
        #define MPU_ATTR2_ENABLE_BITS                        (2)

#define MPU_BASE3                                            *((volatile uint32_t *)0xE000EDB4u)
#define MPU_BASE3_REG                                        *((volatile uint32_t *)0xE000EDB4u)
#define MPU_BASE3_ADDR                                       (0xE000EDB4u)
#define MPU_BASE3_RESET                                      (0x00000000u)
        /* ADDRESS field */
        #define MPU_BASE3_ADDRESS                            (0xFFFFFFE0u)
        #define MPU_BASE3_ADDRESS_MASK                       (0xFFFFFFE0u)
        #define MPU_BASE3_ADDRESS_BIT                        (5)
        #define MPU_BASE3_ADDRESS_BITS                       (27)
        /* VALID field */
        #define MPU_BASE3_VALID                              (0x00000010u)
        #define MPU_BASE3_VALID_MASK                         (0x00000010u)
        #define MPU_BASE3_VALID_BIT                          (4)
        #define MPU_BASE3_VALID_BITS                         (1)
        /* REGION field */
        #define MPU_BASE3_REGION                             (0x0000000Fu)
        #define MPU_BASE3_REGION_MASK                        (0x0000000Fu)
        #define MPU_BASE3_REGION_BIT                         (0)
        #define MPU_BASE3_REGION_BITS                        (4)

#define MPU_ATTR3                                            *((volatile uint32_t *)0xE000EDBCu)
#define MPU_ATTR3_REG                                        *((volatile uint32_t *)0xE000EDBCu)
#define MPU_ATTR3_ADDR                                       (0xE000EDBCu)
#define MPU_ATTR3_RESET                                      (0x00000000u)
        /* XN field */
        #define MPU_ATTR3_XN                                 (0x10000000u)
        #define MPU_ATTR3_XN_MASK                            (0x10000000u)
        #define MPU_ATTR3_XN_BIT                             (28)
        #define MPU_ATTR3_XN_BITS                            (1)
        /* AP field */
        #define MPU_ATTR3_AP                                 (0x1F000000u)
        #define MPU_ATTR3_AP_MASK                            (0x1F000000u)
        #define MPU_ATTR3_AP_BIT                             (24)
        #define MPU_ATTR3_AP_BITS                            (5)
        /* TEX field */
        #define MPU_ATTR3_TEX                                (0x00380000u)
        #define MPU_ATTR3_TEX_MASK                           (0x00380000u)
        #define MPU_ATTR3_TEX_BIT                            (19)
        #define MPU_ATTR3_TEX_BITS                           (3)
        /* S field */
        #define MPU_ATTR3_S                                  (0x00040000u)
        #define MPU_ATTR3_S_MASK                             (0x00040000u)
        #define MPU_ATTR3_S_BIT                              (18)
        #define MPU_ATTR3_S_BITS                             (1)
        /* C field */
        #define MPU_ATTR3_C                                  (0x00020000u)
        #define MPU_ATTR3_C_MASK                             (0x00020000u)
        #define MPU_ATTR3_C_BIT                              (17)
        #define MPU_ATTR3_C_BITS                             (1)
        /* B field */
        #define MPU_ATTR3_B                                  (0x00010000u)
        #define MPU_ATTR3_B_MASK                             (0x00010000u)
        #define MPU_ATTR3_B_BIT                              (16)
        #define MPU_ATTR3_B_BITS                             (1)
        /* SRD field */
        #define MPU_ATTR3_SRD                                (0x0000FF00u)
        #define MPU_ATTR3_SRD_MASK                           (0x0000FF00u)
        #define MPU_ATTR3_SRD_BIT                            (8)
        #define MPU_ATTR3_SRD_BITS                           (8)
        /* SIZE field */
        #define MPU_ATTR3_SIZE                               (0x0000003Eu)
        #define MPU_ATTR3_SIZE_MASK                          (0x0000003Eu)
        #define MPU_ATTR3_SIZE_BIT                           (1)
        #define MPU_ATTR3_SIZE_BITS                          (5)
        /* ENABLE field */
        #define MPU_ATTR3_ENABLE                             (0x00000003u)
        #define MPU_ATTR3_ENABLE_MASK                        (0x00000003u)
        #define MPU_ATTR3_ENABLE_BIT                         (0)
        #define MPU_ATTR3_ENABLE_BITS                        (2)

#define DEBUG_HCSR                                           *((volatile uint32_t *)0xE000EDF0u)
#define DEBUG_HCSR_REG                                       *((volatile uint32_t *)0xE000EDF0u)
#define DEBUG_HCSR_ADDR                                      (0xE000EDF0u)
#define DEBUG_HCSR_RESET                                     (0x00000000u)
        /* S_RESET_ST field */
        #define DEBUG_HCSR_S_RESET_ST                        (0x02000000u)
        #define DEBUG_HCSR_S_RESET_ST_MASK                   (0x02000000u)
        #define DEBUG_HCSR_S_RESET_ST_BIT                    (25)
        #define DEBUG_HCSR_S_RESET_ST_BITS                   (1)
        /* S_RETIRE_ST field */
        #define DEBUG_HCSR_S_RETIRE_ST                       (0x01000000u)
        #define DEBUG_HCSR_S_RETIRE_ST_MASK                  (0x01000000u)
        #define DEBUG_HCSR_S_RETIRE_ST_BIT                   (24)
        #define DEBUG_HCSR_S_RETIRE_ST_BITS                  (1)
        /* S_LOCKUP field */
        #define DEBUG_HCSR_S_LOCKUP                          (0x00080000u)
        #define DEBUG_HCSR_S_LOCKUP_MASK                     (0x00080000u)
        #define DEBUG_HCSR_S_LOCKUP_BIT                      (19)
        #define DEBUG_HCSR_S_LOCKUP_BITS                     (1)
        /* S_SLEEP field */
        #define DEBUG_HCSR_S_SLEEP                           (0x00040000u)
        #define DEBUG_HCSR_S_SLEEP_MASK                      (0x00040000u)
        #define DEBUG_HCSR_S_SLEEP_BIT                       (18)
        #define DEBUG_HCSR_S_SLEEP_BITS                      (1)
        /* S_HALT field */
        #define DEBUG_HCSR_S_HALT                            (0x00020000u)
        #define DEBUG_HCSR_S_HALT_MASK                       (0x00020000u)
        #define DEBUG_HCSR_S_HALT_BIT                        (17)
        #define DEBUG_HCSR_S_HALT_BITS                       (1)
        /* S_REGRDY field */
        #define DEBUG_HCSR_S_REGRDY                          (0x00010000u)
        #define DEBUG_HCSR_S_REGRDY_MASK                     (0x00010000u)
        #define DEBUG_HCSR_S_REGRDY_BIT                      (16)
        #define DEBUG_HCSR_S_REGRDY_BITS                     (1)
        /* DBGKEY field */
        #define DEBUG_HCSR_DBGKEY                            (0xFFFF0000u)
        #define DEBUG_HCSR_DBGKEY_MASK                       (0xFFFF0000u)
        #define DEBUG_HCSR_DBGKEY_BIT                        (16)
        #define DEBUG_HCSR_DBGKEY_BITS                       (16)
        /* C_SNAPSTALL field */
        #define DEBUG_HCSR_C_SNAPSTALL                       (0x00000020u)
        #define DEBUG_HCSR_C_SNAPSTALL_MASK                  (0x00000020u)
        #define DEBUG_HCSR_C_SNAPSTALL_BIT                   (5)
        #define DEBUG_HCSR_C_SNAPSTALL_BITS                  (1)
        /* C_MASKINTS field */
        #define DEBUG_HCSR_C_MASKINTS                        (0x00000008u)
        #define DEBUG_HCSR_C_MASKINTS_MASK                   (0x00000008u)
        #define DEBUG_HCSR_C_MASKINTS_BIT                    (3)
        #define DEBUG_HCSR_C_MASKINTS_BITS                   (1)
        /* C_STEP field */
        #define DEBUG_HCSR_C_STEP                            (0x00000004u)
        #define DEBUG_HCSR_C_STEP_MASK                       (0x00000004u)
        #define DEBUG_HCSR_C_STEP_BIT                        (2)
        #define DEBUG_HCSR_C_STEP_BITS                       (1)
        /* C_HALT field */
        #define DEBUG_HCSR_C_HALT                            (0x00000002u)
        #define DEBUG_HCSR_C_HALT_MASK                       (0x00000002u)
        #define DEBUG_HCSR_C_HALT_BIT                        (1)
        #define DEBUG_HCSR_C_HALT_BITS                       (1)
        /* C_DEBUGEN field */
        #define DEBUG_HCSR_C_DEBUGEN                         (0x00000001u)
        #define DEBUG_HCSR_C_DEBUGEN_MASK                    (0x00000001u)
        #define DEBUG_HCSR_C_DEBUGEN_BIT                     (0)
        #define DEBUG_HCSR_C_DEBUGEN_BITS                    (1)

#define DEBUG_CRSR                                           *((volatile uint32_t *)0xE000EDF4u)
#define DEBUG_CRSR_REG                                       *((volatile uint32_t *)0xE000EDF4u)
#define DEBUG_CRSR_ADDR                                      (0xE000EDF4u)
#define DEBUG_CRSR_RESET                                     (0x00000000u)
        /* REGWnR field */
        #define DEBUG_CRSR_REGWnR                            (0x00010000u)
        #define DEBUG_CRSR_REGWnR_MASK                       (0x00010000u)
        #define DEBUG_CRSR_REGWnR_BIT                        (16)
        #define DEBUG_CRSR_REGWnR_BITS                       (1)
        /* REGSEL field */
        #define DEBUG_CRSR_REGSEL                            (0x0000001Fu)
        #define DEBUG_CRSR_REGSEL_MASK                       (0x0000001Fu)
        #define DEBUG_CRSR_REGSEL_BIT                        (0)
        #define DEBUG_CRSR_REGSEL_BITS                       (5)

#define DEBUG_CRDR                                           *((volatile uint32_t *)0xE000EDF8u)
#define DEBUG_CRDR_REG                                       *((volatile uint32_t *)0xE000EDF8u)
#define DEBUG_CRDR_ADDR                                      (0xE000EDF8u)
#define DEBUG_CRDR_RESET                                     (0x00000000u)
        /* DBGTMP field */
        #define DEBUG_CRDR_DBGTMP                            (0xFFFFFFFFu)
        #define DEBUG_CRDR_DBGTMP_MASK                       (0xFFFFFFFFu)
        #define DEBUG_CRDR_DBGTMP_BIT                        (0)
        #define DEBUG_CRDR_DBGTMP_BITS                       (32)

#define DEBUG_EMCR                                           *((volatile uint32_t *)0xE000EDFCu)
#define DEBUG_EMCR_REG                                       *((volatile uint32_t *)0xE000EDFCu)
#define DEBUG_EMCR_ADDR                                      (0xE000EDFCu)
#define DEBUG_EMCR_RESET                                     (0x00000000u)
        /* TRCENA field */
        #define DEBUG_EMCR_TRCENA                            (0x01000000u)
        #define DEBUG_EMCR_TRCENA_MASK                       (0x01000000u)
        #define DEBUG_EMCR_TRCENA_BIT                        (24)
        #define DEBUG_EMCR_TRCENA_BITS                       (1)
        /* MON_REQ field */
        #define DEBUG_EMCR_MON_REQ                           (0x00080000u)
        #define DEBUG_EMCR_MON_REQ_MASK                      (0x00080000u)
        #define DEBUG_EMCR_MON_REQ_BIT                       (19)
        #define DEBUG_EMCR_MON_REQ_BITS                      (1)
        /* MON_STEP field */
        #define DEBUG_EMCR_MON_STEP                          (0x00040000u)
        #define DEBUG_EMCR_MON_STEP_MASK                     (0x00040000u)
        #define DEBUG_EMCR_MON_STEP_BIT                      (18)
        #define DEBUG_EMCR_MON_STEP_BITS                     (1)
        /* MON_PEND field */
        #define DEBUG_EMCR_MON_PEND                          (0x00020000u)
        #define DEBUG_EMCR_MON_PEND_MASK                     (0x00020000u)
        #define DEBUG_EMCR_MON_PEND_BIT                      (17)
        #define DEBUG_EMCR_MON_PEND_BITS                     (1)
        /* MON_EN field */
        #define DEBUG_EMCR_MON_EN                            (0x00010000u)
        #define DEBUG_EMCR_MON_EN_MASK                       (0x00010000u)
        #define DEBUG_EMCR_MON_EN_BIT                        (16)
        #define DEBUG_EMCR_MON_EN_BITS                       (1)
        /* VC_HARDERR field */
        #define DEBUG_EMCR_VC_HARDERR                        (0x00000400u)
        #define DEBUG_EMCR_VC_HARDERR_MASK                   (0x00000400u)
        #define DEBUG_EMCR_VC_HARDERR_BIT                    (10)
        #define DEBUG_EMCR_VC_HARDERR_BITS                   (1)
        /* VC_INTERR field */
        #define DEBUG_EMCR_VC_INTERR                         (0x00000200u)
        #define DEBUG_EMCR_VC_INTERR_MASK                    (0x00000200u)
        #define DEBUG_EMCR_VC_INTERR_BIT                     (9)
        #define DEBUG_EMCR_VC_INTERR_BITS                    (1)
        /* VC_BUSERR field */
        #define DEBUG_EMCR_VC_BUSERR                         (0x00000100u)
        #define DEBUG_EMCR_VC_BUSERR_MASK                    (0x00000100u)
        #define DEBUG_EMCR_VC_BUSERR_BIT                     (8)
        #define DEBUG_EMCR_VC_BUSERR_BITS                    (1)
        /* VC_STATERR field */
        #define DEBUG_EMCR_VC_STATERR                        (0x00000080u)
        #define DEBUG_EMCR_VC_STATERR_MASK                   (0x00000080u)
        #define DEBUG_EMCR_VC_STATERR_BIT                    (7)
        #define DEBUG_EMCR_VC_STATERR_BITS                   (1)
        /* VC_CHKERR field */
        #define DEBUG_EMCR_VC_CHKERR                         (0x00000040u)
        #define DEBUG_EMCR_VC_CHKERR_MASK                    (0x00000040u)
        #define DEBUG_EMCR_VC_CHKERR_BIT                     (6)
        #define DEBUG_EMCR_VC_CHKERR_BITS                    (1)
        /* VC_NOCPERR field */
        #define DEBUG_EMCR_VC_NOCPERR                        (0x00000020u)
        #define DEBUG_EMCR_VC_NOCPERR_MASK                   (0x00000020u)
        #define DEBUG_EMCR_VC_NOCPERR_BIT                    (5)
        #define DEBUG_EMCR_VC_NOCPERR_BITS                   (1)
        /* VC_MMERR field */
        #define DEBUG_EMCR_VC_MMERR                          (0x00000010u)
        #define DEBUG_EMCR_VC_MMERR_MASK                     (0x00000010u)
        #define DEBUG_EMCR_VC_MMERR_BIT                      (4)
        #define DEBUG_EMCR_VC_MMERR_BITS                     (1)
        /* VC_CORERESET field */
        #define DEBUG_EMCR_VC_CORERESET                      (0x00000001u)
        #define DEBUG_EMCR_VC_CORERESET_MASK                 (0x00000001u)
        #define DEBUG_EMCR_VC_CORERESET_BIT                  (0)
        #define DEBUG_EMCR_VC_CORERESET_BITS                 (1)

#define NVIC_STIR                                            *((volatile uint32_t *)0xE000EF00u)
#define NVIC_STIR_REG                                        *((volatile uint32_t *)0xE000EF00u)
#define NVIC_STIR_ADDR                                       (0xE000EF00u)
#define NVIC_STIR_RESET                                      (0x00000000u)
        /* INTID field */
        #define NVIC_STIR_INTID                              (0x000003FFu)
        #define NVIC_STIR_INTID_MASK                         (0x000003FFu)
        #define NVIC_STIR_INTID_BIT                          (0)
        #define NVIC_STIR_INTID_BITS                         (10)

#define NVIC_PERIPHID4                                       *((volatile uint32_t *)0xE000EFD0u)
#define NVIC_PERIPHID4_REG                                   *((volatile uint32_t *)0xE000EFD0u)
#define NVIC_PERIPHID4_ADDR                                  (0xE000EFD0u)
#define NVIC_PERIPHID4_RESET                                 (0x00000004u)
        /* PERIPHID field */
        #define NVIC_PERIPHID4_PERIPHID                      (0xFFFFFFFFu)
        #define NVIC_PERIPHID4_PERIPHID_MASK                 (0xFFFFFFFFu)
        #define NVIC_PERIPHID4_PERIPHID_BIT                  (0)
        #define NVIC_PERIPHID4_PERIPHID_BITS                 (32)

