contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define NVIC_PERIPHID5                                       *((volatile uint32_t *)0xE000EFD4u)
#define NVIC_PERIPHID5_REG                                   *((volatile uint32_t *)0xE000EFD4u)
#define NVIC_PERIPHID5_ADDR                                  (0xE000EFD4u)
#define NVIC_PERIPHID5_RESET                                 (0x00000000u)
        /* PERIPHID field */
        #define NVIC_PERIPHID5_PERIPHID                      (0xFFFFFFFFu)
        #define NVIC_PERIPHID5_PERIPHID_MASK                 (0xFFFFFFFFu)
        #define NVIC_PERIPHID5_PERIPHID_BIT                  (0)
        #define NVIC_PERIPHID5_PERIPHID_BITS                 (32)

#define NVIC_PERIPHID6                                       *((volatile uint32_t *)0xE000EFD8u)
#define NVIC_PERIPHID6_REG                                   *((volatile uint32_t *)0xE000EFD8u)
#define NVIC_PERIPHID6_ADDR                                  (0xE000EFD8u)
#define NVIC_PERIPHID6_RESET                                 (0x00000000u)
        /* PERIPHID field */
        #define NVIC_PERIPHID6_PERIPHID                      (0xFFFFFFFFu)
        #define NVIC_PERIPHID6_PERIPHID_MASK                 (0xFFFFFFFFu)
        #define NVIC_PERIPHID6_PERIPHID_BIT                  (0)
        #define NVIC_PERIPHID6_PERIPHID_BITS                 (32)

#define NVIC_PERIPHID7                                       *((volatile uint32_t *)0xE000EFDCu)
#define NVIC_PERIPHID7_REG                                   *((volatile uint32_t *)0xE000EFDCu)
#define NVIC_PERIPHID7_ADDR                                  (0xE000EFDCu)
#define NVIC_PERIPHID7_RESET                                 (0x00000000u)
        /* PERIPHID field */
        #define NVIC_PERIPHID7_PERIPHID                      (0xFFFFFFFFu)
        #define NVIC_PERIPHID7_PERIPHID_MASK                 (0xFFFFFFFFu)
        #define NVIC_PERIPHID7_PERIPHID_BIT                  (0)
        #define NVIC_PERIPHID7_PERIPHID_BITS                 (32)

#define NVIC_PERIPHID0                                       *((volatile uint32_t *)0xE000EFE0u)
#define NVIC_PERIPHID0_REG                                   *((volatile uint32_t *)0xE000EFE0u)
#define NVIC_PERIPHID0_ADDR                                  (0xE000EFE0u)
#define NVIC_PERIPHID0_RESET                                 (0x00000000u)
        /* PERIPHID field */
        #define NVIC_PERIPHID0_PERIPHID                      (0xFFFFFFFFu)
        #define NVIC_PERIPHID0_PERIPHID_MASK                 (0xFFFFFFFFu)
        #define NVIC_PERIPHID0_PERIPHID_BIT                  (0)
        #define NVIC_PERIPHID0_PERIPHID_BITS                 (32)

#define NVIC_PERIPHID1                                       *((volatile uint32_t *)0xE000EFE4u)
#define NVIC_PERIPHID1_REG                                   *((volatile uint32_t *)0xE000EFE4u)
#define NVIC_PERIPHID1_ADDR                                  (0xE000EFE4u)
#define NVIC_PERIPHID1_RESET                                 (0x000000B0u)
        /* PERIPHID field */
        #define NVIC_PERIPHID1_PERIPHID                      (0xFFFFFFFFu)
        #define NVIC_PERIPHID1_PERIPHID_MASK                 (0xFFFFFFFFu)
        #define NVIC_PERIPHID1_PERIPHID_BIT                  (0)
        #define NVIC_PERIPHID1_PERIPHID_BITS                 (32)

#define NVIC_PERIPHID2                                       *((volatile uint32_t *)0xE000EFE8u)
#define NVIC_PERIPHID2_REG                                   *((volatile uint32_t *)0xE000EFE8u)
#define NVIC_PERIPHID2_ADDR                                  (0xE000EFE8u)
#define NVIC_PERIPHID2_RESET                                 (0x0000001Bu)
        /* PERIPHID field */
        #define NVIC_PERIPHID2_PERIPHID                      (0xFFFFFFFFu)
        #define NVIC_PERIPHID2_PERIPHID_MASK                 (0xFFFFFFFFu)
        #define NVIC_PERIPHID2_PERIPHID_BIT                  (0)
        #define NVIC_PERIPHID2_PERIPHID_BITS                 (32)

#define NVIC_PERIPHID3                                       *((volatile uint32_t *)0xE000EFECu)
#define NVIC_PERIPHID3_REG                                   *((volatile uint32_t *)0xE000EFECu)
#define NVIC_PERIPHID3_ADDR                                  (0xE000EFECu)
#define NVIC_PERIPHID3_RESET                                 (0x00000000u)
        /* PERIPHID field */
        #define NVIC_PERIPHID3_PERIPHID                      (0xFFFFFFFFu)
        #define NVIC_PERIPHID3_PERIPHID_MASK                 (0xFFFFFFFFu)
        #define NVIC_PERIPHID3_PERIPHID_BIT                  (0)
        #define NVIC_PERIPHID3_PERIPHID_BITS                 (32)

#define NVIC_PCELLID0                                        *((volatile uint32_t *)0xE000EFF0u)
#define NVIC_PCELLID0_REG                                    *((volatile uint32_t *)0xE000EFF0u)
#define NVIC_PCELLID0_ADDR                                   (0xE000EFF0u)
#define NVIC_PCELLID0_RESET                                  (0x0000000Du)
        /* PCELLID field */
        #define NVIC_PCELLID0_PCELLID                        (0xFFFFFFFFu)
        #define NVIC_PCELLID0_PCELLID_MASK                   (0xFFFFFFFFu)
        #define NVIC_PCELLID0_PCELLID_BIT                    (0)
        #define NVIC_PCELLID0_PCELLID_BITS                   (32)

#define NVIC_PCELLID1                                        *((volatile uint32_t *)0xE000EFF4u)
#define NVIC_PCELLID1_REG                                    *((volatile uint32_t *)0xE000EFF4u)
#define NVIC_PCELLID1_ADDR                                   (0xE000EFF4u)
#define NVIC_PCELLID1_RESET                                  (0x000000E0u)
        /* PCELLID field */
        #define NVIC_PCELLID1_PCELLID                        (0xFFFFFFFFu)
        #define NVIC_PCELLID1_PCELLID_MASK                   (0xFFFFFFFFu)
        #define NVIC_PCELLID1_PCELLID_BIT                    (0)
        #define NVIC_PCELLID1_PCELLID_BITS                   (32)

#define NVIC_PCELLID2                                        *((volatile uint32_t *)0xE000EFF8u)
#define NVIC_PCELLID2_REG                                    *((volatile uint32_t *)0xE000EFF8u)
#define NVIC_PCELLID2_ADDR                                   (0xE000EFF8u)
#define NVIC_PCELLID2_RESET                                  (0x00000005u)
        /* PCELLID field */
        #define NVIC_PCELLID2_PCELLID                        (0xFFFFFFFFu)
        #define NVIC_PCELLID2_PCELLID_MASK                   (0xFFFFFFFFu)
        #define NVIC_PCELLID2_PCELLID_BIT                    (0)
        #define NVIC_PCELLID2_PCELLID_BITS                   (32)

