contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define TPIU_FFC                                             *((volatile uint32_t *)0xE0040304u)
#define TPIU_FFC_REG                                         *((volatile uint32_t *)0xE0040304u)
#define TPIU_FFC_ADDR                                        (0xE0040304u)
#define TPIU_FFC_RESET                                       (0x00000102u)
        /* TRIGIN field */
        #define TPIU_FFC_TRIGIN                              (0x00000100u)
        #define TPIU_FFC_TRIGIN_MASK                         (0x00000100u)
        #define TPIU_FFC_TRIGIN_BIT                          (8)
        #define TPIU_FFC_TRIGIN_BITS                         (1)
        /* ENFCONT field */
        #define TPIU_FFC_ENFCONT                             (0x00000002u)
        #define TPIU_FFC_ENFCONT_MASK                        (0x00000002u)
        #define TPIU_FFC_ENFCONT_BIT                         (1)
        #define TPIU_FFC_ENFCONT_BITS                        (1)

#define TPIU_FSC                                             *((volatile uint32_t *)0xE0040308u)
#define TPIU_FSC_REG                                         *((volatile uint32_t *)0xE0040308u)
#define TPIU_FSC_ADDR                                        (0xE0040308u)
#define TPIU_FSC_RESET                                       (0x00000000u)
        /* FSC field */
        #define TPIU_FSC_FSC                                 (0xFFFFFFFFu)
        #define TPIU_FSC_FSC_MASK                            (0xFFFFFFFFu)
        #define TPIU_FSC_FSC_BIT                             (0)
        #define TPIU_FSC_FSC_BITS                            (32)

#define TPIU_ITATBCTR2                                       *((volatile uint32_t *)0xE0040EF0u)
#define TPIU_ITATBCTR2_REG                                   *((volatile uint32_t *)0xE0040EF0u)
#define TPIU_ITATBCTR2_ADDR                                  (0xE0040EF0u)
#define TPIU_ITATBCTR2_RESET                                 (0x00000000u)
        /* ATREADY1 field */
        #define TPIU_ITATBCTR2_ATREADY1                      (0x00000001u)
        #define TPIU_ITATBCTR2_ATREADY1_MASK                 (0x00000001u)
        #define TPIU_ITATBCTR2_ATREADY1_BIT                  (0)
        #define TPIU_ITATBCTR2_ATREADY1_BITS                 (1)

#define TPIU_ITATBCTR0                                       *((volatile uint32_t *)0xE0040EF8u)
#define TPIU_ITATBCTR0_REG                                   *((volatile uint32_t *)0xE0040EF8u)
#define TPIU_ITATBCTR0_ADDR                                  (0xE0040EF8u)
#define TPIU_ITATBCTR0_RESET                                 (0x00000000u)
        /* ATREADY1 field */
        #define TPIU_ITATBCTR0_ATREADY1                      (0x00000001u)
        #define TPIU_ITATBCTR0_ATREADY1_MASK                 (0x00000001u)
        #define TPIU_ITATBCTR0_ATREADY1_BIT                  (0)
        #define TPIU_ITATBCTR0_ATREADY1_BITS                 (1)

/* ETM block */
#define DATA_ETM_BASE                                        (0xE0041000u)
#define DATA_ETM_END                                         (0xE0041FFFu)
#define DATA_ETM_SIZE                                        (DATA_ETM_END - DATA_ETM_BASE + 1)

/* ROM_TAB block */
#define DATA_ROM_TAB_BASE                                    (0xE00FF000u)
#define DATA_ROM_TAB_END                                     (0xE00FFFFFu)
#define DATA_ROM_TAB_SIZE                                    (DATA_ROM_TAB_END - DATA_ROM_TAB_BASE + 1)

#define ROM_SCS                                              *((volatile uint32_t *)0xE00FF000u)
#define ROM_SCS_REG                                          *((volatile uint32_t *)0xE00FF000u)
#define ROM_SCS_ADDR                                         (0xE00FF000u)
#define ROM_SCS_RESET                                        (0xFFF0F003u)
        /* ADDR_OFF field */
        #define ROM_SCS_ADDR_OFF                             (0xFFFFF000u)
        #define ROM_SCS_ADDR_OFF_MASK                        (0xFFFFF000u)
        #define ROM_SCS_ADDR_OFF_BIT                         (12)
        #define ROM_SCS_ADDR_OFF_BITS                        (20)
        /* FORMAT field */
        #define ROM_SCS_FORMAT                               (0x00000002u)
        #define ROM_SCS_FORMAT_MASK                          (0x00000002u)
        #define ROM_SCS_FORMAT_BIT                           (1)
        #define ROM_SCS_FORMAT_BITS                          (1)
        /* ENTRY_PRES field */
        #define ROM_SCS_ENTRY_PRES                           (0x00000001u)
        #define ROM_SCS_ENTRY_PRES_MASK                      (0x00000001u)
        #define ROM_SCS_ENTRY_PRES_BIT                       (0)
        #define ROM_SCS_ENTRY_PRES_BITS                      (1)

#define ROM_DWT                                              *((volatile uint32_t *)0xE00FF004u)
#define ROM_DWT_REG                                          *((volatile uint32_t *)0xE00FF004u)
#define ROM_DWT_ADDR                                         (0xE00FF004u)
#define ROM_DWT_RESET                                        (0xFFF02003u)
        /* ADDR_OFF field */
        #define ROM_DWT_ADDR_OFF                             (0xFFFFF000u)
        #define ROM_DWT_ADDR_OFF_MASK                        (0xFFFFF000u)
        #define ROM_DWT_ADDR_OFF_BIT                         (12)
        #define ROM_DWT_ADDR_OFF_BITS                        (20)
        /* FORMAT field */
        #define ROM_DWT_FORMAT                               (0x00000002u)
        #define ROM_DWT_FORMAT_MASK                          (0x00000002u)
        #define ROM_DWT_FORMAT_BIT                           (1)
        #define ROM_DWT_FORMAT_BITS                          (1)
        /* ENTRY_PRES field */
        #define ROM_DWT_ENTRY_PRES                           (0x00000001u)
        #define ROM_DWT_ENTRY_PRES_MASK                      (0x00000001u)
        #define ROM_DWT_ENTRY_PRES_BIT                       (0)
        #define ROM_DWT_ENTRY_PRES_BITS                      (1)

