contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define ROM_FPB                                              *((volatile uint32_t *)0xE00FF008u)
#define ROM_FPB_REG                                          *((volatile uint32_t *)0xE00FF008u)
#define ROM_FPB_ADDR                                         (0xE00FF008u)
#define ROM_FPB_RESET                                        (0xFFF03003u)
        /* ADDR_OFF field */
        #define ROM_FPB_ADDR_OFF                             (0xFFFFF000u)
        #define ROM_FPB_ADDR_OFF_MASK                        (0xFFFFF000u)
        #define ROM_FPB_ADDR_OFF_BIT                         (12)
        #define ROM_FPB_ADDR_OFF_BITS                        (20)
        /* FORMAT field */
        #define ROM_FPB_FORMAT                               (0x00000002u)
        #define ROM_FPB_FORMAT_MASK                          (0x00000002u)
        #define ROM_FPB_FORMAT_BIT                           (1)
        #define ROM_FPB_FORMAT_BITS                          (1)
        /* ENTRY_PRES field */
        #define ROM_FPB_ENTRY_PRES                           (0x00000001u)
        #define ROM_FPB_ENTRY_PRES_MASK                      (0x00000001u)
        #define ROM_FPB_ENTRY_PRES_BIT                       (0)
        #define ROM_FPB_ENTRY_PRES_BITS                      (1)

#define ROM_ITM                                              *((volatile uint32_t *)0xE00FF00Cu)
#define ROM_ITM_REG                                          *((volatile uint32_t *)0xE00FF00Cu)
#define ROM_ITM_ADDR                                         (0xE00FF00Cu)
#define ROM_ITM_RESET                                        (0xFFF01003u)
        /* ADDR_OFF field */
        #define ROM_ITM_ADDR_OFF                             (0xFFFFF000u)
        #define ROM_ITM_ADDR_OFF_MASK                        (0xFFFFF000u)
        #define ROM_ITM_ADDR_OFF_BIT                         (12)
        #define ROM_ITM_ADDR_OFF_BITS                        (20)
        /* FORMAT field */
        #define ROM_ITM_FORMAT                               (0x00000002u)
        #define ROM_ITM_FORMAT_MASK                          (0x00000002u)
        #define ROM_ITM_FORMAT_BIT                           (1)
        #define ROM_ITM_FORMAT_BITS                          (1)
        /* ENTRY_PRES field */
        #define ROM_ITM_ENTRY_PRES                           (0x00000001u)
        #define ROM_ITM_ENTRY_PRES_MASK                      (0x00000001u)
        #define ROM_ITM_ENTRY_PRES_BIT                       (0)
        #define ROM_ITM_ENTRY_PRES_BITS                      (1)

#define ROM_TPIU                                             *((volatile uint32_t *)0xE00FF010u)
#define ROM_TPIU_REG                                         *((volatile uint32_t *)0xE00FF010u)
#define ROM_TPIU_ADDR                                        (0xE00FF010u)
#define ROM_TPIU_RESET                                       (0xFFF0F003u)
        /* ADDR_OFF field */
        #define ROM_TPIU_ADDR_OFF                            (0xFFFFF000u)
        #define ROM_TPIU_ADDR_OFF_MASK                       (0xFFFFF000u)
        #define ROM_TPIU_ADDR_OFF_BIT                        (12)
        #define ROM_TPIU_ADDR_OFF_BITS                       (20)
        /* FORMAT field */
        #define ROM_TPIU_FORMAT                              (0x00000002u)
        #define ROM_TPIU_FORMAT_MASK                         (0x00000002u)
        #define ROM_TPIU_FORMAT_BIT                          (1)
        #define ROM_TPIU_FORMAT_BITS                         (1)
        /* ENTRY_PRES field */
        #define ROM_TPIU_ENTRY_PRES                          (0x00000001u)
        #define ROM_TPIU_ENTRY_PRES_MASK                     (0x00000001u)
        #define ROM_TPIU_ENTRY_PRES_BIT                      (0)
        #define ROM_TPIU_ENTRY_PRES_BITS                     (1)

#define ROM_ETM                                              *((volatile uint32_t *)0xE00FF014u)
#define ROM_ETM_REG                                          *((volatile uint32_t *)0xE00FF014u)
#define ROM_ETM_ADDR                                         (0xE00FF014u)
#define ROM_ETM_RESET                                        (0xFFF0F002u)
        /* ADDR_OFF field */
        #define ROM_ETM_ADDR_OFF                             (0xFFFFF000u)
        #define ROM_ETM_ADDR_OFF_MASK                        (0xFFFFF000u)
        #define ROM_ETM_ADDR_OFF_BIT                         (12)
        #define ROM_ETM_ADDR_OFF_BITS                        (20)
        /* FORMAT field */
        #define ROM_ETM_FORMAT                               (0x00000002u)
        #define ROM_ETM_FORMAT_MASK                          (0x00000002u)
        #define ROM_ETM_FORMAT_BIT                           (1)
        #define ROM_ETM_FORMAT_BITS                          (1)
        /* ENTRY_PRES field */
        #define ROM_ETM_ENTRY_PRES                           (0x00000001u)
        #define ROM_ETM_ENTRY_PRES_MASK                      (0x00000001u)
        #define ROM_ETM_ENTRY_PRES_BIT                       (0)
        #define ROM_ETM_ENTRY_PRES_BITS                      (1)

#define ROM_END                                              *((volatile uint32_t *)0xE00FF018u)
#define ROM_END_REG                                          *((volatile uint32_t *)0xE00FF018u)
#define ROM_END_ADDR                                         (0xE00FF018u)
#define ROM_END_RESET                                        (0x00000000u)
        /* END field */
        #define ROM_END_END                                  (0xFFFFFFFFu)
        #define ROM_END_END_MASK                             (0xFFFFFFFFu)
        #define ROM_END_END_BIT                              (0)
        #define ROM_END_END_BITS                             (32)

#define ROM_MEMTYPE                                          *((volatile uint32_t *)0xE00FFFCCu)
#define ROM_MEMTYPE_REG                                      *((volatile uint32_t *)0xE00FFFCCu)
#define ROM_MEMTYPE_ADDR                                     (0xE00FFFCCu)
#define ROM_MEMTYPE_RESET                                    (0x00000001u)
        /* MEMTYPE field */
        #define ROM_MEMTYPE_MEMTYPE                          (0x00000001u)
        #define ROM_MEMTYPE_MEMTYPE_MASK                     (0x00000001u)
        #define ROM_MEMTYPE_MEMTYPE_BIT                      (0)
        #define ROM_MEMTYPE_MEMTYPE_BITS                     (1)

#define ROM_PID4                                             *((volatile uint32_t *)0xE00FFFD0u)
#define ROM_PID4_REG                                         *((volatile uint32_t *)0xE00FFFD0u)
#define ROM_PID4_ADDR                                        (0xE00FFFD0u)
#define ROM_PID4_RESET                                       (0x00000000u)
        /* PID field */
        #define ROM_PID4_PID                                 (0x0000000Fu)
        #define ROM_PID4_PID_MASK                            (0x0000000Fu)
        #define ROM_PID4_PID_BIT                             (0)
        #define ROM_PID4_PID_BITS                            (4)

