contiki-os/contiki/cpu/arm/stm32l152/regs.h
#define ROM_PID5                                             *((volatile uint32_t *)0xE00FFFD4u)
#define ROM_PID5_REG                                         *((volatile uint32_t *)0xE00FFFD4u)
#define ROM_PID5_ADDR                                        (0xE00FFFD4u)
#define ROM_PID5_RESET                                       (0x00000000u)
        /* PID field */
        #define ROM_PID5_PID                                 (0x0000000Fu)
        #define ROM_PID5_PID_MASK                            (0x0000000Fu)
        #define ROM_PID5_PID_BIT                             (0)
        #define ROM_PID5_PID_BITS                            (4)

#define ROM_PID6                                             *((volatile uint32_t *)0xE00FFFD8u)
#define ROM_PID6_REG                                         *((volatile uint32_t *)0xE00FFFD8u)
#define ROM_PID6_ADDR                                        (0xE00FFFD8u)
#define ROM_PID6_RESET                                       (0x00000000u)
        /* PID field */
        #define ROM_PID6_PID                                 (0x0000000Fu)
        #define ROM_PID6_PID_MASK                            (0x0000000Fu)
        #define ROM_PID6_PID_BIT                             (0)
        #define ROM_PID6_PID_BITS                            (4)

#define ROM_PID7                                             *((volatile uint32_t *)0xE00FFFDCu)
#define ROM_PID7_REG                                         *((volatile uint32_t *)0xE00FFFDCu)
#define ROM_PID7_ADDR                                        (0xE00FFFDCu)
#define ROM_PID7_RESET                                       (0x00000000u)
        /* PID field */
        #define ROM_PID7_PID                                 (0x0000000Fu)
        #define ROM_PID7_PID_MASK                            (0x0000000Fu)
        #define ROM_PID7_PID_BIT                             (0)
        #define ROM_PID7_PID_BITS                            (4)

#define ROM_PID0                                             *((volatile uint32_t *)0xE00FFFE0u)
#define ROM_PID0_REG                                         *((volatile uint32_t *)0xE00FFFE0u)
#define ROM_PID0_ADDR                                        (0xE00FFFE0u)
#define ROM_PID0_RESET                                       (0x00000000u)
        /* PID field */
        #define ROM_PID0_PID                                 (0x0000000Fu)
        #define ROM_PID0_PID_MASK                            (0x0000000Fu)
        #define ROM_PID0_PID_BIT                             (0)
        #define ROM_PID0_PID_BITS                            (4)

#define ROM_PID1                                             *((volatile uint32_t *)0xE00FFFE4u)
#define ROM_PID1_REG                                         *((volatile uint32_t *)0xE00FFFE4u)
#define ROM_PID1_ADDR                                        (0xE00FFFE4u)
#define ROM_PID1_RESET                                       (0x00000000u)
        /* PID field */
        #define ROM_PID1_PID                                 (0x0000000Fu)
        #define ROM_PID1_PID_MASK                            (0x0000000Fu)
        #define ROM_PID1_PID_BIT                             (0)
        #define ROM_PID1_PID_BITS                            (4)

#define ROM_PID2                                             *((volatile uint32_t *)0xE00FFFE8u)
#define ROM_PID2_REG                                         *((volatile uint32_t *)0xE00FFFE8u)
#define ROM_PID2_ADDR                                        (0xE00FFFE8u)
#define ROM_PID2_RESET                                       (0x00000000u)
        /* PID field */
        #define ROM_PID2_PID                                 (0x0000000Fu)
        #define ROM_PID2_PID_MASK                            (0x0000000Fu)
        #define ROM_PID2_PID_BIT                             (0)
        #define ROM_PID2_PID_BITS                            (4)

#define ROM_PID3                                             *((volatile uint32_t *)0xE00FFFECu)
#define ROM_PID3_REG                                         *((volatile uint32_t *)0xE00FFFECu)
#define ROM_PID3_ADDR                                        (0xE00FFFECu)
#define ROM_PID3_RESET                                       (0x00000000u)
        /* PID field */
        #define ROM_PID3_PID                                 (0x0000000Fu)
        #define ROM_PID3_PID_MASK                            (0x0000000Fu)
        #define ROM_PID3_PID_BIT                             (0)
        #define ROM_PID3_PID_BITS                            (4)

#define ROM_CID0                                             *((volatile uint32_t *)0xE00FFFF0u)
#define ROM_CID0_REG                                         *((volatile uint32_t *)0xE00FFFF0u)
#define ROM_CID0_ADDR                                        (0xE00FFFF0u)
#define ROM_CID0_RESET                                       (0x0000000Du)
        /* CID field */
        #define ROM_CID0_CID                                 (0x000000FFu)
        #define ROM_CID0_CID_MASK                            (0x000000FFu)
        #define ROM_CID0_CID_BIT                             (0)
        #define ROM_CID0_CID_BITS                            (8)

#define ROM_CID1                                             *((volatile uint32_t *)0xE00FFFF4u)
#define ROM_CID1_REG                                         *((volatile uint32_t *)0xE00FFFF4u)
#define ROM_CID1_ADDR                                        (0xE00FFFF4u)
#define ROM_CID1_RESET                                       (0x00000010u)
        /* CID field */
        #define ROM_CID1_CID                                 (0x000000FFu)
        #define ROM_CID1_CID_MASK                            (0x000000FFu)
        #define ROM_CID1_CID_BIT                             (0)
        #define ROM_CID1_CID_BITS                            (8)

#define ROM_CID2                                             *((volatile uint32_t *)0xE00FFFF8u)
#define ROM_CID2_REG                                         *((volatile uint32_t *)0xE00FFFF8u)
#define ROM_CID2_ADDR                                        (0xE00FFFF8u)
#define ROM_CID2_RESET                                       (0x00000005u)
        /* CID field */
        #define ROM_CID2_CID                                 (0x000000FFu)
        #define ROM_CID2_CID_MASK                            (0x000000FFu)
        #define ROM_CID2_CID_BIT                             (0)
        #define ROM_CID2_CID_BITS                            (8)

#define ROM_CID3                                             *((volatile uint32_t *)0xE00FFFFCu)
#define ROM_CID3_REG                                         *((volatile uint32_t *)0xE00FFFFCu)
#define ROM_CID3_ADDR                                        (0xE00FFFFCu)
#define ROM_CID3_RESET                                       (0x000000B1u)
        /* CID field */
        #define ROM_CID3_CID                                 (0x000000FFu)
        #define ROM_CID3_CID_MASK                            (0x000000FFu)
        #define ROM_CID3_CID_BIT                             (0)
        #define ROM_CID3_CID_BITS                            (8)

/* VENDOR block */
#define DATA_VENDOR_BASE                                     (0xE0100000u)
#define DATA_VENDOR_END                                      (0xFFFFFFFFu)
#define DATA_VENDOR_SIZE                                     (DATA_VENDOR_END - DATA_VENDOR_BASE + 1)

/*---------------------------------------------------------------------------*/
#endif  /*REGS_H_*/
/*---------------------------------------------------------------------------*/
